Repository: dojoengine/book
Catalog: po/*.po
Languages: es, ko, zh_cn

source: To integrate the ERC20 module into your world, you must first deploy the ERC20 Dojo contract. Subsequently, install the systems and components into your world.
es: Para integrar el módulo ERC20 en su World, primero debe implementar el contrato ERC20 Dojo. Posteriormente, instale los Systems y componentes en su World.
ko: ERC20 모듈을 월드에 통합하려면 먼저 ERC20 Dojo 컨트랙트를 배포해야 합니다. 그런 다음 시스템과 컴포넌트를 월드에 설치합니다.
zh_cn: 要将 ERC20 模块集成到您的世界中，您必须首先部署 ERC20 Dojo 合约。然后，将系统和组件安装到您的世界中。

source: # Overview
es: # Descripción General
ko: # 개요
zh_cn: # 概览

source: Dojo is BYO client, meaning that you can use any client you want to connect to the Dojo network.
es: Dojo es un cliente BYO, lo que significa que puede utilizar cualquier cliente que desee para conectarse a la red Dojo.
ko: Dojo는 BYO 클라이언트로, Dojo 네트워크에 연결하고 싶은 모든 클라이언트를 사용할 수 있습니다.
zh_cn: Dojo 是 BYO 客户端，这意味着您可以使用任何客户端连接到 Dojo 网络。

source: > Dojo is always looking to expand these clients, if you would like to contribute reach out into the [Discord](https://discord.gg/KG9w9BmDrV)
es: > Dojo siempre está buscando expandir estos clientes, si desea contribuir, comuníquese con [Discord](https://discord.gg/KG9w9BmDrV)

source: # Javascript Libraries
es: # Bibliotecas Javascript
ko: # 자바스크립트 라이브러리
zh_cn: # Javascript 库

source: > Javascript is a great way to get started with Dojo. It's easy to use, and you can get started in minutes.
es: > Javascript es una excelente manera de comenzar con Dojo. Es fácil de usar y puede comenzar en minutos.
ko: > 자바스크립트는 Dojo를 시작하는 좋은 방법입니다. 사용하기 쉬우며 몇 분 안에 시작할 수 있습니다.
zh_cn: > Javascript 是入门 Dojo 的好方法。它简单易用，几分钟就能上手。

source: ### Examples using these:
es: ### Ejemplos que usan estos:
ko: ### 이를 사용한 예제:
zh_cn: ### 使用的例子：

source: This is the lowest level library, and is used by all other downstream libraries. It contains the core functionality of Dojo and exposes the contract interfaces. Use it if you want to build your own library on top of Dojo.
es: Esta es la biblioteca de nivel más bajo y la utilizan todas las demás bibliotecas posteriores. Contiene la funcionalidad principal de Dojo y expone las interfaces del contrato. Úselo si desea construir su propia biblioteca sobre Dojo.
ko: 저수준의 라이브러리로, 다른 모든 다운스트림 라이브러리에서 사용됩니다. Dojo의 핵심 기능을 포함하고 컨트랙트 인터페이스를 노출합니다. Dojo 위에 자신만의 라이브러리를 구축하려는 경우 이 라이브러리를 사용하세요.
zh_cn: 这是最底层的库，所有其他下游库都使用它。它包含 Dojo 的核心功能，并公开合约接口。如果您想在 Dojo 的基础上构建自己的库，请使用它。

source: Create burner is a simple way to incorporate burner wallets into your Dojo app.
es: Crear burner es una forma sencilla de incorporar carteras quemadoras en su aplicación Dojo.

source: These are utils for helping with interfacing dojo.
es: Estas son utilidades para ayudar con la interfaz de dojo.

source: [Reopsitory](https://github.com/dojoengine/packages/tree/main/packages/utils)
es: [Repository](https://github.com/dojoengine/packages/tree/main/packages/utils)

source: ## Torii Client
es: ## Cliente Torii

source: Torii client is a rust client for interacting with Dojo worlds. It can be compiled to wasm to be used in JS clients, or can used directly in Rust clients or other lower level languages with bindings.
es: El cliente Torii es un cliente Rust para interactuar con los Worlds Dojo. Se puede compilar en wasm para usarlo en clientes JS, o puede usarse directamente en clientes Rust u otros lenguajes de nivel inferior con enlaces.

source: ### Usage in Rust projects
es: ### Uso en proyectos de Rust

source: Update or revert to a specific Dojo branch with ease.
es: Actualice o vuelva a una rama de Dojo específica con facilidad.
ko: 특정 Dojo 브랜치를 쉽게 업데이트하거나 되돌릴 수 있습니다.
zh_cn: 轻松更新或还原到特定的 Dojo 分支。

source: ## Installing
es: ## Instalando
ko: ## 설치
zh_cn: ## 安装

source: ## Usage
es: ## Uso
ko: ## 사용법
zh_cn: ## 使用方法

source: To install latest **stable** version:
es: Para instalar la última versión **estable**:
ko: 최신 **stable** 버전을 설치하려면:
zh_cn: 安装最新的**稳定**版本：

source: > Note: You may have to install `jq` to use `dojoup`. You can do so with the following commands:
es: > Nota: Es posible que tengas que instalar `jq` para usar `dojoup`. Puedes hacerlo con los siguientes comandos:
ko: > 참고: `dojoup`을 사용하려면 `jq`를 설치해야 할 수 있습니다. 다음 명령어를 사용하여 설치할 수 있습니다:
zh_cn: > 注意：您可能需要安装 `jq` 才能使用 `dojoup`。您可以使用以下命令进行安装：

source: To install a specific **version** (in this case the `nightly` version):
es: Para instalar una **versión** específica (en este caso, la versión `nightly`):
ko: 특정 **버전**(이 경우 `nightly`버전)을 설치합니다:
zh_cn: 安装特定**版本**（此处为 "nightly "版本）：

source: To install a specific **branch** (in this case the `release/0.1.0` branch's latest commit):
es: Para instalar una **rama** específica (en este caso, la última confirmación de la rama `release/0.1.0`):
ko: 특정 **브랜치**(이 경우 `release/0.1.0` 브랜치의 최신 커밋)를 설치하려면:
zh_cn: 安装特定的**分支**（在本例中为 `release/0.1.0` 分支的最新提交）：

source: To install a **fork's main branch** (in this case `tarrencev/dojo`'s main branch):
es: Para instalar una **rama principal de la bifurcación** (en este caso, la rama principal de `tarrencev/dojo`):
ko: **포크의 메인 브랜치**를 설치하려면(이 경우 `tarrencev/dojo`의 메인 브랜치):
zh_cn: 安装**分叉的主分支**（本例中为 `tarrencev/dojo` 的主分支）：

source: To install a **specific branch in a fork** (in this case the `patch-10` branch's latest commit in `tarrencev/dojo`):
es: Para instalar una **rama específica en una bifurcación** (en este caso, la última confirmación de la rama `patch-10` en `tarrencev/dojo`):
ko: 포크에 **특정 브랜치**를 설치하려면(이 경우 `patch-10` 브랜치의 최신 커밋이 `tarrencev/dojo`에 있습니다):
zh_cn: 安装分叉中的**特定分支**（在本例中，安装`tarrencev/dojo`中`patch-10`分支的最新提交）：

source: To install from a **specific Pull Request**:
es: Para instalar desde una **Pull Request específica**:
ko: **특정 풀 리퀘스트**에서 설치하려면:
zh_cn: 从**特定的Pull Request**进行安装：

source: To install from a **specific commit**:
es: Para instalar desde una **commit específico**:
ko: **특정 커밋**에서 설치하려면:
zh_cn: 从**特定提交**进行安装：

source: To install a local directory or repository (e.g. one located at `~/git/dojo`, assuming you're in the home directory)
es: Para instalar un directorio o repositorio local (por ejemplo, uno ubicado en `~/git/dojo`, suponiendo que esté en el directorio de inicio)
ko: 로컬 디렉터리 또는 레포지토리(예: 홈 디렉터리에 있다고 가정할 때 `~/git/dojo`에 있는 디렉터리)를 설치하려면 다음과 같이 합니다.
zh_cn: 安装本地目录或版本库（例如位于 `~/git/dojo` 的版本库，假设您在主目录下）

source: ##### Note: --branch, --repo, and --version flags are ignored during local installations.
es: ##### Nota: Los indicadores --branch, --repo y --version se ignoran durante las instalaciones locales.
ko: ##### 참고: --branch, --repo 및 --version 플래그는 로컬 설치 시 무시됩니다.
zh_cn: ##### 注意：本地安装时，--branch、--repo 和--version 标识符将被忽略。

source: **Tip**: All flags have a single character shorthand equivalent! You can use `-v` instead of `--version`, etc.
es: **Consejo**: ¡Todas las banderas tienen un equivalente taquigráfico de un solo carácter! Puede usar `-v` en lugar de `--version`, etc.
ko: **팁**: 모든 플래그는 한 글자씩 약어로 표기할 수 있습니다! `—version` 대신 `-v` 등을 사용할 수 있습니다.
zh_cn: **提示**：所有标识符都有对应的单字符缩写！您可以使用 `-v` 代替 `--version` 等。

source: ### Precompiled binaries
es: ### Binarios precompilados
ko: ### 미리 컴파일된 바이너리
zh_cn: ### 预编译的二进制文件

source: Precompiled binaries are available from the [GitHub releases page](https://github.com/dojoengine/dojo/releases). These are better managed by using [Dojoup](#using-dojoup).
es: Los archivos binarios precompilados están disponibles en la [página de releases de GitHub] (https://github.com/dojoengine/dojo/releases). Estos se gestionan mejor utilizando [Dojoup](#using-dojoup).
ko: 미리 컴파일된 바이너리는 [GitHub 릴리스 페이지](https://github.com/dojoengine/dojo/releases)에서 사용할 수 있습니다. [Dojoup](#using-dojoup)를 사용하면 더 잘 관리할 수 있습니다.
zh_cn: 预编译的Dojo二进制文件可从[GitHub上的发行页面](https://github.com/dojoengine/dojo/releases)获取。 使用[Dojoup](#using-dojoup)可以更好地管理这些二进制文件。

source: > ℹ️ **Note** > > If you're on Windows, you will need to install and use [Git BASH](https://gitforwindows.org/) or [WSL](https://learn.microsoft.com/en-us/windows/wsl/install), > as your terminal, since Dojoup currently does not support Powershell or Cmd.
es: > ℹ️ **Nota** > > Si estás en Windows, necesitarás instalar y usar [Git BASH](https://gitforwindows.org/) o [WSL](https://learn.microsoft.com/en-us/windows/ wsl/instalar), > como su terminal, ya que Dojoup actualmente no es compatible con Powershell o Cmd.
ko: > ℹ️ **참고** > > Windows를 사용하는 경우, [Git BASH](https://gitforwindows.org/) 또는 [WSL](https://learn.microsoft.com/en-us/windows/wsl/install)을 설치하여, > 이를 터미널로 사용해야 합니다. Dojoup은 현재 파워쉘이나 Cmd를 지원하지 않습니다.
zh_cn: > ℹ️ **注** > > 如果您使用的是 Windows 系统，则需要安装并使用 [Git BASH](https://gitforwindows.org/) 或 [WSL](https://learn.microsoft.com/en-us/windows/wsl/install)、 > 因为 Dojoup 目前不支持 Powershell 或 Cmd。

source: `sozo` is a powerful all-in-one tool for managing your Dojo projects. It helps with everything from scaffolding a new project, all the way to deploying and interacting with your Dojo Worlds. It includes a migration planning tool, designed to streamline the updating and deployment of AWs. It provides a robust command-line interface (CLI) that simplifies World management tasks, enabling you to focus on the creative aspects of World-building. In the future, it may include a GUI.
es: `sozo` es una poderosa herramienta todo en uno para gestionar sus proyectos Dojo. Ayuda con todo, desde la preparación de un nuevo proyecto hasta la implementación e interacción con sus Dojo Worlds. Incluye una herramienta de planificación de migración, diseñada para agilizar la actualización y la implementación de AWs. Proporciona una sólida interfaz de línea de comandos (CLI) que simplifica las tareas de gestión de Worlds, permitiéndole centrarse en los aspectos creativos de la construcción de Worlds. En el futuro, puede incluir una GUI.
ko: `sozo`는 Dojo 프로젝트를 관리할 수 있는 강력한 올인원 도구입니다. 새 프로젝트의 템플릿부터 Dojo 월드 배포 및 상호 작용에 이르기까지 모든 것을 도와줍니다. 여기에는 AW의 업데이트와 배포를 간소화하도록 설계된 마이그레이션 도구가 포함되어 있습니다. 월드 관리 작업을 간소화하는 강력한 명령줄 인터페이스(CLI)를 제공하여 월드 구축의 창의적인 측면에 집중할 수 있도록 지원합니다. 향후에는 GUI가 포함될 수 있습니다.
zh_cn: `sozo`（译者注：sozo是日文“創造”的罗马字） 是一款功能强大的多合一工具，用于管理 Dojo 项目。从搭建新项目的脚手架，一直到部署和与 Dojo Worlds 交互，它都能提供帮助。它包括一个迁移规划工具，旨在简化 AW 的更新和部署。它提供了一个强大的命令行界面（CLI），可简化世界管理任务，让您专注于世界构建的创意方面。将来，它还可能包括图形用户界面。

source: ## Features
es: ## Características
ko: ## 특징
zh_cn: ## 功能

source: - **Binary CLI**: Sozo provides an intuitive binary CLI, ensuring easy management of your Worlds, whether you're updating existing ones or deploying new ones.
es: - **CLI Binaria**: Sozo proporciona una CLI binaria intuitiva, lo que garantiza una fácil administración de tus Worlds, ya sea que estés actualizando los existentes o implementando otros nuevos.
ko: - **바이너리 CLI**: Sozo는 직관적인 바이너리 CLI를 제공하여 기존 월드를 업데이트 하거나 새 월드를 배포하여 월드를 쉽게 관리할 수 있습니다.
zh_cn: - **二进制包 CLI**：Sozo 提供直观的二进制包 CLI，确保了用户能轻松管理世界，无论是更新现有世界还是部署新世界。

source: ## Installation
es: ## Instalación
ko: ## 설치
zh_cn: ## 安装

source: `sozo` binary can be installed via [`dojoup`](../../getting-started/quick-start.md), our dedicated installation package manager.
es: El binario `sozo` se puede instalar a través de [`dojoup`](../../getting-started/quick-start.md), nuestro administrador de paquetes de instalación dedicado.
ko: `sozo` 바이너리는 전용 설치 패키지 관리자인 [`dojoup`](../../getting-started/quick-start.md)를 통해 설치할 수 있습니다.
zh_cn: `sozo` 二进制文件可通过[`dojoup`](../../getting-started/quick-start.md)安装，这是我们专用的安装包管理器。

source: ### Installing from Source
es: ### Instalación desde la fuente
ko: ### 소스 코드로 부터 설치하기
zh_cn: ### 从源码安装

source: This will install Sozo and the required dependencies on your local system.
es: Esto instalará Sozo y las dependencias necesarias en su sistema local.
ko: 이렇게 하면 로컬 시스템에 Sozo와 필요한 종속성이 설치됩니다.
zh_cn: 这将在本地系统中安装 Sozo 和所需的依赖项。

source: > 📚 **Reference** > > See the [`sozo` Reference](./reference.md) for a complete overview of all the available subcommands.
es: > 📚 **Referencia** > > Consulte la [`sozo` Reference](./reference.md) para obtener una descripción completa de todos los subcomandos disponibles.
ko: > 📚 **참조** > > 사용 가능한 모든 하위 명령에 대한 전체 개요는 [`sozo` Reference](./reference.md)를 참조하세요.
zh_cn: > 📚 **参考资料** > > 关于所有可用子命令的完整概述，请参阅 [`sozo`参考资料](./reference.md)。

source: ## sozo reference
es: ## Referencia sozo
zh_cn: ## sozo 参考资料

source: ### Project Commands
es: ### Comandos del Proyecto
ko: ### 프로젝트 명령문
zh_cn: ### 项目命令

source: ### World Commands
es: ### Comandos de World
ko: ### 월드 명령문
zh_cn: #### 世界命令

source: `init` is used to initialize a new project. It will initialize a new project in the current directory by cloning the [dojo-starter](https://github.com/dojoengine/dojo-starter).
es: `init` se utiliza para inicializar un nuevo proyecto. Inicializará un nuevo proyecto en el directorio actual clonando [dojo-starter](https://github.com/dojoengine/dojo-starter).
ko: `init`은 새 프로젝트를 초기화하는 데 사용됩니다.[dojo-starter](https://github.com/dojoengine/dojo-starter)를 복제하여 현재 디렉토리에 새 프로젝트를 초기화합니다.
zh_cn: `init` 用于初始化一个新项目。它将通过克隆 [dojo-starter](https://github.com/dojoengine/dojo-starter) 在当前目录下初始化一个新项目。

source: `build` is used to compile the cairo contracts, generating the necessary artifacts for deployment.
es: `build` se utiliza para compilar los contratos de Cairo, generando los artefactos necesarios para la implementación.
ko: `build`는 cairo 컨트랙트를 컴파일하여 배포에 필요한 아티팩트를 생성하는 데 사용됩니다.
zh_cn: `build` 用于编译 cairo 合约，生成部署所需的构件。

source: `test` is used to test the project's cairo contracts. It will run all tests found within the project.
es: `test` se utiliza para probar los contratos de Cairo del proyecto. Ejecutará todas las pruebas encontradas dentro del proyecto.
ko: `test`는 프로젝트의 cairo 컨트랙트들을 테스트하는 데 사용됩니다. 프로젝트 내에서 발견되는 모든 테스트를 실행합니다.
zh_cn: `test`用于测试项目的Cairo合约。它将运行项目中的所有测试。

source: `migrate` is used to perform the migration (deployment) process, declaring and deploying contracts as necessary to deploy or update the World.
es: `migrate` se utiliza para realizar el proceso de migración (implementación), declarando e implementando contratos según sea necesario para implementar o actualizar el World.
ko: `migrate`은 마이그레이션(배포) 프로세스를 수행하는 데 사용되며, 월드 배포 또는 업데이트에 필요한 컨트랙트를 선언하고 배포합니다.
zh_cn: `migrate`用于执行迁移（部署）流程，根据部署或更新世界的需要声明和部署合约。

source: Changes made to the local World after the initial deployment, can easily be pushed to the remote counterpart by running `sozo migrate --world <WORLD_ADDRESS>` with `WORLD_ADDRESS` being the address of the remote World. In the background, `migrate` will compute the diffs of the local and remote World, then, start constructing a migration strategy to determine, if any, which part of the local World needs to be pushed upstream.
es: Los cambios realizados en el World local después de la implementación inicial se pueden enviar fácilmente a la contraparte remota ejecutando `sozo migrate --world <WORLD_ADDRESS>` siendo `WORLD_ADDRESS` la dirección del World remoto. En segundo plano, `migrate` calculará las diferencias entre el World local y remoto, luego comenzará a construir una estrategia de migración para determinar, si corresponde, qué parte del World local necesita ser impulsada hacia arriba.
ko: 최초 배포 후 로컬 월드에 대한 변경 사항은 `sozo migrate --world <WORLD_ADDRESS>`를 실행하여 원격 월드에 쉽게 푸시할 수 있으며, 여기서 `WORLD_ADDRESS`는 원격 월드의 주소입니다. `migrate`는 백그라운드에서 로컬 월드와 원격 월드의 차이를 계산한 다음, 로컬 월드의 어느 부분을 업스트림으로 푸시해야 하는지 결정하기 위한 마이그레이션 전략 구성을 시작합니다.
zh_cn: 在初始部署后对本地世界所做的更改，可以通过运行 `sozo migrate --world <WORLD_ADDRESS>`（其中 `WORLD_ADDRESS`是远程世界的地址）轻松推送到远程世界。在后台，`migrate` 会计算本地世界和远程世界的差异，然后开始构建迁移策略，以确定（如果有的话）本地世界的哪一部分需要推送到上游。

source: ### USAGE
es: ### USO
ko: ### 사용 방법
zh_cn: ### 用例

source: ### OPTIONS
es: ### OPCIONES
ko: ### 옵션
zh_cn: ### 选项

source: #### General Options
es: #### Opciones Generales
ko: #### 일반 옵션
zh_cn: #### 常规选项

source: `--name` _NAME_ &nbsp;&nbsp;&nbsp;&nbsp;Name of the World. At the moment, the only usage for this option is to be used as a salt when deploying the World contract to avoid address conflicts. This option is **required** when performing the initial migration of the World.
es: `--name` _NAME_ &nbsp;&nbsp;&nbsp;&nbsp;Nombre del World. Por el momento, el único uso de esta opción es como sal al implementar el contrato mundial para evitar conflictos de direcciones. Esta opción es **obligatoria** al realizar la migración inicial del World.
ko: `—name` _NAME_ &nbsp;&nbsp;&nbsp;&nbsp;월드의 이름입니다. 현재 이 옵션의 유일한 용도는 주소 충돌을 피하기 위해 월드 컨트랙트를 배포할 때 솔트로 사용하는 것입니다. 이 옵션은 월드의 초기 마이그레이션을 수행할 때 **필수**입니다.
zh_cn: `--name` _NAME_ &nbsp;&nbsp;&nbsp;&nbsp;世界的名称。目前，该选项的唯一用途是在部署 "世界 "合约时用作 "盐"，以避免地址冲突。在执行 "世界 "的初始迁移时，该选项是**必需的**。

source: #### World Options
es: #### Opciones de World
ko: #### 월드 옵션
zh_cn: #### 世界选项

source: `--world` _WORLD_ADDRESS_ &nbsp;&nbsp;&nbsp;&nbsp;The address of the World contract. &nbsp;&nbsp;&nbsp;&nbsp;ENV: `DOJO_WORLD_ADDRESS`
es: `--world` _WORLD_ADDRESS_ &nbsp;&nbsp;&nbsp;&nbsp;La dirección del contrato del World. &nbsp;&nbsp;&nbsp;&nbsp;ENV: `DOJO_WORLD_ADDRESS`
ko: `—world` _WORLD_ADDRESS_ &nbsp;&nbsp;&nbsp;&nbsp;월드 컨트랙트의 주소입니다. &nbsp;&nbsp;&nbsp;&nbsp;ENV: `DOJO_WORLD_ADDRESS`
zh_cn: `--world` _WORLD_ADDRESS_ &nbsp;&nbsp;&nbsp;&nbsp;世界合约的地址。 &nbsp;&nbsp;&nbsp;&nbsp;ENV: `DOJO_WORLD_ADDRESS`

source: #### Starknet Options
es: #### Opciones de Starknet
ko: #### 스타크넷 옵션
zh_cn: #### Starknet选项

source: `--rpc-url` _URL_ &nbsp;&nbsp;&nbsp;&nbsp;The Starknet RPC endpoint. [default: http://localhost:5050] &nbsp;&nbsp;&nbsp;&nbsp;ENV: `STARKNET_RPC_URL`
es: `--rpc-url` _URL_ &nbsp;&nbsp;&nbsp;&nbsp;El punto final RPC de Starknet. [predeterminado: http://localhost:5050] &nbsp;&nbsp;&nbsp;&nbsp;ENV: `STARKNET_RPC_URL`
ko: `—rpc-url` _URL_ &nbsp;&nbsp;&nbsp;&nbsp;스타크넷 RPC 엔드포인트입니다. [default: http://localhost:5050] &nbsp;&nbsp;&nbsp;&nbsp;ENV: `STARKNET_RPC_URL`
zh_cn: `--rpc-url` _URL_ &nbsp;&nbsp;&nbsp;&nbsp;Starknet RPC 端点。[默认: http://localhost:5050] &nbsp;&nbsp;&nbsp;&nbsp;ENV: `STARKNET_RPC_URL`

source: #### Account Options
es: #### Opciones de Cuenta
ko: #### 계정 옵션
zh_cn: #### 账户选项

source: `--account-address` _ACCOUNT_ADDRESS_ &nbsp;&nbsp;&nbsp;&nbsp;The Starknet account address. &nbsp;&nbsp;&nbsp;&nbsp;ENV: `DOJO_ACCOUNT_ADDRESS`
es: `--account-address` _ACCOUNT_ADDRESS_ &nbsp;&nbsp;&nbsp;&nbsp;La dirección de la cuenta de Starknet. &nbsp;&nbsp;&nbsp;&nbsp;ENV: `DOJO_ACCOUNT_ADDRESS`
ko: `—account-address` _ACCOUNT_ADDRESS_ &nbsp;&nbsp;&nbsp;&nbsp;스타크넷 계정 주소입니다. &nbsp;&nbsp;&nbsp;&nbsp;ENV: `DOJO_ACCOUNT_ADDRESS`
zh_cn: `--account-address` _ACCOUNT_ADDRESS_ &nbsp;&nbsp;&nbsp;&nbsp;Starknet账户地址。 &nbsp;&nbsp;&nbsp;&nbsp;ENV: `DOJO_ACCOUNT_ADDRESS`

source: #### Signer Options - Raw
es: #### Opciones del Signer - Raw
ko: #### 서명자 옵션
zh_cn: #### 签名者选项 - Raw

source: `--private-key` _PRIVATE_KEY_ &nbsp;&nbsp;&nbsp;&nbsp;The raw private key associated with the account contract. &nbsp;&nbsp;&nbsp;&nbsp;ENV: `DOJO_PRIVATE_KEY`
es: `--private-key` _PRIVATE_KEY_ &nbsp;&nbsp;&nbsp;&nbsp;La clave privada sin procesar asociada con el contrato de cuenta. &nbsp;&nbsp;&nbsp;&nbsp;ENV: `DOJO_PRIVATE_KEY`
ko: `—private-key` _PRIVATE_KEY_ &nbsp;&nbsp;&nbsp;&nbsp;계정 컨트랙트와 연결된 프라이빗 키입니다. &nbsp;&nbsp;&nbsp;&nbsp;ENV: `DOJO_PRIVATE_KEY`
zh_cn: `--private-key` _PRIVATE_KEY_ &nbsp;&nbsp;&nbsp;&nbsp;与账户合同相关的Raw私钥。 &nbsp;&nbsp;&nbsp;&nbsp;ENV: `DOJO_PRIVATE_KEY`

source: #### Signer Options - Keystore
es: #### Opciones del Signer - Keystore
ko: #### 서명자 옵션 - 키스토어
zh_cn: #### 签名者选项 - Keystore

source: `--keystore` _PATH_ &nbsp;&nbsp;&nbsp;&nbsp;Use the keystore in the given folder or file.
es: `--keystore` _PATH_ &nbsp;&nbsp;&nbsp;&nbsp;Utilice el keystore en la carpeta o archivo indicado.
ko: `—keystore` _PATH_ &nbsp;&nbsp;&nbsp;&nbsp;지정된 폴더 또는 파일에 있는 키스토어를 사용합니다.
zh_cn: `--keystore` _PATH_ &nbsp;&nbsp;&nbsp;&nbsp;使用指定文件夹或文件中的keystore。

source: `--password` _PASSWORD_ &nbsp;&nbsp;&nbsp;&nbsp;The keystore password. Used with --keystore. &nbsp;&nbsp;&nbsp;&nbsp;ENV: `DOJO_KEYSTORE_PASSWORD`
es: `--password` _PASSWORD_ &nbsp;&nbsp;&nbsp;&nbsp;La contraseña del keystore. Usado con --keystore. &nbsp;&nbsp;&nbsp;&nbsp;ENV: `DOJO_KEYSTORE_PASSWORD`
ko: `—password` _PASSWORD_ &nbsp;&nbsp;&nbsp;&nbsp;키스토어 비밀번호. 키스토어와 함께 사용됩니다. &nbsp;&nbsp;&nbsp;&nbsp;ENV: `DOJO_KEYSTORE_PASSWORD`
zh_cn: `--password` _PASSWORD_ &nbsp;&nbsp;&nbsp;&nbsp;keystore的密码. 需要与 --keystore 参数一起使用. &nbsp;&nbsp;&nbsp;&nbsp;ENV: `DOJO_KEYSTORE_PASSWORD`

source: ### EXAMPLES
es: ## EJEMPLOS
ko: ### 예제
zh_cn: #### 示例

source: 1. Deploying your World for the first time to a local Katana node
es: 1. Implementar tu World por primera vez en un nodo Katana local
ko: 1. 로컬 Katana 노드에 처음으로 월드 배포하기
zh_cn: 1. 首次在本地 Katana 节点上部署你的世界

source: 2. Updating a remote World after making some changes
es: 2. Actualizar un World remoto después de realizar algunos cambios
ko: 2. 수정 사항 적용 후 원격 월드 업데이트하기
zh_cn: 2. 更改后更新远程世界

source: `execute` is used to execute a World's system.
es: `execute` se utiliza para ejecutar el sistema de un World.
ko: `execute`은 월드의 시스템을 실행하는 데 사용됩니다.
zh_cn: `execute` 用于执行一个世界的系统。

source: Performing a system execution requires sending a transaction, therefore, `execute` expects an account address as well as its respective private key in order to sign the transaction before sending it.
es: Realizar una ejecución del sistema requiere enviar una transacción, por lo tanto, `execute` espera una dirección de cuenta así como su respectiva clave privada para poder firmar la transacción antes de enviarla.
ko: 시스템을 실행하려면 트랜잭션을 전송해야 하므로 `execute`은 트랜잭션을 전송하기 전에 트랜잭션에 서명하기 위한 계정 주소와 해당 개인키를 요구합니다.
zh_cn: 执行系统需要发送事务，因此，`execute`需要一个账户地址及其私钥，以便在发送事务之前对其进行签名。

source: `--calldata` _CALLDATA_ &nbsp;&nbsp;&nbsp;&nbsp;The calldata to be passed to the system that you want to execute. &nbsp;&nbsp;&nbsp;&nbsp;Comma separated values e.g., 0x12345,0x69420.
es: `--calldata` _CALLDATA_ &nbsp;&nbsp;&nbsp;&nbsp;Los datos de llamada que se pasarán al sistema que desea ejecutar. &nbsp;&nbsp;&nbsp;&nbsp;Valores separados por comas, por ejemplo, 0x12345,0x69420.

source: 1. Executing the _position_ system which takes two values (_x_: 0x77 and _y_: 0x44)
es: 1. Ejecutando el sistema _position_ el cual toma dos valores (_x_: 0x77 y _y_: 0x44)
ko: 1. 두 개의 값(_x_: 0x77, _y_: 0x44)을 가지는 _position_ 시스템을 실행합니다
zh_cn: 1. 执行 _position_ 系统，该系统取两个值（ _x_ : 0x77 和 _y_ : 0x44）

source: `register` is used to register new systems and components.
es: `register` se utiliza para registrar nuevos Systems y componentes.
ko: `register`은 새 시스템과 컴포넌트를 등록하는 데 사용됩니다.
zh_cn: `register` 用于注册新系统和组件。

source: `system` is used to interact with a World's systems. It is useful for querying about a system's information.
es: `system` se utiliza para interactuar con los Systems de un World. Es útil para consultar información sobre un sistema.
ko: `system`은 월드의 시스템과 상호작용하는 데 사용됩니다. 시스템 정보를 쿼리할 때 유용합니다.
zh_cn: `system`用于与世界的系统进行交互。它有助于查询系统信息。

source: ### SUBCOMMANDS
es: ### SUBCOMANDOS
ko: ### 하위 명령
zh_cn: ### 子命令

source: Get the class hash of a system
es: Obtener el class hash de un sistema
ko: 시스템의 클래스 해시 가져오기
zh_cn: 获取系统的Class Hash

source: ##### Arguments
es: ##### Argumentos
ko: ##### 인자들
zh_cn: ##### 参数

source: _`NAME`_ &nbsp;&nbsp;&nbsp;&nbsp;The name of the system
es: _`NAME`_ &nbsp;&nbsp;&nbsp;&nbsp;El nombre del sistema
ko: _`NAME`_ &nbsp;&nbsp;&nbsp;&nbsp;시스템의 이름
zh_cn: _`NAME`_ &nbsp;&nbsp;&nbsp;&nbsp;系统名称

source: Retrieve the component dependencies of a system
es: Recuperar las dependencias de los componentes de un sistema
ko: 시스템의 컴포넌트 종속성 검색
zh_cn: 检索系统的组件依赖关系

source: 1. Get the class hash of the _spawn_ system
es: 1. Obtenga el class hash del sistema _spawn_
ko: 1. _spawn_ 시스템의 클래스 해시를 가져옵니다
zh_cn: 1. 获取 _spawn_ 系统的Class Hash

source: 2. Get the component dependencies of the _spawn_ system
es: 2. Obtenga las dependencias de los componentes del sistema _spawn_
ko: 2. _spawn_ 시스템의 컴포넌트 종속성 가져오기
zh_cn: 2. 获取 _spawn_ 系统的组件依赖关系
