Repository: dojoengine/book
Catalog: po/*.po
Languages: es, ko, zh_cn

source: - Built a Dojo world - Deployed the project to Katana - Ran the spawn system locally - Indexed the world with Torii
ko: - Dojo 월드 구축 - Katana에 프로젝트 배포 - 로컬에서 spawn 시스템 실행 - Torii로 월드 인덱싱
zh_cn: - 构建一个 Dojo 世界 - 将项目部署到 Katana - 在本地运行生成系统 - 用 Torii 索引世界

source: Dojo worlds are defined in their Scarb.toml files. This is just a [Scarb](https://docs.swmansion.com/scarb/) file which is an excellent Cairo package manager and project manager.
ko: Dojo 월드는 Scarb.toml 파일에 정의되어 있습니다. 이것은 훌륭한 Cairo 패키지 관리자이자 프로젝트 매니징 툴인 [Scarb](https://docs.swmansion.com/scarb/) 파일입니다.
zh_cn: Dojo 世界在其 Scarb.toml 文件中定义。这是一个 [Scarb](https://docs.swmansion.com/scarb/) 文件，Scarb是一个出色的Cairo软件包管理器和项目管理器。

source: ## World Contract
ko: ## 월드 컨트랙트
zh_cn: ## 世界合约

source: The world contract functions as a central system kernel, serving as the foundation for initiating and resolving all interactions. Within this kernel, contracts are deployed, registered, and executed, streamlining the process for downstream systems by enabling clients to engage with a single contract rather than potentially hundreds.
ko: 월드 컨트랙트는 중앙 시스템 커널로 기능하며 모든 상호작용을 시작하고 해결하기 위한 기반이 됩니다. 이 커널 내에서 컨트랙트가 배포, 등록, 실행되므로 클라이언트가 수백 개의 컨트랙트가 아닌 단일 컨트랙트에 참여할 수 있어 다운스트림 시스템의 프로세스를 간소화할 수 있습니다.
zh_cn: 世界合约是一个中央系统内核，是启动和解决所有交互的基础。在这个内核中，合约被部署、注册和执行，简化了下游系统的流程，使得客户只需与一个合约而不是潜在的数百个合约打交道。

source: Dojo core abstracts this contract away from the developer as a developer you do not write it and it is not meant to be altered when building a world. However, it's important to understand how it works and how it interacts with the rest of the system.
ko: Dojo는 컨트랙트를 개발자가 작성하지 않고 월드 빌드 시 변경할 수 없도록 추상화하여 개발자가 신경써야 할 부분을 줄였습니다. 하지만 컨트랙트가 어떻게 작동하고 나머지 시스템과 어떻게 상호 작용하는지 이해하는 것은 중요합니다.
zh_cn: Dojo 核心将此合约抽象化，作为开发者，您无需编写此合约，也无需在构建世界时对其进行修改。但是，了解它的工作原理以及它与系统其他部分的交互方式非常重要。

source: > **To think about:** Consider Autonomous Worlds as sovereign blockchains residing within another blockchain - a nested blockchain, so to speak. Just as you can deploy contracts onto Ethereum to enhance its functionality, you can similarly introduce systems into the World contract to enrich its features. While anyone can contribute to the World, akin to Ethereum, authorization is required to interact with component state. There is a dedicated topic to Authorisation.
ko: > **생각해볼 점:** 자율 월드는 다른 블록체인 안에 존재하는 주권 블록체인, 즉 중첩된 블록체인으로 생각해볼 수 있습니다. 이더리움에 컨트랙트를 배포하여 기능을 강화할 수 있는 것처럼, 월드 컨트랙트에도 마찬가지로 시스템을 도입하여 기능을 강화할 수 있습니다. 이더리움과 마찬가지로 누구나 월드에 기여할 수 있지만, 구성 요소 상태와 상호 작용하려면 권한 부여가 필요합니다.
zh_cn: > **思考：** 将自治世界视为驻留在另一个区块链中的主权区块链--可以说是嵌套区块链。正如你可以在以太坊上部署合约来增强其功能一样，你也可以在世界合约中引入系统来丰富其功能。与以太坊类似，任何人都可以为 "世界 "做出贡献，但与组件状态交互需要授权。有一个专门的主题会讨论授权。

source: ### Context
ko: ### 컨텍스트
zh_cn: ### Context（上下文）

source: You will notice every System accepts a `Context` struct as the first parameter. This is a special struct that contains information about the world and the caller.
ko: 모든 시스템이 첫 번째 파라미터로 `Context` 구조체를 받는 것을 알 수 있습니다. 이 구조체는 월드와 호출자에 대한 정보를 포함하는 특수한 구조체입니다.
zh_cn: 你会注意到，每个 System 都接受一个 `Context` 结构体作为第一个参数。这是一个特殊的结构体，包含有关世界和调用者的信息。

source: ## Components
ko: ## 컴포넌트(Components)
zh_cn: ## 组件

source: > Components = Data
ko: > 구성 요소 = 데이터
zh_cn: > 组件 = 数据

source: Components serve as the foundation for defining the world's structure, encapsulating state for systems to mutate.
ko: 컴포넌트는 월드의 구조를 정의하는 기반이 되며, 시스템이 변경할 수 있는 상태를 캡슐화합니다.
zh_cn: 组件是定义世界结构的基础，封装了系统变异的状态。

source: When designing a world's components, it is crucial to carefully consider the abstractions you create, always keeping composability in mind.
ko: 월드의 컴포넌트를 디자인할 때는 항상 composability(조립성)을 염두에 두고 추상화를 신중하게 고려하는 것이 중요합니다.
zh_cn: 在设计一个世界中的组件时，必须仔细考虑所创建的抽象概念，并始终牢记可组合性。

source: ### Components are Structs
ko: ### 컴포넌트는 구조체
zh_cn: ### 组件是结构体

source: Components are defined as structs in Cairo. They can contain any number of fields, however it is best practice in ECS to have small isolated components. This promotes modularity and composability, allowing you to reuse components across multiple entity types.
ko: 컴포넌트는 Cairo에서 구조체로 정의됩니다. 컴포넌트에는 여러 필드를 포함할 수 있지만, ECS에서는 작은 독립 컴포넌트를 사용하는 것이 가장 좋습니다. 이렇게 하면 모듈성과 composability가 향상되어 여러 엔티티 유형에서 컴포넌트를 재사용할 수 있습니다.
zh_cn: 组件在 Cairo 中被定义为结构体。它们可以包含任意数量的字段，但在 ECS 中，最好的做法是使用小的孤立组件。这样可以促进模块化和可组合性，使您可以在多个实体类型中重复使用组件。

source: The `#[key]` attribute indicates to Dojo that this component is indexed by the `player` field. You need to define a key for each component, as this is how you query the component. However, you can create composite keys by defining multiple fields as keys.
ko: `#[key]` 속성은 이 컴포넌트가 `player` 필드에 의해 인덱싱되었음을 Dojo에 알려줍니다. 컴포넌트를 쿼리하는 방식이므로 각 컴포넌트에 대해 키를 정의해야 합니다. 그러나 여러 필드를 키로 정의하여 복합 키를 만들 수 있습니다.
zh_cn: `#[key]` 属性向 Dojo 表明，该组件是由 `player` 字段索引的。您需要为每个组件定义一个键，因为这是您查询组件的方式。不过，您可以通过将多个字段定义为键来创建复合键。

source: In this case you then would set the component with both the player and location fields:
ko: 이 경우 플레이어 필드와 위치 필드를 모두 사용하여 컴포넌트를 설정합니다:
zh_cn: 在这种情况下，您就可以通过player和location字段来设置组件：

source: Components can implement traits. This is useful for defining common functionality across components. For example, you may want to define a `Position` component that implements a `PositionTrait` trait. This trait could define functions such as `is_zero` and `is_equal` which could be used when accessing the component.
ko: 컴포넌트는 특성을 구현할 수 있습니다. 이는 컴포넌트 간에 공통된 기능을 정의할 때 유용합니다. 예를 들어, `Position` 컴포넌트에서 `PositionTrait` 특성을 구현하는 것을 정의할 수 있습니다. 이 특성은 컴포넌트에 접근할 때 사용할 수 있는 `is_zero` 및 `is_equal`과 같은 함수를 정의할 수 있습니다.
zh_cn: 组件可以实现trait。这对于定义跨组件的通用功能非常有用。例如，您可能想定义一个实现了 `PositionTrait` trait的 `Position` 组件。该trait可定义 `is_zero` 和 `is_equal` 等函数，这些函数可在访问组件时使用。

source: #### Custom Setting Components
ko: #### 커스텀 컴포넌트(Components)
zh_cn: #### 自定义设置的组件

source: Suppose we need a place to keep a global value with the flexibility to modify it in the future. Take, for instance, a global combat_cool_down parameter that defines the duration required for an entity to be primed for another attack. To achieve this, we can craft a component dedicated to storing this value, while also allowing for its modification via a decentralized governance model.
ko: 만일 차후 수정할 수 있는 유연성과 함께 전역 값을 유지할 수 있는 공간이 필요하다고 가정해 봅시다. 예를 들어, 엔티티가 다른 공격에 대비하는 데 필요한 기간을 정의하는 글로벌 combat_cool_down 매개변수를 생각해 봅시다. 이를 위해 이 값을 저장하는 전용 컴포넌트를 만드는 동시에 분산형 거버넌스 모델을 통해 수정할 수 있습니다.
zh_cn: 假设我们需要一个地方来保存一个全局值，并能在将来灵活地修改它。例如，一个全局的战斗冷却参数（combat_cool_down）定义了一个实体准备再次攻击所需的持续时间。为此，我们可以制作一个组件，专门用于存储这个值，同时还允许通过分散式管理模式对其进行修改。

source: To establish these components, you'd follow the usual creation method. However, when initializing them, employ a constant identifier, such as GAME_SETTINGS_ID.
ko: 이러한 컴포넌트를 설정하려면 일반적인 생성 방법을 따릅니다. 하지만 초기화할 때는 GAME_SETTINGS_ID 와 같은 상수 식별자를 사용하세요.
zh_cn: 要创建这些组件，您可以按照通常的创建方法去创建。不过，在初始化它们时，请使用一个常量标识符，如 GAME_SETTINGS_ID。

source: Support Component types:
ko: 지원 컴포넌트 유형:
zh_cn: 支持的组件类型：

source: Consider a tangible analogy: Humans and Goblins. While they possess intrinsic differences, they share common traits, such as having a position and health. However, humans possess an additional component. Furthermore, we introduce a Counter component, a distinct feature that tallies the numbers of humans and goblins.
ko: 인간과 고블린을 비유로 들어보겠습니다. 인간과 고블린은 본질적인 차이가 있지만, 지위와 건강 같은 공통된 특성을 공유합니다. 하지만 인간에게는 추가적인 구성 요소가 있습니다. 바로 인간과 고블린의 수를 계산하는 카운터 구성 요소입니다.
zh_cn: 下面是个具体的例子：人类和哥布林。虽然它们有着本质上的区别，但却有着共同的trait，比如都会拥有位置（position）和健康（health）。不过，人类拥有一个额外的组件。此外，我们还引入了 "计数器"（Counter）组件，它是用以统计人类和哥布林数量的独特机能。

source: So the Human will have a `Potions`, `Health` and `Position` component, and the Goblin will have a `Health` and `Position` component. By doing we save having to create Health and Position components for each entity type.
ko: 따라서 인간은 `Potions`, `Health`, `Position` 컴포넌트를 갖게 되고 고블린은 `Health`과 `Position` 컴포넌트를 갖게 됩니다. 이렇게 하면 각 엔티티 유형에 대해 체력 및 위치 컴포넌트를 생성할 필요가 없습니다.
zh_cn: 因此，"人类 "将拥有 `Potions`, `Health` 和 `Position` 组件，而 "哥布林 "将拥有 `Health` 和 `Position` 组件。这样，我们就不必为每种实体类型创建 `Health`和 `Position`组件了。

source: ## Systems
ko: ## 시스템(Systems)
zh_cn: ## 系统

source: > Systems = Logic
ko: > 시스템 = 로직
zh_cn: > 系统 = 逻辑

source: Systems underpin the logic of your world. While systems are inherently stateless, their primary role is to modify the state of components. Every system features an 'execute' function that's called upon during interactions within the world.
ko: 시스템은 월드의 로직을 뒷받침합니다. 시스템은 본질적으로 상태가 없지만, 주요 역할은 컴포넌트의 상태를 수정하는 것입니다. 모든 시스템에는 월드 내 상호작용 중에 호출되는 `execute` 함수가 있습니다.
zh_cn: 系统是世界逻辑的基础。虽然系统本质上是无状态的，但其主要作用是修改组件的状态。每个系统都有一个'execute'函数，可在世界内部交互时调用。

source: ### The Execute function
ko: ### 실행 함수
zh_cn: #### 执行函数

source: The `execute` function is mandatory in a system and runs when called, taking `Context` as its first parameter. See more in [Context](./world.md).
ko: `execute` 함수는 시스템에서 필수이며 호출 시 `Context`를 첫 번째 매개변수로 받아 실행됩니다. 자세한 내용은 [Context](./world.md)를 참조하세요.
zh_cn: `execute` 函数在系统中是强制性的，调用时以 `Context` 为第一个参数。更多信息请参阅 [Context](./world.md)。

source: ### Other functions in a System
ko: ### 시스템의 기타 기능
zh_cn: #### 系统中的其他函数

source: You are free to add other functions to your system, but they will not be callable from the world. This is useful for breaking up your logic into smaller chunks.
ko: 시스템에 다른 함수를 자유롭게 추가할 수 있지만 월드에서 호출할 수 없습니다. 이는 로직을 더 작은 덩어리로 나눌 때 유용합니다.
zh_cn: 您可以自由地在系统中添加其他函数，但这些函数不能从世界中调用。这对于将你的逻辑分割成小块非常有用。

source: ### Using View Functions
ko: ### 뷰 함수(View Functions) 사용
zh_cn: ### 使用视图函数

source: There are times when we need to compute the value of a component dynamically, rather than fetching its static state. For instance, in the context of a VRGDA, if you want to ascertain the current price, merely querying the component state won't suffice. Instead, you'd need to compute the price based on certain parameters and the current state.
ko: 컴포넌트의 정적 상태를 가져오는 대신 동적으로 값을 계산해야 할 때가 있습니다. 예를 들어, VRGDA의 경우 현재 가격을 확인하려면 단순히 컴포넌트 상태를 쿼리하는 것만으로는 충분하지 않습니다. 대신 특정 파라미터와 현재 상태를 기반으로 가격을 계산해야 합니다.
zh_cn: 有时，我们需要动态地计算组件的值，而不是获取其静态状态。例如，在 VRGDA 中，如果要确定当前价格，仅查询组件状态是不够的。相反，您需要根据某些参数和当前状态来计算价格。

source: This is where view functions come into play.
ko: 여기서 뷰 기능이 중요한 역할을 합니다.
zh_cn: 这就是视图函数发挥作用的地方。

source: **What are View Functions?**
ko: **뷰 함수란 무엇인가요?**
zh_cn: **什么是视图函数？**

source: View functions are a way to derive or compute values from the existing state of a component. They are invoked by the world and receive the current state of the component as an argument. Subsequently, these functions return a computed value based on this state.
ko: 뷰 함수는 컴포넌트의 기존 상태로부터 값을 도출하거나 계산하는 방법입니다. 뷰 함수는 월드에서 호출되며 컴포넌트의 현재 상태를 인자로 받습니다. 이후 이 함수는 이 상태를 기반으로 계산된 값을 반환합니다.
zh_cn: 视图函数是从组件的现有状态推导或计算值的一种方法。它们由世界调用，并接收组件的当前状态作为参数。随后，这些函数会返回一个基于该状态的计算值。

source: **Example from VRGDA**:
ko: **VRGDA의 예**:
zh_cn: **来自 VRGDA 的示例**：

source: The below snippet, taken from the VRGDA example available on [this link](https://github.com/dojoengine/dojo-examples), illustrates how to implement a view function:
ko: 아래 코드는 [이 링크](https://github.com/dojoengine/dojo-examples)에서 제공되는 VRGDA 예제에서 발췌한 것으로, 뷰 함수를 구현하는 방법을 설명합니다:
zh_cn: 下面的片段摘自 [这个链接](https://github.com/dojoengine/dojo-examples) 中的 VRGDA 示例，说明了如何实现视图函数：

source: In this example, the function computes and returns the current price of the VRGDA based on the ongoing state of the auction.
ko: 이 예제에서 함수는 진행 중인 경매 상태를 기반으로 VRGDA의 현재 가격을 계산하여 반환합니다.
zh_cn: 在此示例中，函数根据正在进行的拍卖状态计算并返回 VRGDA 的当前价格。

source: **How to Invoke View Functions?**
ko: **뷰 함수를 호출하는 방법은?**
zh_cn: **如何调用视图函数？**

source: - **Using Dojo Core**: If you are working within the [Dojo Core](../client/npm/core.md), utilize the `call` function. - **For Rust Users**: The [Starkli](https://book.starkli.rs/) library provides a handy method to invoke view functions in Rust.
ko: - **Dojo 사용**: [Dojo Core](../client/npm/core.md) 내에서 작업하는 경우, `call` 기능을 활용하세요. - **Rust 사용자를 위해**: [Starkli](https://book.starkli.rs/) 라이브러리는 Rust에서 뷰 함수를 호출하는 편리한 방법을 제공합니다.
zh_cn: - **使用 Dojo Core**：如果您在 [Dojo Core](../client/npm/core.md) 中开发，请使用 `call` 函数。 - **适用于 Rust 用户**：[Starkli](https://book.starkli.rs/) 库提供了在 Rust 中调用视图函数的便捷方法。

source: I hope this revised version enhances the clarity and flow of the information you want to convey!
ko: 이번 개정판을 통해 전달하고자 하는 정보의 명확성과 흐름이 개선되기를 바랍니다!
zh_cn: 我希望修订后的版本能使您想要传达的信息更加清晰流畅！

source: ### System Authentication
ko: ### 시스템 인증
zh_cn: ### 系统验证

source: Systems must be given permission to write to components. By default they have no permissions. With `sozo` we can however give them permissions to write to components.
ko: 시스템에는 컴포넌트에 대한 쓰기 권한이 부여되어야 합니다. 기본적으로 시스템에는 권한이 없습니다. 그러나 `sozo`를 사용하면 컴포넌트에 대한 쓰기 권한을 부여할 수 있습니다.
zh_cn: 系统必须获得写入组件的权限。默认情况下，它们没有权限。不过，我们可以通过 `sozo` 赋予系统写入组件的权限。

source: Here we have authorised the `Spawn` system to write to the `Moves` component.
ko: 여기서는 `Spawn` 시스템이 `Moves` 컴포넌트에 쓸 수 있도록 권한을 부여했습니다.
zh_cn: 在这里，我们授权 `Spawn` 系统写入`Moves` 组件。

source: Read more in the [sozo](../toolchain/sozo/overview.md) docs.
ko: [sozo](../toolchain/sozo/overview.md) 문서에서 자세히 알아보세요.
zh_cn: 阅读 [sozo](../toolchain/sozo/overview.md) 文档中的更多内容。

source: As discussed in the [World](./world.md) chapter, Autonomous Worlds (AWs) function as sovereign chains nested within a public blockchain. These Worlds are also open to the public. This structure allows anyone to enhance a World by deploying components or systems. However, this openness also introduces security considerations. Similar to Ethereum, interacting with a component's state within a System requires the appropriate authorization from the component owner.
ko: [World](./world.md) 챕터에서 설명한 것처럼, 자율 월드(AW)는 퍼블릭 블록체인 내에 중첩된 주권 체인으로 기능합니다. 이러한 월드는 모두에세 공개됩니다. 이러한 구조를 통해 누구나 구성 요소나 시스템을 배포하여 월드를 개선할 수 있습니다. 그러나 이러한 개방성에는 보안에 대한 고려 사항도 있습니다. 이더리움과 마찬가지로 시스템 내에서 구성 요소의 상태와 상호 작용하려면 컴포넌트 소유자의 적절한 승인이 필요합니다.
zh_cn: 正如[World](./world.md)一章所讨论的，自治世界（AW）的功能是嵌套在公共区块链中的主权链。这些世界也对公众开放。这种结构允许任何人通过部署组件或系统来增强世界。然而，这种开放性也带来了安全方面的考虑。与以太坊类似，在系统中与组件的状态进行交互需要获得组件所有者的适当授权。

source: Every time a `set!` is called in a `System`, the world checks if the `System` has authorization to update the component state. Only when the `System` possesses the necessary authorization, the `set!` is executed. The following diagram illustrates the authorization architecture.
ko: `System`에서 `set!`이 호출될 때마다 월드에서는 `System`이 컴포넌트 상태를 업데이트할 수 있는 권한을 가지고 있는지 확인합니다. `System`에 필요한 권한이 있을 때만 `set!`이 실행됩니다. 다음 다이어그램은 권한 아키텍처를 보여줍니다.
zh_cn: 每次在 `System`中调用 `set!`时，世界都会检查 `System`是否拥有更新组件状态的授权。只有当`System`拥有必要的授权时，`set!`才会被执行。下图说明了授权架构。

source: > The deployer of the Component is its initial owner. A Component owner is able to grant the `owner` and `writer` roles. Only owners can grant a System the `writer` role which allows it to update the Component.
ko: > 컴포넌트의 배포자가 초기 소유자입니다. 컴포넌트 소유자는 `owner` 및 `writer` 역할을 부여할 수 있습니다. 소유자만 시스템에 컴포넌트를 업데이트할 수 있는 `writer` 역할을 부여할 수 있습니다.
zh_cn: > 组件的部署者是其初始所有者。组件所有者可以授予别人 `owner` 和 `writer`角色。只有所有者才能授予系统 `writer`角色，使其可以更新组件。

source: This command will generate a `writer` authorization for the `spawn` system to update the `Moves` component.
ko: 이 명령은 `spawn` 시스템이 `Moves` 컴포넌트를 업데이트할 수 있는 `writer` 권한을 생성합니다.
zh_cn: 该命令将为 `spawn` 系统生成一个 `writer` 授权，以更新 `Moves` 组件。

source: Commands in Dojo are generalized functions that are expanded at compile time to facilitate system execution. They provide a convenient way for systems to interact with the world state by abstracting common operations, such as retrieving or updating components, and generating unique IDs. By leveraging these commands, developers can streamline their system implementations and improve code readability.
ko: Dojo의 명령어는 시스템 실행을 용이하게 하기 위해 컴파일 시 확장되는 일반화된 함수입니다. 컴포넌트 검색 또는 업데이트, 고유 ID 생성 등 일반적인 작업을 추상화하여 시스템이 월드 상태와 상호 작용할 수 있는 편리한 방법을 제공합니다. 개발자는 이러한 명령을 활용하여 시스템 구현을 간소화하고 코드 가독성을 개선할 수 있습니다.
zh_cn: Dojo 中的命令是在编译时扩展的通用函数，便于系统执行。它们通过抽象常见操作（如检索或更新组件以及生成唯一 ID），为系统提供了一种与世界状态交互的便捷方式。通过利用这些命令，开发人员可以简化系统实现并提高代码的可读性。

source: The `get!` command is used to retrieve components from the world state.
ko: `get!` 명령어은 월드에서 컴포넌트를 검색하는 데 사용됩니다.
zh_cn: `get!`命令用于从世界状态中检索组件。

source: Here we are retrieving the `Position` and `Moves` components from the world state. We are also using the `ctx.origin` to retrieve the components for the current entity.
ko: 여기서는 월드에서 `Position` 및 `Moves` 컴포넌트를 검색하고 있습니다. 또한 `ctx.origin`를 사용하여 현재 엔티티의 컴포넌트를 검색하고 있습니다.
zh_cn: 在这里，我们从世界状态中获取 `Position` 和 `Moves`组件。我们还使用 `ctx.origin` 来检索当前实体的组件。

source: The `set!` command is used to update components state.
ko: `set!` 명령은 컴포넌트 상태를 업데이트하는 데 사용됩니다.
zh_cn: `set!` 命令用于更新组件状态。

source: Here we are updating the `Moves` and `Position` components in the world state using the `ctx.origin` as the entity id.
ko: 여기서는 `ctx.origin`를 엔티티 ID로 사용하여 월드의 `Moves` 및 `Position` 컴포넌트를 업데이트하고 있습니다.
zh_cn: 在这里，我们使用 `ctx.origin` 作为实体 ID，更新世界状态中的 `Moves` 和 `Position` 组件。

source: The `emit!` command is used to emit custom events.
ko: `emit!` 명령은 사용자 지정 이벤트를 내보내는 데 사용됩니다.
zh_cn: `emit!`命令用于发射自定义事件。

source: Events play a pivotal role in decoding the dynamics of a Dojo world. Every time there's an update to a `Component`, the `World` contract emits these events. What's even more exciting is that you can craft your own custom events to fit specific needs! Moreover, thanks to [Torii](../toolchain/torii/overview.md), all these events are seamlessly indexed, ensuring easy and efficient querying.
ko: 이벤트는 Dojo 월드의 전체적인 구성을 이해하는 데 중요한 역할을 합니다. `Component`에 업데이트가 있을 때마다 `World` 컨트랙트는 이러한 이벤트를 발생시킵니다. 더욱 흥미로운 점은 특정 요구에 맞게 맞춤형 이벤트를 만들 수 있다는 것입니다! 또한, [Torii](../toolchain/torii/overview.md) 덕분에 이러한 모든 이벤트가 원활하게 인덱스 되어서 쉽고 효율적으로 쿼리할 수 있습니다.
zh_cn: 事件在让外部了解 Dojo 世界中的动态时起着关键作用。每次`Component`更新时，`World` 合约都会发出这些事件。更令人兴奋的是，你可以根据特定需求制作自己的自定义事件！此外，由于使用了 [Torii](../toolchain/torii/overview.md)，所有这些事件都被无缝地索引起来，确保了轻松高效的查询。

source: Consider this example of a `Moves` component:
ko: `Moves` 컴포넌트의 예를 생각해 보겠습니다:
zh_cn: 请看 `Moves` 组件的示例：

source: Within your systems, emitting custom events can be highly beneficial. Fortunately, there's a handy `emit!` macro that lets you release events directly from your world. Use it like so:
ko: 시스템 내에서 커스텀 이벤트를 방출하면 매우 유용할 수 있습니다. 다행히도 월드에서 직접 이벤트를 출력할 수 있는 편리한 `emit!` 매크로가 있습니다. 이렇게 사용하세요:
zh_cn: 在您的系统中，发射自定义事件是非常有益的。幸运的是，有一个方便的 `emit!`宏可以让您直接从您的世界中发射事件。使用方法如下：

source: ## Testing
ko: ## 테스트
zh_cn: ## 测试

source: It is best practise to include unit tests in the same file as the Component/System you are writing.
ko: 유닛 테스트는 작성 중인 컴포넌트/시스템과 동일한 파일에 포함하는 것이 가장 좋습니다.
zh_cn: 最佳做法是将单元测试包含在与正在编写的组件/系统相同的文件中。

source: Lets show a `Component` test example from the [dojo-starter](https://github.com/dojoengine/dojo-starter):
ko: [dojo-starter](https://github.com/dojoengine/dojo-starter)의 `Component` 테스트 예제를 확인해 봅시다:
zh_cn: 让我们展示一个来自 [dojo-starter](https://github.com/dojoengine/dojo-starter) 的 `Component` 测试示例：

source: In this test we are testing the `is_zero` and `is_equal` functions of the `Position` component. It is good practise to test all functions of your components.
ko: 이 테스트에서는 `Position` 컴포넌트의 `is_zero` 및 `is_equal` 함수를 테스트합니다. 컴포넌트의 모든 함수를 테스트하는 것이 좋습니다.
zh_cn: 在本测试中，我们将测试 `Position` 组件的 `is_zero` 和 `is_equal` 函数。测试组件的所有函数是一种很好的实践。

source: `spawn_test_world(components, systems)` - This function will create a test world with the components and systems you pass in. It will also deploy the world and register the components and systems.
ko: `spawn_test_world(components, systems)` - 이 함수는 사용자가 전달한 컴포넌트와 시스템으로 테스트 월드를 생성합니다. 또한 월드를 배포하고 컴포넌트와 시스템을 등록합니다.
zh_cn: `spawn_test_world(components, systems)` - 这个函数将用你传入的组件和系统创建一个测试世界。它还将部署该世界并注册组件和系统。

source: Reference clients are available for the following platforms:
ko: 참조 클라이언트는 다음 플랫폼에서 이용 가능합니다:
zh_cn: 参考客户端可在以下平台获取：

source: This is a direct fork of [Mud React](https://github.com/latticexyz/mud/tree/main/packages)
ko: [Mud React](https://github.com/latticexyz/mud/tree/main/packages)의 직접적인 포크입니다
zh_cn: 这是对 [Mud React](https://github.com/latticexyz/mud/tree/main/packages) 的直接分叉

source: This library contains a set of React components that can be used when building React apps using Dojo.
ko: 이 라이브러리에는 Dojo를 사용하여 React 앱을 빌드할 때 사용할 수 있는 React 컴포넌트 세트가 포함되어 있습니다.
zh_cn: 该库包含一组 React 组件，可用于使用 Dojo 构建 React 应用程序。

source: Create burner is a simply way to incorporate burner wallets into your Dojo app.
ko: 버너 생성은 Dojo 앱에 버너 지갑을 통합하는 간단한 방법입니다.
zh_cn: Create burner 是将burner钱包集成到 Dojo 应用程序中的简单方法。

source: [Reopsitory](https://github.com/dojoengine/create-burner)
ko: [Repository](https://github.com/dojoengine/create-burner)

source: This library abstracts away the world interface and provides a set of helper functions to interact with the world. It is preferred to use this library over interacting with the world directly.
ko: 이 라이브러리는 월드 인터페이스를 추상화하고 월드와 상호작용할 수 있는 helper 함수를 제공합니다. 월드와 직접 상호작용하는 것보다 이 라이브러리를 사용하는 것이 좋습니다.
zh_cn: 该库抽象了世界界面，并提供了一组与世界交互的辅助函数。与直接与世界交互相比，我们更倾向于使用该库。

source: ### Getting Started
ko: ### 시작하기
zh_cn: ### 开始

source: ### Example Usage
ko: ### 사용 예시
zh_cn: ### 使用示例

source: This is an example from [Dojo React App](https://github.com/dojoengine/dojo-starter-react-app)
ko: 이것은 [Dojo 리액트 앱](https://github.com/dojoengine/dojo-starter-react-app)의 예시입니다
zh_cn: 本例来自 [Dojo React App](https://github.com/dojoengine/dojo-starter-react-app)。

source: `--calldata` _CALLDATA_ &nbsp;&nbsp;&nbsp;&nbsp;The calldata to be passed to the system that you want to execute. &nbsp;&nbsp;&nbsp;&nbsp;Comma seperated values e.g., 0x12345,0x69420.
ko: `—calldata` _CALLDATA_ &nbsp;&nbsp;&nbsp;&nbsp;실행하려는 시스템에 전달할 호출 데이터입니다. &nbsp;&nbsp;&nbsp;&nbsp;쉼표로 구분된 값(e.g., 0x12345,0x69420).
zh_cn: `--calldata` _CALLDATA_ &nbsp;&nbsp;&nbsp;&nbsp;要传给系统执行的 calldata。 &nbsp;&nbsp;&nbsp;&nbsp;以逗号分隔的值，例如 0x12345,0x69420。

source: #### `dependency`
ko: #### `종속성`

source: ## sozo component
ko: ## sozo 컴포넌트

source: Retrieve the schema for a component
ko: 컴포넌트에 대한 스키마 검색
zh_cn: 获取组件的scbema

source: _`KEYS`_ &nbsp;&nbsp;&nbsp;&nbsp;The keys of the entity that you want to query. &nbsp;&nbsp;&nbsp;&nbsp;Comma seperated values e.g., 0x12345,0x69420,...
ko: _`KEYS`_ &nbsp;&nbsp;&nbsp;&nbsp;쿼리하려는 엔티티의 키입니다. &nbsp;&nbsp;&nbsp;&nbsp;쉼표로 구분된 값(예: 0x12345,0x69420,...).
zh_cn: _`KEYS`_ &nbsp;&nbsp;&nbsp;&nbsp;要查询的实体的键值。 &nbsp;&nbsp;&nbsp;&nbsp;以逗号分隔的值，例如：0x12345,0x69420,...

source: ## sozo events
ko: ## sozo 이벤트

source: ## sozo auth
ko: ## sozo 인증

source: ### NAME
ko: ### 이름
zh_cn: ### 名称

source: ```sh # Produces a new block every 10 seconds katana --block-time 10 ```
ko: ```sh # 10초마다 새 블록을 생성합니다 katana --block-time 10 ```

source: `-b, --block-time <MILLISECONDS>` Block time in milliseconds for interval mining.
ko: `-b, —block-time <MILLISECONDS>` &nbsp;&nbsp;&nbsp;&nbsp; 인터벌 마이닝을 위한 블록 시간(밀리초) 입니다.

source: If you prefer to install from the source code:
ko: 소스 코드에서 설치하는 것을 선호하는 경우:
zh_cn: 如果您更喜欢从源代码中安装请：

source: ### Name
ko: ### 이름
zh_cn: ### 名称

source: #### Database URL
ko: #### 데이터베이스 URL
zh_cn: #### 数据库 URL

source: - The in-memory database is ephermal and only lasts as long as the indexer is running. This is a fast and simple option to start the indexer for development/testing. - Presistent storage should be used in production. It relies on the local filesystem for storage.
ko: - 인메모리 데이터베이스는 임시적으로 인덱서가 실행되는 동안에만 지속됩니다. 이것은 개발/테스트를 위해 인덱서를 시작하는 빠르고 간단한 옵션입니다. - 프로덕션 환경에서는 영구 저장소를 사용해야 합니다. 로컬 파일 시스템을 저장소로 사용합니다.
zh_cn: - 内存数据库是非持久存在的，只有索引器运行时才会存在。这是在开发/测试中启动索引器的快速而简单的选择。 - 生产环境中应使用持久存储。它依赖本地文件系统进行存储。

source: ```sh # Persistent database storage using file indexer.db torii --database-url sqlite:indexer.db ```
ko: ```sh # indexer.db 파일을 사용한 영구 데이터베이스 저장소 torii --database-url sqlite:indexer.db ```

source: `--rpc` &nbsp;&nbsp;&nbsp;&nbsp; Starknet RPC endpoing to use [default: http//localhost:5050]
ko: `--rpc` &nbsp;&nbsp;&nbsp;&nbsp; 사용할 스타크넷 RPC 주소 [기본값: http//localhost:5050]
zh_cn: `--rpc` &nbsp;&nbsp;&nbsp;&nbsp; 要使用的Starknet RPC 终端 [默认：http//localhost:5050]
