Repository: dojoengine/book
Catalog: po/*.po
Languages: es, ko, zh_cn

source: To establish these models, you'd follow the usual creation method. However, when initializing them, employ a constant identifier, such as GAME_SETTINGS_ID.
es: Para establecer estos Models, seguirías el método de creación habitual. Sin embargo, al inicializarlos, emplee un identificador constante, como GAME_SETTINGS_ID.

source: #### Types
es: #### Tipos
ko: #### 유형
zh_cn: #### 类型

source: Support model types:
es: Tipos de Models que soporta:

source: It is currently not possible to use Arrays.
es: Actualmente no es posible utilizar Arrays.
ko: 현재 배열은 사용할 수 없습니다.
zh_cn: 目前无法使用数组。

source: #### Custom Types + Enums
es: #### Tipos Personalizados + Enums

source: For models containing complex types, it's crucial to implement the `SchemaIntrospection` trait.
es: Para Models que contienen tipos complejos, es crucial implementar el trait `SchemaIntrospection`.

source: Consider the model below:
es: Considere el siguiente Model:

source: For complex types, like `Roles` in the above example, you need to implement `SchemaIntrospection`. Here's how:
es: Para tipos complejos, como `Roles` en el ejemplo anterior, es necesario implementar `SchemaIntrospection`. Así es cómo:

source: ### In practice with modularity in mind
es: ### En la práctica teniendo en cuenta la modularidad
ko: ### 모듈화를 염두에 둔 실제 사례
zh_cn: #### 在实践中考虑模块性

source: Consider a tangible analogy: Humans and Goblins. While they possess intrinsic differences, they share common traits, such as having a position and health. However, humans possess an additional model. Furthermore, we introduce a Counter model, a distinct feature that tallies the numbers of humans and goblins.
es: Considere una analogía tangible: Humanos y Duendes. Si bien poseen diferencias intrínsecas, comparten rasgos comunes, como tener una posición y salud. Sin embargo, los humanos poseen un Model adicional. Además, presentamos un Model de contador, una característica distintiva que cuenta el número de humanos y duendes.

source: So the Human will have a `Potions`, `Health` and `Position` model, and the Goblin will have a `Health` and `Position` model. By doing we save having to create Health and Position models for each entity type.
es: Entonces el Humano tendrá un Model de `Potions`, `Health` y `Position`, y el Duende tendrá un Model de `Health` y `Position`. Al hacerlo nos ahorramos tener que crear Models de Salud y Posición para cada tipo de entidad.

source: So then a system would look like this:
es: Entonces un sistema quedaría así:
ko: 그러면 시스템은 다음과 같이 보일 것입니다:
zh_cn: 因此，一个系统会像是这样：

source: > A complete example can be found in the [Dojo Starter](https://github.com/dojoengine/dojo-starter)
es: > Puede encontrar un ejemplo completo en [Dojo Starter](https://github.com/dojoengine/dojo-starter)
ko: > 전체 예제는 [Dojo Starter](https://github.com/dojoengine/dojo-starter)에서 확인할 수 있습니다
zh_cn: > 完整示例见 [Dojo Starter](https://github.com/dojoengine/dojo-starter)

source: ## Commands
es: ## Comandos
ko: ## 명령어
zh_cn: ## 命令

source: - Commands are shorthand ways to write function calls - Commands abstract complex queries into shorthands - Commands are similar to rust macros
es: - Los Comandos son formas abreviadas de escribir llamadas a funciones. - Los Comandos abstraen consultas complejas en taquigrafías - Los Comandos son similares a las macros de Rust

source: Understanding commands is key to understanding Dojo. You will leverage them heavily within the systems you design.
es: Comprender los comandos es clave para entender Dojo. Los aprovechará en gran medida dentro de los Systems que diseñe.
ko: 명령어를 이해하는 것은 Dojo를 이해하는 데 핵심입니다. 게임을 설계하는 동안 명령어를 많이 활용하게 되기 때문입니다.
zh_cn: 理解命令是理解 Dojo 的关键。您将在设计系统时大量使用它们。

source: Commands in Dojo are generalized functions that are expanded at compile time to facilitate system execution. They provide a convenient way for systems to interact with the world state by abstracting common operations, such as retrieving or updating models, and generating unique IDs. By leveraging these commands, developers can streamline their system implementations and improve code readability.
es: Los comandos en Dojo son funciones generalizadas que se expanden en tiempo de compilación para facilitar la ejecución del sistema. Proporcionan una forma conveniente para que los Systems interactúen con el estado del World abstrayendo operaciones comunes, como recuperar o actualizar Models, y generar identificaciones únicas. Al aprovechar estos comandos, los desarrolladores pueden optimizar las implementaciones de sus Systems y mejorar la legibilidad del código.

source: ### Using commands
es: ### Usando comandos
ko: ### 명령어 사용
zh_cn: ### 使用命令

source: Commands are used within systems to interact with the world state. They are called using the following syntax:
es: Los comandos se utilizan dentro de los Systems para interactuar con el estado del World. Se llaman usando la siguiente sintaxis:
ko: 명령어는 시스템 내에서 월드 상태와 상호작용하는 데 사용됩니다. 명령은 다음 구문을 사용하여 호출됩니다:
zh_cn: 命令用于系统内部与世界状态的交互。它们的调用语法如下：

source: ### The `get!` command
es: ### El comando `get!`
ko: ### `get!` 명령어
zh_cn: ### `get!` 命令

source: The `get!` command is used to retrieve models from the world state:
es: El comando `get!` se utiliza para recuperar Models del estado del World:

source: Here we are retrieving the `Position` and `Moves` models from the world state. We are also using the `caller` to retrieve the models for the current entity.
es: Aquí estamos recuperando los Models de `Position` y `Moves` del estado del World. También estamos usando `caller` para recuperar los Models de la entidad actual.

source: You can then use `position` and `moves` as you would as any other Cairo struct.
es: Luego puede usar `position` y `moves` como lo haría con cualquier otra estructura de Cairo.
ko: 그런 다음 다른 Cairo 구조체와 마찬가지로 `position`과 `moves`를 사용할 수 있습니다.
zh_cn: 然后，您可以像使用其他 Cairo 结构体一样使用 `position` 和 `moves`。

source: ### The `set!` command
es: ### El comando `set!`
ko: ### `set!` 명령어
zh_cn: ### `set！`命令

source: The `set!` command is used to update models state.
es: El comando `set!` se utiliza para actualizar el estado de los Models.

source: Here we are updating the `Moves` and `Position` models in the world state using the `caller` as the entity id.
es: Aquí estamos actualizando los Models `Moves` y `Position` en el estado de World utilizando`caller` como el id de entidad.

source: ### The `emit!` command
es: ### El comando `emit!`
ko: ### `emit!` 명령어
zh_cn: ### `emit！`命令

source: The `emit!` command is used to emit custom events. These events are indexed by [torii](../toolchain/torii/overview.md)
es: El comando `emitir!` se utiliza para emitir eventos personalizados. Estos eventos están indexados por [torii](../toolchain/torii/overview.md)

source: This will emit these values which could be captured by a client or you could query these via [torii](../toolchain/torii/overview.md)
es: Esto emitirá estos valores que podrían ser capturados por un cliente o usted podría consultarlos a través de [torii](../toolchain/torii/overview.md)

source: # Config
es: # Configuración
ko: # 기본 설정
zh_cn: # 配置

source: Dojo worlds are defined in their Scarb.toml files. This is just a regular [Scarb](https://docs.swmansion.com/scarb/) file which is an excellent Cairo package manager and project manager.
es: Los Worlds Dojo se definen en sus archivos Scarb.toml. Este es solo un archivo [Scarb](https://docs.swmansion.com/scarb/) normal que es un excelente administrador de paquetes y administrador de proyectos de Cairo.

source: Full example of a Scarb.toml file:
es: Ejemplo completo de un archivo Scarb.toml:
ko: Scarb.toml 파일의 전체 예시입니다:
zh_cn: Scarb.toml 文件的完整示例：

source: ## Events
es: ## Eventos
ko: ## 이벤트(Events)
zh_cn: ## 事件

source: Events play a pivotal role in decoding the dynamics of a Dojo world. Every time there's an update to a `Model`, the `World` contract emits these events. What's even more exciting is that you can craft your own custom events to fit specific needs! Moreover, thanks to [Torii](../toolchain/torii/overview.md), all these events are seamlessly indexed, ensuring easy and efficient querying.
es: Los eventos juegan un papel fundamental en la decodificación de la dinámica de un World en Dojo. Cada vez que hay una actualización de un `Model`, el contrato `World` emite estos eventos. ¡Lo que es aún más emocionante es que puedes crear tus propios eventos personalizados para satisfacer necesidades específicas! Además, gracias a [Torii](../toolchain/torii/overview.md), todos estos eventos se indexan perfectamente, lo que garantiza una consulta fácil y eficiente.

source: ### Component Events
es: ### Eventos de Componentes
ko: ### 컴포넌트 이벤트
zh_cn: ### 组件事件

source: Consider this example of a `Moves` model:
es: Considere este ejemplo de un Model `Moves`:

source: When this component is updated, the `World` contract will emit an event with the following structure:
es: Cuando se actualice este componente, el contrato `World` emitirá un evento con la siguiente estructura:
ko: 이 컴포넌트가 업데이트되면 `World` 컨트랙트는 다음과 같은 구조의 이벤트를 발생시킵니다:
zh_cn: 当该组件更新时，`World` 合约将发出一个结构如下的事件：

source: This will then be captured by [Torii](../toolchain/torii/overview.md) and indexed for querying. This will allow you to then reconstruct the state of your world.
es: Esto luego será capturado por [Torii](../toolchain/torii/overview.md) y indexado para realizar consultas. Esto te permitirá luego reconstruir el estado de tu World.
ko: 그러면 [Torii](../toolchain/torii/overview.md)에 캡처되어 쿼리를 위해 인덱싱됩니다. 이를 통해 월드의 상태를 재구성할 수 있습니다.
zh_cn: 然后，[Torii](../toolchain/torii/overview.md)将捕获这些信息，并编制索引以供查询。这样，你就可以重建世界的状态。

source: Similarly, when a component is deleted, the `World` contract will emit an event with the following structure:
es: De manera similar, cuando se elimina un componente, el contrato `World` emitirá un evento con la siguiente estructura:
ko: 마찬가지로 컴포넌트가 삭제되면 `World` 컨트랙트는 다음과 같은 구조의 이벤트를 발생시킵니다:
zh_cn: 同样，当一个组件被删除时，`World` 合约将发出一个结构如下的事件：

source: ### World Events
es: ### Eventos de World
ko: ### 월드 이벤트
zh_cn: ### 世界事件

source: The `World` contract also emits events when it's initialized and when new components and systems are registered. These events are emitted with the following structures:
es: El contrato `World` también emite eventos cuando se inicializa y cuando se registran nuevos componentes y Systems. Estos eventos se emiten con las siguientes estructuras:
ko: `World` 컨트랙트는 초기화될 때와 새로운 컴포넌트와 시스템이 등록될 때에도 이벤트를 발생시킵니다. 이러한 이벤트는 다음과 같은 구조로 발생합니다:
zh_cn: 当初始化以及注册新组件和系统时，`World`合约也会发出事件。这些事件通过以下结构体发出：

source: These events are also captured by [Torii](../toolchain/torii/overview.md) and indexed for querying.
es: Estos eventos también son capturados por [Torii](../toolchain/torii/overview.md) y indexados para consultas.
ko: 이러한 이벤트는 [Torii](../toolchain/torii/overview.md)에서도 캡처되어 쿼리를 위해 인덱싱 됩니다.
zh_cn: [Torii](../toolchain/torii/overview.md) 也会捕获这些事件，并编制索引以供查询。

source: ### Custom Events
es: ### Eventos Personalizados
ko: ### 사용자 지정 이벤트
zh_cn: ### 自定义事件

source: Within your systems, emitting custom events can be highly beneficial. Fortunately, there's a handy `emit!` macro that lets you release events directly from your world. These events are indexed by [torii](../toolchain/torii/overview.md)
es: Dentro de sus Systems, la emisión de eventos personalizados puede resultar muy beneficiosa. Afortunadamente, existe una útil macro `emit!` que te permite liberar eventos directamente desde tu World. Estos eventos están indexados por [torii](../toolchain/torii/overview.md)

source: Use it like so:
es: Úselo así:

source: Include this in your system and it will emit an event with the following structure:
es: Incluya esto en su sistema y emitirá un evento con la siguiente estructura:
ko: 이를 시스템에 포함하면 다음과 같은 구조의 이벤트가 발생하게 됩니다:
zh_cn: 在系统中加入此机能后，它将发出一个结构如下的事件：

source: Now a full example using a custom event:
es: Ahora un ejemplo completo usando un evento personalizado:
ko: 이제 사용자 지정 이벤트를 사용한 전체 예제입니다:
zh_cn: 现在是一个使用自定义事件的完整示例：

source: > Note: Read about the `get!` and `set!` macros in [Commands](./commands.md).
es: > Nota: Lea acerca de las macros `get!` y `set!` en [Comandos](./commands.md).
ko: > 참고: [Commands](./commands.md)에서 `get!` 및 `set!` 매크로에 대해 읽어보세요.
zh_cn: > 注意：请阅读 [命令](./commands.md) 中的 `get!` 和 `set!` 宏。

source: ## Authorization
es: ## Autorización
ko: ## 권한 부여
zh_cn: ## 授权

source: > Authorization is crucial to a world, just like how authorization is crucial to any smart contract.
es: > La autorización es crucial para un World, al igual que la autorización es crucial para cualquier smart contrac.
ko: > 모든 스마트 컨트랙트에서 권한 부여가 중요한 것과 마찬가지로 이는 월드에서도 매우 중요합니다.
zh_cn: > 授权对一个世界至关重要，就像授权对任何智能合约都至关重要一样。

source: As discussed in the [World](./world.md) chapter, Autonomous Worlds (AWs) function as sovereign chains nested within a public blockchain. These Worlds are also open to the public. This structure allows anyone to enhance a World by deploying models or systems. However, this openness also introduces security considerations. Similar to Ethereum, interacting with a model's state within a System requires the appropriate authorization from the model owner.
es: Como se analiza en el capítulo [World](./world.md), los Autonomous Worlds (AWs) funcionan como cadenas soberanas anidadas dentro de una cadena de bloques pública. Estos Worlds también están abiertos al público. Esta estructura permite a cualquiera mejorar un World mediante el despliegue de Models o Systems. Sin embargo, esta apertura también introduce consideraciones de seguridad. De manera similar a Ethereum, interactuar con el estado de un Model dentro de un Sistema requiere la autorización adecuada del propietario del Model.

source: ### Auth Architecture
es: ### Arquitectura de Auth
ko: ### 인증 아키텍처
zh_cn: ### 验证架构

source: Every time a `set!` is called in a `System`, the world checks if the `System` has authorization to update the model state. Only when the `System` possesses the necessary authorization, the `set!` is executed. The following diagram illustrates the authorization architecture.
es: Cada vez que se llama a un `set!` en un `System`, el World verifica si el `System` tiene autorización para actualizar el estado del Model. Sólo cuando el `System` posee la autorización necesaria, se ejecuta el `set!`. El siguiente diagrama ilustra la arquitectura de autorización.

source: Authorization Architecture
es: Arquitectura de Autorización
ko: 권한 아키텍처
zh_cn: 授权架构

source: ### Providing Authorization
es: ### Proporcionar Autorización
ko: ## 권한 부여 하기
zh_cn: ### 提供授权

source: > The deployer of the model is its initial owner. A model owner is able to grant the `owner` and `writer` roles. Only owners can grant a System the `writer` role which allows it to update the model.
es: > El implementador del Model es su propietario inicial. Un propietario de Model puede otorgar los roles de `owner` y `writer`. Solo los propietarios pueden otorgarle a un sistema la función de `writer`que le permite actualizar el Model.

source: `sozo` offers a convenient tool to authorize systems.
es: `sozo` ofrece una herramienta conveniente para autorizar Systems.
ko: `sozo`는 시스템을 인증하는 편리한 도구를 제공합니다.
zh_cn: `sozo` 提供了一个授权系统的便捷工具。

source: This command will generate a `writer` authorization for the `spawn` system to update the `Moves` model.
es: Este comando generará una autorización de `writer` para que el sistema `spawn` actualice el Model `Moves`.

source: ## Migration
es: ## Migración

source: ## Migration Guide to 0.3.0
es: ## Guía de Migración a 0.3.0

source: 0.3.0 introduced some breaking changes to Systems and Models which requires reworking of your worlds.
es: 0.3.0 introdujo algunos cambios importantes en los Systems y Models que requieren una reelaboración de sus Worlds.

source: - [Components](#components-to-models) - [Systems](#systems-update) - [Events](#events) - [Npm](#npm)
es: - [Componentes](#componentes-a-Models) - [Systems](#actualización-de-Systems) - [Eventos](#eventos) - [Npm](#npm)

source: ### Components to Models
es: ### Componentes de Models

source: In version 0.3.0, "components" have been renamed to "models". This has been done due to Cairo introducing the concept of Components natively.
es: En la versión 0.3.0, se cambió el nombre de `components` a `models`. Esto se ha hecho debido a que Cairo introdujo el concepto de Components de forma nativa.

source: You must:
es: Usted debe:

source: - Replace `#[component]` with `#[model]`. - Update `#[derive(Component)]` to `#[derive(Model)]` throughout your code.
es: - Reemplace `#[component]` por `#[model]`. - Actualice `#[derive(Component)]` a `#[derive(Model)]` en todo el código.

source: **Note**: Ensure all related files and imports are updated accordingly.
es: **Nota**: Asegúrese de que todos los archivos relacionados y las importaciones se actualicen en consecuencia.

source: ### Changes in Model Implementation
es: ### Cambios en la Implementación del Model

source: The trait `SerdeLen` is no longer implemented for models. If you relied on this previously, you should now use `SchemaIntrospection`.
es: El trait `SerdeLen` ya no se implementa para los Models. Si confiaba en esto anteriormente, ahora debería usar `SchemaIntrospection`.

source: ### Schema Introduction
es: ### Introducción al Esquema

source: **Key Takeaways from custom types**:
es: **Conclusiones clave de los tipos personalizados**:

source: - **size**: Defines the byte size of the type. - **layout**: Outlines the byte structure/layout for the type. Validate and adjust as necessary. - **ty**: Details the specific type, attributes, and subcomponents. For enums, like `Roles`, you need to specify each member and its type.
es: - **size**: Define el tamaño en bytes del tipo. - **layout**: Describe la estructura/diseño de bytes para el tipo. Validar y ajustar según sea necesario. - **ty**: Detalla el tipo, los atributos y los subcomponentes específicos. Para enumeraciones, como `Roles`, debe especificar cada miembro y su tipo.

source: ### Systems Update
es: ### Actualización de Systems

source: Systems in 0.3.0 are very similar now to Cairo Contracts. You can write your systems just like regular contracts, and each dojo contract can contain mulitple systems.
es: Los Systems en 0.3.0 ahora son muy similares a los Contratos de El Cairo. Puede escribir sus Systems como si fueran contratos normales, y cada contrato de dojo puede contener varios Systems.

source: Important high level changes:
es: Cambios importantes de alto nivel:

source: - Systems are now starknet contracts - Define [Interfaces](#interface-creation) for each system contract - New optional `#[dojo::contract]` decorator defining systems - Multiple systems per dojo contract, rather than singular - `execute` is no longer required system selector name
es: - Los Systems ahora son contratos starknet. - Definir [Interfaces](#interface-creation) para cada contrato del sistema - Nuevos Systems opcionales de definición de decoradores `#[dojo::contract]` - Múltiples Systems por contrato de dojo, en lugar de singulares - `execute` ya no es necesario el nombre del selector del sistema

source: #### Interface Creation
es: #### Creación de Interfaz

source: System management has been revamped. Start by defining an interface for each system, which specifies its implementation:
es: La gestión del sistema ha sido renovada. Comience por definir una interfaz para cada sistema, que especifica su implementación:

source: Ensure the trait is typed with `TContractState`.
es: Asegúrese de que el trait esté escrito con`TContractState`.

source: **Note**: Earlier versions required functions within the system to be named `execute`. This is no longer the case.
es: **Nota**: Las versiones anteriores requerían que las funciones dentro del sistema se denominaran `execute`. Este ya no es el caso.

source: #### Interface Implementation
es: #### Implementación de la Interfaz

source: To implement the interface:
es: Para implementar la interfaz:

source: 1. Add `#[external(v0)]` before each method. 2. Ensure to reference the created interface in the module with `use super::ICreateCard;`.
es: 1. Agregue `#[external(v0)]` antes de cada método. 2. Asegúrese de hacer referencia a la interfaz creada en el módulo con `use super::ICreateCard;`.

source: This then allows the `create_card` to be called just like a regular starknet function.
es: Esto permite llamar a `create_card` como una función normal de Starknet.

source: #### `#[dojo::contract]` decorator
es: #### Decorador `#[dojo::contract]`

source: 0.3.0 introduces a new optional decorator `#[dojo::contract]` which indicates to the compiler to inject imports and the world dispatcher. This allows for minimal boilerplate.
es: 0.3.0 introduce un nuevo decorador opcional `#[dojo::contract]` que indica al compilador que inyecte importaciones y el world dispatcher. Esto permite un texto repetitivo mínimo.

source: ### Events
es: ### Eventos

source: Events should now reside within the models. Here's an example of how to migrate your events:
es: Los eventos ahora deberían residir dentro de los Models. A continuación se muestra un ejemplo de cómo migrar sus eventos:

source: **Previous Format**:
es: **Formato Anterior**:

source: **New Format**:
es: **Nuevo Formato**:

source: ### Testing Changes
es: ### Testing de Cambios

source: #### Setup
es: #### Configuración

source: Testing has seen significant changes with the change to systems as Contracts. Instead of using `world.execute`, use the dispatcher.
es: Las pruebas han visto cambios significativos con el cambio a Systems como Contratos. En lugar de utilizar `world.execute`, utilice el dispatcher.

source: 1. Import necessary modules and traits:
es: 1. Importe los módulos y traits necesarios:

source: 2. Deploy the contract and instantiate the dispatcher:
es: 2. Implementar el contrato y crear una instancia del dispatcher:

source: #### Function Testing
es: #### Función Testing

source: With the contract deployed and the dispatcher instantiated, proceed to test your functions:
es: Con el contrato implementado y el dispatcher creado, proceda a probar sus funciones:

source: # Hello Dojo
es: # Hola Dojo
ko: # 헬로 Dojo

source: > This section assumes that you have already installed the Dojo toolchain and are familiar with Cairo. If not, please refer to the [Getting Started](../getting-started/quick-start.md) section.
es: > Esta sección asume que ya ha instalado la cadena de herramientas Dojo y está familiarizado con Cairo. De lo contrario, consulte la sección [Introducción] (../getting-started/quick-start.md).
ko: > 이 섹션에서는 이미 Dojo 툴체인을 설치했고 Cairo에 익숙하다고 가정합니다. 그렇지 않은 경우, [시작하기](../getting-started/quick-start.md) 섹션을 참조하세요.
zh_cn: > 本节假定您已安装 Dojo 工具链并熟悉 Cairo。如果没有，请参阅 [快速入门](../getting-started/quick-start.md)部分。

source: ## Dojo as an ECS in 15 Minutes
es: ## Dojo como ECS en 15 Minutos

source: Although Dojo isn't exclusively an Entity Component System (ECS) framework, we recommend adopting this robust design pattern. In this context, systems shape the environment's logic, while components ([models](./models.md)) mirror the state of the world. By taking this route, you'll benefit from a structured and modular framework that promises both flexibility and scalability in a continuously evolving world. If this seems a bit intricate at first, hang tight; we'll delve into the details shortly.
es: Aunque Dojo no es exclusivamente un marco de Entity Component System (ECS), recomendamos adoptar este sólido patrón de diseño. En este contexto, los Systems dan forma a la lógica del entorno, mientras que los componentes ([models](./models.md)) reflejan el estado del World. Al tomar esta ruta, se beneficiará de un marco estructurado y modular que promete flexibilidad y escalabilidad en un World en continua evolución. Si esto parece un poco complicado al principio, espera; profundizaremos en los detalles en breve.
