Repository: dojoengine/book
Catalog: po/*.po
Languages: es, ko, zh_cn

source: ## What after this guide?
es: ## ¿Qué pasa después de esta guía?
ko: ## 이 가이드 이후에는 어떻게 하나요?
zh_cn: ## 这个教程之后是什么？

source: We're making another guide to help design the frontend. This will make our chess game complete.
es: Estamos creando otra guía para ayudar a diseñar la interfaz. Esto completará nuestro juego de ajedrez.
ko: 프론트엔드 연결을 돕기 위해 또 다른 가이드를 만들고 있습니다. 이렇게 하면 완전한 체스 게임이 완성됩니다.
zh_cn: 我们正在制作另一份教程，以帮助设计前端。这将使我们的棋局更加完整。

source: After you finish all the four chapters, we can move on to the frontend guide.
es: Una vez que haya terminado los cuatro capítulos, podemos pasar a la guía de interfaz.

source: # 0. Setup
es: # 0. Configuración
ko: # 0. 설정
zh_cn: # 0.设置

source: _Before starting recommend following the [`hello-dojo`](../../cairo/hello-dojo.md) chapter to gain a basic understanding of the Dojo game._
es: _Antes de comenzar, recomendamos seguir el capítulo [`hello-dojo`](../../cairo/hello-dojo.md) para obtener una comprensión básica del juego Dojo._
ko: _시작하기 전에 [`헬로 Dojo`](../../cairo/hello-dojo.md) 챕터에서 Dojo 게임에 대한 기본적인 이해를 돕는 것을 추천합니다_
zh_cn: _在开始之前，建议阅读 [`hello-dojo`](../../cairo/hello-dojo.md)一章，以获得对 Dojo 游戏的基本了解。_

source: ## Initializing the Project
es: ## Inicializando el Proyecto
ko: ## 프로젝트 초기화하기
zh_cn: ## 初始化项目

source: Create a new Dojo project folder. You can name your project what you want.
es: Cree una nueva carpeta de proyecto Dojo. Puedes nombrar tu proyecto como quieras.
ko: 새 Dojo 프로젝트 폴더를 만듭니다. 프로젝트 이름은 원하는 대로 지을 수 있습니다.
zh_cn: 创建一个新的 Dojo 项目文件夹。您可以随心所欲地为项目命名。

source: Open the project folder.
es: Abra la carpeta del proyecto.
ko: 프로젝트 폴더를 엽니다.
zh_cn: 打开项目文件夹。

source: And initialize the project using sozo init.
es: E inicialice el proyecto usando sozo init.
ko: 그리고 sozo init을 사용하여 프로젝트를 초기화합니다.
zh_cn: 然后使用 sozo init 初始化项目。

source: ## Cleaning Up the Boilerplate
es: ## Limpiando lo Repetitivo
ko: ## 기본 템플릿 정리하기
zh_cn: ## 清理模板

source: The project comes with a lot of boilerplate codes. Clear it all. Make sure both `models.cairo` and `systems.cairo` files are empty. In this tutorial, we won't be creating a `systems.cairo` nor the `src/systems` folder, you can delete both (highly optional, folder structure is entirely up to you). instead, we'll be creating a file named `actions_contract.cairo`, this is where our game logic/contract will reside.
es: El proyecto viene con muchos códigos repetitivos. Límpielo todo. Asegúrese de que los archivos `models.cairo` y `systems.cairo` estén vacíos. En este tutorial, no crearemos una carpeta `systems.cairo` ni la carpeta `src/systems`, puedes eliminar ambas (muy opcional, la estructura de la carpeta depende completamente de ti). en su lugar, crearemos un archivo llamado `actions_contract.cairo`, aquí es donde residirá nuestra lógica/contrato de juego.

source: Remodel your`lib.cairo`, to look like this :
es: Remodela tu `lib.cairo`, para que luzca así:

source: Compile your project with:
es: Compila tu proyecto con:
ko: 프로젝트를 컴파일합니다:
zh_cn: 用以下命令编译项目：

source: ## Basic components
es: ## Componentes básicos
ko: ## 기본 컴포넌트(Components)
zh_cn: ## 基本组件

source: While there are many ways to design a chess game using the ECS model, we'll follow this approach:
es: Si bien hay muchas formas de diseñar un juego de ajedrez utilizando el Model ECS, seguiremos este enfoque:
ko: ECS 모델을 사용하여 체스 게임을 디자인하는 방법은 여러 가지가 있지만, 여기서는 이 접근 방식을 따르겠습니다:
zh_cn: 虽然有很多种方法使用 ECS 模型设计象棋游戏，但我们将采用这种方法：

source: > Every square of the chess board (e.g., A1) will be treated as an entity. If a piece exists on a square, the square entity will hold that piece.
es: > Cada casilla del tablero de ajedrez (por ejemplo, A1) será tratada como una entidad. Si existe una pieza en un cuadrado, la entidad cuadrada contendrá esa pieza.
ko: > 체스판의 모든 사각형(예: A1)은 엔티티로 취급됩니다. 사각형에 말이 존재하면 사각형 엔티티가 해당 말을 보유합니다.
zh_cn: > 棋盘上的每个方格（例如 A1）都将被视为一个实体。如果某个方格上有棋子，则该方格实体将包含该棋子。

source: First, add this basic model to `models.cairo` file. If you are not familar with model syntax in Dojo engine, go back to this [chapter](../../cairo/models.md).
es: Primero, agregue este Model básico al archivo `models.cairo`. Si no está familiarizado con la sintaxis del Model en el Dojo engine, vuelva a este [capítulo](../../cairo/models.md).

source: ## Basic systems
es: ## Systems básicos
ko: ## 기본 시스템(systems)
zh_cn: ## 基本系统

source: Starting from the next chapter, you will implement the `actions_contract.cairo` logic.
es: A partir del próximo capítulo, implementará la lógica `actions_contract.cairo`.

source: Create `actions_contract.cairo` inside the src folder. the file should contain a basic contract.
es: Cree `actions_contract.cairo` dentro de la carpeta src. el archivo debe contener un contrato básico.

source: For example, `actions_contract.cairo` should look like this:
es: Por ejemplo, `actions_contract.cairo` debería verse así:

source: It should be noted that systems are cairo contracts, by implication, rather than implementing the game logic in systems, we are implementing it in a contract.
es: Cabe señalar que los Systems son contratos de Cairo, por implicación, en lugar de implementar la lógica del juego en los Systems, la estamos implementando en un contrato.

source: ## Compile your project
es: ## Compila tu proyecto
ko: ## 프로젝트 컴파일하기
zh_cn: ## 编译项目

source: Now try `sozo build` to build. Faced some errors?
es: Ahora prueba con `sozo build` para compilar. ¿Enfrentó algunos errores?
ko: 이제 빌드하려면 `sozo build`를 시도하십시오. 오류가 발생했나요?
zh_cn: 现在尝试 `sozo build` 进行构建。是不是遇到了错误？

source: You would probably faced some trait implementation errors, which you can implement as a derive like:
es: Probablemente haya enfrentado algunos errores de implementación de trait, que puede implementar como una derivación como:
ko: 아마도 몇 가지 특성 구현 오류를 만났을 것입니다. 이는 다음과 같이 derive로 구현할 수 있습니다:
zh_cn: 您可能会遇到一些trait实现上的错误，您可以像这样通过派生来实现：

source: Complied? Great! then let's move on. If not fix other issues as above, so that you can run the `sozo build` command successfully.
es: ¿Cumplido? ¡Excelente! entonces sigamos adelante. De lo contrario, solucione otros problemas como se indicó anteriormente, para que pueda ejecutar el comando `sozo build` con éxito.

source: Before proceeding to the next chapter, remember that `sozo build` and `sozo test` are important steps to ensure your code is correct.
es: Antes de continuar con el siguiente capítulo, recuerde que `sozo build` y `sozo test` son pasos importantes para garantizar que su código sea correcto.
ko: 다음 챕터로 넘어가기 전에 `sozo build`와 `sozo test`는 코드가 올바른지 확인하는 중요한 단계라는 점을 기억하세요.
zh_cn: 在进入下一章之前，请记住`sozo build` 与 `sozo test`是确保代码正确的重要步骤。

source: Run sozo test. Did you face any errors?
es: Ejecute la prueba de sozo. ¿Enfrentó algún error?
ko: sozo test를 실행합니다. 오류가 발생했나요?
zh_cn: 运行 sozo 测试。出现错误了吗？

source: For the no implementation error, implement the PrintTrait to run `sozo test` successfully. For the not dropped error, add the Drop trait. Address other errors by adding derives or implementing them on a case-by-case basis.
es: Para el error de no implementación, implemente PrintTrait para ejecutar la `sozo test`con éxito. Para el error no eliminado, agregue el Drop trait. Solucione otros errores agregando derivaciones o implementándolas caso por caso.

source: ## Add more models
es: ## Agregar más Models

source: Before you move on, add more models so we can use them in the next chapter when creating the action contract.
es: Antes de continuar, agregue más Models para que podamos usarlos en el próximo capítulo al crear el contrato de acción.

source: ### Requirements
es: ### Requisitos
ko: ## 요구 사항
zh_cn: ### 要求

source: - `Color` enum with values White,Black & None
es: - Enumeración `Color` con valores Blanco, Negro y Ninguno

source: - `Game` model:
es: - Model `Game`:

source: - `GameTurn` model:
es: - Model `GameTurn`:

source: - Run `sozo build` to see if your code compiles, we'll handle `test` implementiation in the subsequent chapters.
es: - Ejecute `sozo build` para ver si su código se compila; nos encargaremos de la implementación de `test` en los capítulos siguientes.

source: This tutorial is extracted from [here](https://github.com/Akinbola247/chess-dojo/tree/tutorialv3)
es: Este tutorial está extraído de [aquí](https://github.com/Akinbola247/chess-dojo/tree/tutorialv3)

source: <details> <summary>Click to see full `models.cairo` code</summary>
es: <detalles> <summary>Haga clic para ver el código `models.cairo` completo</summary>

source: Congratulations! You've completed the basic setup for building an on-chain chess game 🎉
es: ¡Felicidades! Has completado la configuración básica para crear un juego de ajedrez on-chain 🎉
ko: 축하합니다! 온체인 체스 게임을 구축하기 위한 기본 설정을 완료하셨습니다 🎉
zh_cn: 恭喜您！您已经完成了构建链上国际象棋游戏的基本设置 🎉

source: This chapter will address implementing `action_contract.cairo`, which spawns the game & squares containing pieces and also allow players to move pieces.
es: Este capítulo abordará la implementación de `action_contract.cairo`, que genera el juego y los cuadrados que contienen piezas y también permite a los jugadores mover piezas.

source: ## What is `action_contract`?
es: ## ¿Qué es `action_contract`?

source: To play chess, you need, to start game, spawn the pieces, and move around the board. the `action_contract` has two dominant functions `spawn_game` function which spawns the game entity and places each piece in its proper position on the board and the `move` funtion which allows pieces to be moved around the board.
es: Para jugar al ajedrez, necesitas comenzar el juego, generar las piezas y moverte por el tablero. El `action_contract` tiene dos funciones dominantes: la función `spawn_game` que genera la entidad del juego y coloca cada pieza en su posición adecuada en el tablero y la función `move` que permite mover las piezas por el tablero.

source: ## Requirements
es: ## Requisitos
ko: ## 요구 사항
zh_cn: ## 需求

source: _Copy the unit tests below and paste them at the bottom of your `action_contract.cairo` file._
es: _Copie las pruebas unitarias a continuación y péguelas en la parte inferior de su archivo `action_contract.cairo`._

source: 1. Write an interface for the `initiate_system` contract and define your functions. In this case, `move` and `spawn_game`
es: 1. Escriba una interfaz para el contrato `initiate_system` y defina sus funciones. En este caso, `move` y `spawn_game`

source: 2. Bring in required imports into the contract and initialize storage with the `world_dispatcher` in it like this :
es: 2. Incorpore las importaciones requeridas al contrato e inicialice el almacenamiento con `world_dispatcher` de esta manera:

source: should be noted that `actions` is the contract name.
es: Cabe señalar que `actions` es el nombre del contrato.

source: 3. Write a `spawn_game` function that accepts the `white address`, and `black address` as input and set necessary states using `set!(...)`.Implement the game entity, comprised of the `Game` model and `GameTurn` model we created in the `models.cairo` and Implement the square entities from a1 to h8 containing the correct `PieceType` in the `spawn_game` fn.
es: 3. Escriba una función `spawn_game` que acepte la `white address` y `black address` como entrada y establezca los estados necesarios usando `set!(...)`. Implemente la entity del juego, compuesta por el model `Game` y el model `GameTurn` que creamos en `models.cairo` e implementamos las entities cuadradas de a1 a h8 que contienen el `PiezaType` correcto en `spawn_game` fn.

source: 4. Write a `move` function that accepts the `current position`, `next position`, `caller address`, and `game id`. The `move` function should look like this:
es: 4. Escriba una función`move` que acepte la `current position`, `next position`, `caller address`, y `game id`. La función `move` debería verse así:

source: 7. Run `sozo test` and pass all the tests.
es: 7. Ejecute `sozo test` y pase todas las pruebas.

source: - Spawn the test world (`spawn_test_world`) that imports the models in testing. - deploy actions contract - interact with `spawn_game` function in the `actions` contract by providing white and black player's wallet addresses as inputs. - Retrieve the game entity and piece entity created in `actions` contract. - Ensure the game has been correctly created. - Verify that each `Piece` is located in the correct `Square`.
es: - Generar el mundo de prueba (`spawn_test_world`) que importa los model en prueba. - Implementar contrato de acciones - Interactuar con la función `spawn_game` en el contrato de `actions` proporcionando las direcciones de billetera de los jugadores blancos y negros como entradas. - Recuperar la entidad de juego y la entidad de pieza creadas en el contrato de `actions`. - Asegúrate de que el juego se haya creado correctamente. - Verificar que cada `Piece` esté ubicada en el `Square` correcto.

source: ## Unit Tests
es: ## Tests unitarios
ko: ### 유닛 테스트 작성하기
zh_cn: ## 单元测试

source: ## Need help?
es: ## ¿Necesitas ayuda?
ko: ## 도움이 필요하세요?
zh_cn: ## 需要帮助？

source: If you're stuck, don't hesitate to ask questions at the [Dojo community](https://discord.gg/akd2yfuRS3)!
es: Si estás atascado, ¡no dudes en hacer preguntas en la [comunidad Dojo](https://discord.gg/akd2yfuRS3)!
ko: 막히는 부분이 있으면 [Dojo 커뮤니티](https://discord.gg/akd2yfuRS3)에서 주저하지 말고 질문하세요!
zh_cn: 如果您遇到困难，请随时到 [Dojo 社区](https://discord.gg/akd2yfuRS3) 提问！

source: You can find the [answer](https://github.com/rkdud007/chess-dojo/blob/tutorialv3/src/actions_contract.cairo) for chapter 1 here.
es: Puede encontrar la [respuesta](https://github.com/rkdud007/chess-dojo/blob/tutorialv3/src/actions_contract.cairo) para el capítulo 1 aquí.

source: # 2. Check Legal Move
es: # 2. Verificar Movimiento Legal

source: In this chapter, we'll make functions to check:
es: En este capítulo, crearemos funciones para verificar:
ko: 이 장에서는 확인할 함수를 만들어 보겠습니다:
zh_cn: 在本章中，我们将编写用于检查的函数：

source: - If the next move goes outside the board. - If there's a piece that can be captured. - If the next move is allowed for the type of piece. - If the user can allow to make a action (based on the piece's color). - ... You can also add other custom check functions.
es: - Si el siguiente movimiento sale fuera del tablero. - Si hay alguna pieza que se pueda capturar. - Si el siguiente movimiento está permitido por el tipo de pieza. - Si el usuario puede permitir realizar una acción (según el color de la pieza). -... También puede agregar otras funciones de verificación personalizadas.
ko: - 다음 수가 보드 밖으로 나가는 경우. - 점령할 수 있는 말이 있는 경우. - 다음 수이 해당 색깔에 허용되는 경우. - 사용자가 (말의 색깔에 따라) 행동을 허용할 수 있는 경우. - ... 다른 사용자 지정 확인 기능을 추가할 수도 있습니다.
zh_cn: - 如果下一步在棋盘之外 - 是否有棋子可以被吃掉。 - 棋子类型是否允许下一步棋。 - 用户是否允许进行操作（基于棋子的颜色）。 - ...您还可以添加其他自定义校验功能。

source: ## Make Check Functions
es: ## Realizar Funciones de Verificación
ko: ## 체크 함수 만들기
zh_cn: ## 编写校验函数

source: We need to add some check functions in `actions` contract. These will help make sure the next move is allowed.
es: Necesitamos agregar algunas funciones de verificación en el contrato de `actions`. Esto ayudará a garantizar que se permita el siguiente movimiento.

source: 1. See if player is moving the right piece
es: 1. Ver si el jugador está moviendo la pieza correcta

source: 2. See if the next spot is still on the board.
es: 2. Vea si el siguiente lugar todavía está en el tablero.
ko: 2. 다음 위치가 보드위에 있는지 확인합니다.
zh_cn: 2. 看看下一个位置是否还在棋盘上。

source: 3. See if the person trying the move is doing it at the right time and with their piece color.
es: 3. Observa si la persona que intenta el movimiento lo hace en el momento adecuado y con el color de su pieza.
ko: 3. 수를 시도하는 사람이 적절한 타이밍에 적절한 색상으로 움직이고 있는지 확인합니다.
zh_cn: 3. 看看尝试这个动作的人是否在正确的时间且以正确的阵营移动棋子。

source: 4. see if it's the right move
es: 4. Ver si es el movimiento correcto

source: 5. You can also add other check functions to be extra sure the move is allowed.
es: 5. También puede agregar otras funciones de verificación para asegurarse de que el movimiento esté permitido.

source: Once you've made these check functions, you can use them in the `move` function in the contract as illustrated in the previous chapter [here](1-action.md). You can decide how to set them up and which ones to use. We'll give an example to help:
es: Una vez que haya realizado estas funciones de verificación, puede usarlas en la función `move` del contrato como se ilustra en el capítulo anterior [aquí](1-action.md). Puedes decidir cómo configurarlos y cuáles usar. Daremos un ejemplo para ayudar:

source: ## Testing Each Function
es: ## Testing de Cada Función
ko: ## 각 함수 테스트하기
zh_cn: ## 测试每个函数

source: Since we have different check functions, we need to test each one. To make this easier, let's use parts that are the same for many tests.
es: Como tenemos diferentes funciones de verificación, debemos probar cada una. Para hacerlo más fácil, usemos piezas que sean iguales para muchas pruebas.
ko: 체크 함수들이 서로 다르기 때문에 각각을 테스트해야 합니다. 이 작업을 더 쉽게 하기 위해 여러 테스트에 공통 함수를 만들어 사용하겠습니다.
zh_cn: 由于我们有不同的校验函数，因此需要对每个函数进行测试。为了方便起见，我们可以在许多测试中使用相同的部分。

source: First, make a helper function called `setup_world`. This will give back an `IWorldDispatcher` and `IActionsDispatcher` that we can use many times in the tests.
es: Primero, cree una función auxiliar llamada `setup_world`. Esto nos devolverá un `IWorldDispatcher` y un `IActionsDispatcher` que podremos usar muchas veces en las pruebas.

source: Then, our main `test_move` function will be simpler.
es: Entonces, nuestra función principal `test_move` será más simple.
ko: 그러면 기본 `test_move` 함수가 더 간단해집니다.
zh_cn: 这样，我们的主 `test_move` 函数就会变得更简单。

source: Now we can make tests that show errors if we try moves that aren't allowed. Let's make a `test_piecetype_illegal` function. This will check if the `is_right_piece_move` function, that you implemented in the move system, works right.
es: Ahora podemos hacer pruebas que muestren errores si intentamos movimientos que no están permitidos. Hagamos una función `test_piecetype_illegal`. Esto verificará si la función `is_right_piece_move`, que implementó en el sistema de movimiento, funciona correctamente.
ko: 이제 허용되지 않는 수를 시도하면 오류가 나도록 테스트를 만들 수 있습니다. `test_piecetype_illegal` 함수를 만들어 봅시다. 이 함수는 이동 시스템에서 구현한 `is_right_piece_move` 함수가 제대로 작동하는 지 확인합니다.
zh_cn: 现在我们可以进行测试，如果尝试不允许的动作，测试就会显示错误。让我们创建一个 `test_piecetype_illegal` 函数。这将检查你在移动系统中实现的 `is_right_piece_move` 函数是否正常工作。

source: Finish by making your tests. These should find wrong moves and give back errors.
es: Termina haciendo tus tests. Estos deberían encontrar movimientos incorrectos y devolver errores.
ko: 잘못된 기물 움직임을 찾아내고 오류를 반환하는 테스트를 작성하면서 마무리 해봅시다.
zh_cn: 最后进行测试。这些测试应能发现错误动作并反馈错误信息。

source: # 3 Test Contract
es: # 3 Contrato de Test

source: In this chapter, we'll use everything we've learned to run a full chess game scenario.
es: En este capítulo, usaremos todo lo que hemos aprendido para ejecutar un escenario de juego de ajedrez completo.
ko: 이 장에서는 지금까지 배운 모든 것을 사용하여 전체 체스 게임 시나리오를 실행해 보겠습니다.
zh_cn: 在本章中，我们将利用所学知识运行一个完整的国际象棋游戏场景。

source: Here's what we'll do in our test:
es: Esto es lo que haremos en nuestro test:
ko: 테스트에서 수행할 작업은 다음과 같습니다:
zh_cn: 下面是我们要做的测试：

source: 1. Spawn `white_pawn_1` to (0,1) 2. Move `white_pawn_1` to (0,3) 3. Move `black_pawn_2` to (1,6) 4. Move `white_pawn_1` to (0,4) 5. Move `black_pawn_2` to (1,4) 6. Move `white_pawn_1` to (1,4) 7. Capture `black_pawn_2`
es: 1. Spawn `white_pawn_1` en (0,1) 2. Move `white_pawn_1` a (0,3) 3. Move `black_pawn_2` a (1,6) 4. Move `white_pawn_1` a (0,4) 5. Move `black_pawn_2` a (1,4) 6. Move `white_pawn_1` a (1,4) 7. Capture `black_pawn_2`

source: To place the pieces, use our `spawn_game` function in our `actions` contract. For moving them, use the `move_system` contract. Remember to check if a piece can be captured when using `move_system`.
es: Para colocar las piezas, use nuestra función `spawn_game` en nuestro contrato de `actions`. Para moverlos, utilice el contrato `move_system`. Recuerde verificar si se puede capturar una pieza al usar `move_system`.

source: Before we get to the code, set up your integration test like this:
es: Antes de llegar al código, configure su test de integración de esta manera:
ko: 코드를 시작하기 전에 다음과 같이 통합 테스트를 설정합니다:
zh_cn: 在我们开始编写代码之前，请这样设置集成测试：

source: - Copy the test below and add it to your `src/tests.cairo` file. - Make a `test.cairo` in your src and update `lib.cairo` by adding the `mod tests;` line.
es: - Copie la prueba a continuación y agréguela a su archivo `src/tests.cairo`. - Crea un `test.cairo` en tu src y actualiza `lib.cairo` agregando la línea `mod tests;`.
ko: - 아래 테스트를 복사하여 `src/tests.cairo` 파일에 추가합니다. - src에 `test.cairo`를 생성하고 `mod tests;` 줄을 추가하여 `lib.cairo`를 업데이트합니다.
zh_cn: - 复制下面的测试并将其添加到你的 `src/tests.cairo` 文件中。 - 在你的 src 中创建一个 `test.cairo` ，更新 `lib.cairo` 添加 `mod tests;` 。

source: ## Diving into the Code
es: ## Profundizando en el Código
ko: ## 코드 살펴보기
zh_cn: ## 深入代码

source: First, we'll set up the players and their colors.
es: Primero, configuraremos los jugadores y sus colores.
ko: 먼저 플레이어와 플레이어의 색상을 설정합니다.
zh_cn: 首先，我们将设置球员及其阵营。

source: We should list both models with each having CLASS_HASH as elements and then we deploy world to models with `spawn_test_world`
es: Deberíamos enumerar ambos models, cada uno con CLASS_HASH como elementos y luego implementar el mundo en los modelos con `spawn_test_world`.

source: We then deploy our system contracts in our helper function in `action_contract` file. we only imported it in our test file.
es: Luego implementamos nuestros contratos del sistema en nuestra función auxiliar en el archivo `action_contract`. solo lo importamos en nuestro archivo de test.

source: We use `spawn_game` function in `actions_contract.cairo` to put our Square pieces on the board. Each Square holds a piece. The system's `spawn_game` function needs some input i.e the addresses of the players.
es: Usamos la función `spawn_game` en `actions_contract.cairo` para colocar nuestras piezas cuadradas en el tablero. Cada cuadrado contiene una pieza. La función `spawn_game` del sistema necesita alguna entrada, es decir, las direcciones de los jugadores.

source: Let's check if a White pawn is at (0,1). Remember, to get a piece that exists on the square, you need to use the keys of the `Square` model, which are `game_id`, `x`, and `y`. Do the same check for the Black Pawn.
es: Comprobemos si hay un peón blanco en (0,1). Recuerde, para obtener una pieza que existe en el cuadrado, debe usar las claves del model `Square`, que son `game_id`,`x`, e `y`. Haz la misma prueba con el peón negro.

source: After setting up the board, use `move` function in the contract to make moves. Provide the current position, the next position, the player's address, and the game id.
es: Después de configurar el tablero, use la función `move` en el contrato para realizar movimientos. Proporcione la posición actual, la siguiente posición, la dirección del jugador y la identificación del juego.

source: Keep moving pieces and checking if they're in the right places.
es: Sigue moviendo piezas y comprobando si están en los lugares correctos.
ko: 말을 계속 움직이고 올바른 위치에 있는지 확인하세요.
zh_cn: 不断移动棋子，检查它们的位置是否正确。

source: ## Congratulations!
es: ## ¡Felicidades!
ko: ## 축하합니다!
zh_cn: ## 恭喜！
