Repository: dojoengine/book
Catalog: po/*.po
Languages: es, ko, zh_cn

source: We're firm believers in the potential for Autonomous Worlds to catalyze the exploration of novel forms in the medium provided by zk proofs and blockchain technology. This is not only about games, but also about new forms of artwork, coordination, fun, emerging from tinkering and radical innovation, eventually questioning the very notion of "play" in this brave new decentralized and trustless world.
es: Creemos firmemente en el potencial de los Autonomous Worlds para catalizar la exploración de formas novedosas en el medio proporcionado por las pruebas zk y la tecnología blockchain. No se trata sólo de juegos, sino también de nuevas formas de arte, coordinación y diversión que surgen de la innovación radical y los retoques, y que eventualmente cuestionan la noción misma de "jugar" en este nuevo y valiente World descentralizado y sin confianza.

source: ### Homework
es: ### Tarea
ko: ### 읽어보기
zh_cn: ### 阅读作业

source: # Provable games
es: # Juegos probables
ko: # 증명 가능한 게임
zh_cn: # 可证明的游戏

source: Provable games demand [zero-knowledge](https://ethereum.org/en/zero-knowledge-proofs/) properties for efficient scaling and verification of computations. [Cairo](https://book.starknet.io/chapter_1/what_is_cairo.html) addresses this need by providing a generalized language, eliminating the complexity of creating circuits to incorporate [SNARKs](https://consensys.net/blog/developers/introduction-to-zk-snarks/).
es: Los Provable games requieren propiedades de [zero-knowledge](https://ethereum.org/en/zero-knowledge-proofs/)(ZK) para una escalabilidad eficiente y verificación de cálculos. [Cairo](https://book.starknet.io/chapter_1/what_is_cairo.html) aborda esta necesidad proporcionando un lenguaje generalizado, eliminando la complejidad de crear circuitos para incorporar [SNARKs](https://consensys.net/blog/developers/introduction-to-zk-snarks/).
ko: 증명 가능한 게임은 계산의 효율적인 확장 및 검증을 위해 [영지식 증명](https://ethereum.org/en/zero-knowledge-proofs/) 특성을 필요로 합니다. [Cairo](https://book.starknet.io/chapter_1/what_is_cairo.html)는 이를 위한 일반화된 언어를 제공하며, [SNARK](https://consensys.net/blog/developers/introduction-to-zk-snarks/)를 통합하기 위한 회로(circuits)의 복잡성을 해소합니다.
zh_cn: 可证明博弈需要[零知识](https://ethereum.org/en/zero-knowledge-proofs/)特性，以便高效地扩展和验证计算。[Cairo](https://book.starknet.io/chapter_1/what_is_cairo.html)通过提供一种通用语言来满足这一需求，消除了需要创建电路以纳入[SNARKs](https://consensys.net/blog/developers/introduction-to-zk-snarks/)的复杂性。

source: **You can simply program in Cairo and your applications become automatically provable**.
es: **Puedes simplemente programar en Cairo y tus aplicaciones se vuelven automáticamente demostrables**.
ko: **Cairo를 활용하면 자동으로 애플리케이션을 증명할 수 있습니다.**.
zh_cn: **您只需用Cairo语言编程，您的应用程序就自动成为可证明的**。

source: Moreover, you can deploy your programs on the [Cairo Virtual Machine](https://medium.com/starkware/cairo-welcome-on-board-1cf3487554f) (CVM), which is compatible with Starknet's Layer 2, Starknet appchains, and even in-browser through WebAssembly (WASM)! Dojo aims to supply straightforward ZK primitives to fuel your game development.
es: Además, puede implementar sus programas en la [Máquina Virtual de Cairo](https://medium.com/starkware/cairo-welcome-on-board-1cf3487554f) (CVM), que es compatible con la Capa 2 de Starknet, las cadenas de aplicaciones de Starknet, ¡E incluso en el navegador a través de WebAssembly (WASM)! Dojo tiene como objetivo proporcionar primitivas ZK sencillas para impulsar el desarrollo de su juego.
ko: 또한, 스타크넷의 레이어 2와 스타크넷 앱체인에 호환되는 [Cairo 가상 머신](https://medium.com/starkware/cairo-welcome-on-board-1cf3487554f)(CVM)에서 프로그램 배포가 가능하며, 웹어셈블리(WASM)를 통해서도 브라우저 내에서 배포가 가능합니다. Dojo는 게임 개발을 지원하기 위해 직관적인 ZK 도구를 제공하는 것을 목표로 합니다.
zh_cn: 此外，您还可以在[Cairo虚拟机](https://medium.com/starkware/cairo-welcome-on-board-1cf3487554f) (CVM)上部署您的程序，该虚拟机与Starknet Layer2、Starknet应用链兼容，甚至可以通过 WebAssembly (WASM) 在浏览器中部署！Dojo 的目标是为您的游戏开发提供直接的 ZK 基元。

source: For more information about Starknet, Cairo and its tech stack, check out the [Starknet & Cairo book](https://book.starknet.io/).
es: Para obtener más información sobre Starknet, Cairo y su stack tecnológico, visita el [libro de Starknet y Cairo](https://book.starknet.io/).
ko: 스타크넷, 카이로 및 기술 스택에 대한 자세한 내용은 [Starknet & Cairo book](https://book.starknet.io/)에서 확인하실 수 있습니다.
zh_cn: 有关Starknet、Cairo及其技术栈的更多信息，请查阅 [Starknet & Cairo book](https://book.starknet.io/)。

source: Cairo is an open-source, Turing-complete smart contract language developed by Starkware, designed to power the Validity Rollup Starknet. The language enables highly expressive and verifiable computation, making it well-suited for building scalable and secure applications, including decentralized finance (DeFi) projects.
es: Cairo es un lenguaje de smart contract de código abierto y Turing completo, desarrollado por Starkware, diseñado para impulsar el Validity Rollup Starknet. El lenguaje permite una computación altamente expresiva y verificable, lo que lo hace adecuado para construir aplicaciones escalables y seguras, incluidos proyectos de finanzas descentralizadas (DeFi)
ko: Cairo는 Starkware에서 개발한 튜링 완전(turing-complete)한 오픈소스 스마트 컨트랙트 언어로서, 밸리디티 롤업 Starknet의 구동을 위해 설계되었습니다. 이 언어는 높은 표현력과 검증 가능한 계산 능력으로 탈중앙 금융(DeFi) 프로젝트를 비롯하여 확장 가능하며 안전한 애플리케이션 개발에 적합합니다.
zh_cn: Cairo 是由 Starkware 开发的一种开源、图灵完备的智能合约语言，旨在为有效性卷积 Starknet提供支持。该语言可实现高表达性和可验证的计算，非常适合构建可扩展的安全应用，包括去中心化金融（DeFi）项目。

source: Dojo builds on Cairo to create a robust framework for developing Autonomous Worlds (AWs). By leveraging the capabilities of Cairo, Dojo aims to streamline the development process, improve maintainability, and enhance the performance of AWs.
es: Dojo se basa en Cairo al crear un framework para desarrollar Autonomous Worlds (AWs). Al aprovechar las capacidades de Cairo, Dojo tiene como objetivo agilizar el proceso de desarrollo, mejorar la mantenibilidad y mejorar el rendimiento de AWs.
ko: Dojo는 Cairo를 토대로 자율 월드(AW) 개발을 위한 강력한 프레임워크를 제공합니다. Cairo의 기능을 최대화하여 개발 과정을 단순화하고, 유지보수성 및 AW의 성능 향상을 추구합니다.
zh_cn: Dojo 以 Cairo 为基础，为开发自主世界（AW）创建了一个强大的框架。通过利用 Cairo 的功能，Dojo 旨在简化开发流程，提高可维护性，并增强自主世界的性能。

source: A key feature of the Dojo framework is its use of [commands](../cairo/commands.md). Commands are a design pattern that helps to reduce boilerplate code, resulting in cleaner and more maintainable applications. They achieve this by encapsulating specific actions or operations within self-contained, reusable units.
es: Una característica clave del framework Dojo es el uso de [comandos](../cairo/commands.md). Los comandos son un patrón de diseño que ayuda a reducir el código repetitivo, dando lugar a aplicaciones más limpias y fáciles de mantener. Esto se consigue encapsulando acciones u operaciones específicas en unidades autocontenidas y reutilizables.
ko: Dojo 프레임워크의 주요 특징은 [명령어](../cairo/commands.md)를 활용한다는 것입니다. 이 명령어(Command) 디자인 패턴은 불필요한 코드를 줄이고 보다 깔끔하며 유지 관리하기 쉬운 애플리케이션 개발을 도와줍니다.
zh_cn: Dojo 框架的一个主要特点是使用 [命令](../cairo/commands.md)。命令是一种设计模式，有助于减少模板代码，使应用程序更简洁、更易维护。它们通过将特定的操作或运行封装在自足的、可重用的单元中来实现这一目标。

source: Developers can write commands freely within Systems, and the Cairo compiler takes care of inlining the appropriate functions.
es: Los desarrolladores pueden escribir comandos libremente dentro de los Systems, y el compilador de Cairo se encarga de enlazar las funciones apropiadas.
ko: 개발자는 시스템 내에서 명령어를 자유롭게 작성할 수 있고, Cairo 컴파일러는 이를 적절하게 인라인 처리합니다.
zh_cn: 开发人员可以在系统中自由编写命令，而 Cairo 编译器则负责内嵌相应的函数。

source: #### Essential Reading
es: #### Lectura Esencial
ko: #### 읽어보기
zh_cn: #### 必读

source: ### Starknet as an L2
es: ### Starknet como una L2
ko: ### L2 스타크넷
zh_cn: ### 作为 L2的Starknet

source: Starknet is a Validity Rollup Layer 2 (L2) solution designed to scale Ethereum. It operates by offering high transaction throughput and low gas costs while maintaining the same level of security as Ethereum Layer 1 (L1). The strategy it uses is akin to solving a sudoku puzzle: verifying a solution is easier than finding the solution from scratch. Similarly, Starknet replaces heavy and costly L1 computation with cheaper L1 verification through the use of STARK proofs computed off-chain.
es: Starknet es una solución de Capa 2 (L2) de Validity Rollup diseñada para escalar Ethereum. Opera ofreciendo una alta capacidad de transacciones y bajos costos de gas, manteniendo el mismo nivel de seguridad que Ethereum Capa 1 (L1). La estrategia que utiliza es similar a resolver un rompecabezas Sudoku: verificar una solución es más fácil que encontrar la solución desde cero. De manera similar, Starknet reemplaza la computación pesada y costosa en L1 con una verificación más económica en L1 mediante el uso de pruebas STARK calculadas fuera de la cadena.
ko: Starknet은 이더리움의 확장을 위한 유효성 롤업(Validity Rollup) L2 솔루션으로 설계되었습니다. 이더리움 L1의 보안 수준을 유지하며 높은 트랜잭션 처리 능력과 저렴한 가스 비용을 제공합니다. 스타크넷은 오프체인에서의 STARK 증명을 활용하여 L1의 비용이 많이 드는 계산을 저렴한 L1 검증으로 대체합니다.
zh_cn: Starknet 是一个有效性卷积第二层（L2）解决方案，旨在扩展以太坊。它的运行方式是提供高交易吞吐量和低气体成本，同时保持与以太坊第一层（L1）相同的安全级别。它采用的策略类似于解决数独难题：验证一个解决方案比从头开始寻找解决方案更容易。同样，Starknet 通过使用链外计算的 STARK 证明，以更便宜的 L1 验证取代了繁重而昂贵的 L1 计算。

source: In more technical terms, Starknet is a permissionless Validity-Rollup (also known as a "ZK-Rollup") that supports general computation and currently runs as an L2 network over Ethereum. The network's L1 security is guaranteed by its utilization of the STARK cryptographic proof system, which is considered one of the safest and most scalable.
es: En términos más técnicos, Starknet es un Validity Rollup sin permisos (también conocido como "ZK-Rollup") que admite computación general y actualmente funciona como una red L2 sobre Ethereum. La seguridad de la red L1 está garantizada por su utilización del sistema de prueba criptográfica STARK, que se considera uno de los más seguros y escalables.
ko: 기술적으로 보면, 스타크넷은 일반 연산을 지원하는 비허가형 유효성 롤업(ZK 롤업)으로서, 현재 이더리움 상의 L2 네트워크로 운영되고 있습니다. 이 네트워크의 L1 보안은 STARK 암호화 증명 시스템을 통해 확보됩니다.
zh_cn: 用更专业的术语来说，Starknet 是一种无权限的 Validity-Rollup（也称为 "ZK-Rollup"），支持一般计算，目前作为以太坊上的二级网络运行。该网络的一级安全性由其使用的 STARK 加密证明系统提供保障，该系统被认为是最安全、最可扩展的系统之一。

source: ### Starknet as an Appchain
es: ### Starknet como una Appchain
ko: ### 앱체인 스타크넷
zh_cn: ### 作为应用链的Starknet

source: Cairo is an isomorphic, general-purpose language, optimized for Zero-Knowledge (ZK) proofs. It's the driving force behind Starknet, Starkex, and appchains. Remarkably, you can also run it in WebAssembly (WASM) to generate proofs on the client-side! The Dojo team is working closely with the [Madara](https://github.com/keep-starknet-strange/madara) team to enable Starknet appchains to seamlessly run Dojo worlds.
es: Cairo es un lenguaje isomórfico de propósito general, optimizado para pruebas de conocimiento cero (ZK). Es la fuerza impulsora detrás de Starknet, Starkex y las appchains. Sorprendentemente, también se puede ejecutar en WebAssembly (WASM) para generar pruebas en el lado del cliente! El equipo de Dojo está trabajando en estrecha colaboración con el equipo de [Madara](https://github.com/keep-starknet-strange/madara) para permitir que las appchains de Starknet ejecuten sin problemas los Worlds de Dojo.
ko: Cairo는 스타크넷, 스타크엑스, 앱체인의 기반이 되는 범용 언어로서 영지식(ZK) 증명에 최적화되어 있습니다. 놀랍게도 웹어셈블리(WASM)에서도 실행이 가능하여, 클라이언트 측에서 증명을 생성할 수 있습니다. Dojo 팀은 [Madara](https://github.com/keep-starknet-strange/madara)팀과 협력하여 스타크넷 앱체인이 Dojo 월드에서 원활하게 동작하도록 지원하고 있습니다.
zh_cn: Cairo语言是一种同构的通用语言，针对零知识（ZK）证明进行了优化。它是 Starknet、Starkex 和 应用链 背后的驱动力。值得注意的是，你还可以在 WebAssembly (WASM) 中运行它，在客户端生成证明！Dojo 团队正在与 [Madara](https://github.com/keep-starknet-strange/madara) 团队紧密合作，使 Starknet 应用链能够无缝运行 Dojo 世界。

source: # FAQs
es: # Preguntas Frecuentes
zh_cn: # 常见问题

source: #### Who owns Dojo?
es: #### ¿Quién es el propietario de Dojo?
ko: #### Dojo의 소유자는 누구인가요?
zh_cn: #### 谁拥有Dojo？

source: Dojo is strictly open-source and uses the Apache 2.0 license. Anyone can use Dojo for free, and anyone can contribute to the project.
es: Dojo es estrictamente open-source y utiliza la licencia Apache 2.0. Cualquiera puede utilizar Dojo de forma gratuita, y cualquiera puede contribuir al proyecto.
ko: Dojo는 엄격한 오픈소스 정책을 따르며 Apache 2.0 라이선스로 제공됩니다. 따라서 누구나 Dojo를 비용 없이 사용하거나 프로젝트에 기여할 수 있습니다.
zh_cn: Dojo 严格遵循 Apache 2.0 许可协议，是开源软件。任何人都可以免费使用 Dojo，任何人都可以为项目做出贡献。

source: #### Why Dojo?
es: ### ¿Por qué Dojo?
ko: #### 왜 Dojo를 선택해야 하나요?
zh_cn: #### 为何选择Dojo？

source: Dojo was created to solve problems the founders faced when building onchain games. It standardizes the process of building such games and provides a suite of tools to make it easier.
es: Dojo se creó para resolver los problemas a los que se enfrentaban sus fundadores a la hora de crear juegos on-chain. Estandariza el proceso de creación de este tipo de juegos y ofrece un conjunto de herramientas para facilitarlo.
ko: Dojo는 창업자들이 온체인 게임 개발에 직면하는 문제점을 해결하기 위해 설계되었습니다. 이를 위해 게임 제작 과정을 표준화하는 동시에 이 과정을 간소화하는 도구를 제공합니다.
zh_cn: Dojo 的创建旨在解决创始人在构建链上游戏时遇到的问题。它规范了构建此类游戏的流程，并提供了一整套工具，使其变得更加容易。

source: #### What is the Dojo roadmap?
es: #### ¿Cuál es el roadmap de Dojo?
ko: #### Dojo의 로드맵은 어떻게 되나요?
zh_cn: #### Dojo 路线图是怎样的？

source: Dojo is rapidly evolving. You can find open issues on the [Dojo Github](https://github.com/dojoengine/dojo/issues) and join the [Discord](https://discord.gg/vUN4Xq9Qv6) to get involved. If you have ideas for the project, please open an issue.
es: Dojo evoluciona rápidamente. Puedes encontrar temas abiertos en [Dojo Github](https://github.com/dojoengine/dojo/issues) y unirte a [Discord](https://discord.gg/vUN4Xq9Qv6) para participar. Si tienes ideas para el proyecto, abre una incidencia.
ko: Dojo는 지속적으로 발전하고 있습니다.[Dojo 깃허브](https://github.com/dojoengine/dojo/issues)에서 현재 진행 중인 이슈를 확인하고 [디스코드](https://discord.gg/vUN4Xq9Qv6)를 통해 커뮤니티에 참여할 수 있습니다. 만약 프로젝트에 대한 새로운 아이디어가 있다면 이슈를 제출해 주십시오.
zh_cn: Dojo 正在快速发展。您可以在 [Dojo Github](https://github.com/dojoengine/dojo/issues) 上找到open状态的issue，也可以加入 [Discord](https://discord.gg/vUN4Xq9Qv6) 参与其中。如果您对项目有想法，请打开一个issue。

source: #### What is an onchain game?
es: #### ¿Qué es un juego onchain?
ko: #### 온체인 게임이란 무엇인가요?
zh_cn: #### 什么是链上游戏？

source: Onchain games are games that exist entirely on a public blockchain network; all states and logic are onchain. Clients (like web browsers) do not exist on the chain but exist purely to interact with and interpret the onchain state.
es: Los juegos onchain son juegos que existen enteramente en una red pública blockchain; todos los estados y la lógica son onchain. Los clientes (como los navegadores web) no existen on-chain, sino únicamente para interactuar con el estado onchain e interpretarlo.
ko: 온체인 게임은 게임의 모든 상태와 로직이 퍼블릭 블록체인 네트워크상에 저장되는 게임을 의미합니다. 이때, 클라이언트(예: 웹 브라우저)는 블록체인에 저장된 정보와 상호작용하는 역할을 합니다.
zh_cn: 链上游戏是完全存在于公共区块链网络上的游戏；所有状态和逻辑都在链上。客户端（如网络浏览器）并不存在于链上，而是纯粹为了与链上状态进行交互和解释而存在。

source: #### What is an autonomous world?
es: #### ¿Qué es un Autonomous Worlds?
ko: #### 자율 세계(autonomous world)란 무엇인가요?
zh_cn: #### 什么是自主世界？

source: An autonomous world is one that exists entirely onchain. It's not controlled by any single entity but is instead governed by the rules set within that world. Dive deeper into the topic here: [Autonomous Worlds](../theory/autonomous-worlds.md).
es: Un Autonomous Worlds es aquel que existe completamente on chain. No está controlado por ninguna entidad única, sino que se rige por las reglas establecidas dentro de ese World. Profundice en el tema aquí: [Autonomous Worlds](../theory/autonomous-worlds.md).
ko: 자율 세계는 블록체인 상에 완전하게 존재하는 가상 세계를 의미합니다. 이 세계는 특정 개인 또는 조직에 의해 제어되지 않고, 세계 내에 정의된 규칙에 따라 운영됩니다. 자세한 정보는[Autonomous Worlds](../theory/autonomous-worlds.md)를 참조하세요.
zh_cn: 自主世界是一个完全在链上存在的世界。它不受任何单一实体的控制，而是由该世界中设定的规则所支配。这篇文章深入探讨了这一主题：[Autonomous Worlds](../theory/autonomous-worlds.md)。

source: #### What is Cairo?
es: #### ¿Qué es Cairo?
ko: #### Cairo는 무엇인가요?
zh_cn: #### Cairo是什么？

source: Cairo is an opensource programming language invented by Starkware. It's a Turing-complete language meant for general-purpose computation. It's a low-level language designed to compile to the Cairo Virtual Machine. Learn more about it here: [Cairo](../theory/cairo.md).
es: Cairo es un lenguaje de programación de código abierto inventado por Starkware. Es un lenguaje Turing-completo pensado para computación de propósito general. Es un lenguaje de bajo nivel diseñado para compilar en la máquina virtual Cairo. Más información aquí: [Cairo](../theory/cairo.md).
ko: Cairo는 Starkware에서 개발한 오픈소스 프로그래밍 언어입니다. 범용적인 계산을 위한 튜링 완전 언어로, Cairo 가상 머신(CVM)을 위해 설계된 저수준 언어입니다. 더 자세한 정보는 [Cairo](../theory/cairo.md)에서 확인할 수 있습니다.
zh_cn: Cairo 是由 Starkware 发明的一种开源编程语言。它是一种图灵完备的语言，用于通用计算。它是一种低级语言，旨在编译到Cairo虚拟机。点击此处了解更多信息：[Cairo](.../theory/cairo.md)。

source: #### What is a provable game?
es: #### ¿Qué es un provable game?
ko: #### 증명 가능한 게임이란 무엇인가요?
zh_cn: #### 什么是可证明的游戏？

source: Thanks to the magic of zero-knowledge proofs, we can ensure a game is fair by verifying a zk proof created off-chain. But what does that entail? Consider a game of chess. We aim for an experience where players trust each other's moves. In a straightforward approach — and given the simple rules of chess — if this were in a blockchain environment, every move would be a transaction on the blockchain. This is costly. We just want to know the winner, not every move.
es: Gracias a la magia de las zero-knowledge proofs, podemos asegurarnos de que un juego es justo verificando una prueba zk creada fuera de la cadena. Pero, ¿qué implica eso? Pensemos en una partida de ajedrez. Nuestro objetivo es que los jugadores confíen en las jugadas de los demás. En un enfoque directo — y dadas las sencillas reglas del ajedrez — si esto fuera en un entorno de cadena de bloques, cada jugada sería una transacción bloques on-chain. Esto es costoso. Sólo queremos saber quién es el ganador, no cada jugada.
ko: 영지식 증명 기술을 이용하여, 오프체인에서 생성된 zk 증명의 검증을 통해 게임의 공정성을 보장합니다. 체스 게임을 예로 들면, 모든 움직임이 블록체인에 기록되면 큰 비용이 발생합니다. 우리는 게임의 승자만 알고자 하는데, 모든 수를 기록할 필요는 없습니다.
zh_cn: 由于零知识证明的神奇作用，我们可以通过验证链外创建的 zk 证明来确保游戏的公平性。但这意味着什么呢？请看一盘国际象棋。我们的目标是让棋手们彼此信任对方的棋步。如果是在区块链环境中，考虑到国际象棋的简单规则，用一种直接的方法，每一步棋都是在区块链上进行的交易。这样做成本很高。我们只想知道胜负，而不是每一步棋。

source: With zk proofs and client communications, players can establish a state channel, sharing moves off-chain and ensuring their validity. At the end, a zk proof can be submitted to the blockchain to confirm the game's fairness. This constitutes a provable game.
es: Con las pruebas zk y las comunicaciones cliente, los jugadores pueden establecer un canal de estado, compartiendo movimientos fuera de la cadena y garantizando su validez. Al final, se puede enviar una prueba zk a la cadena de bloques para confirmar la equidad del juego. Esto constituye un provable game.
ko: 플레이어는 zk 증명과 클라이언트 간 통신을 활용해 상태 채널을 설정하고 오프체인에서 움직임을 공유하며 그 유효성을 보장합니다. 게임이 끝나면 공정성을 확인하기 위해 블록체인에 zk 증명을 제출합니다. 이런 방식으로 게임이 진행되는 것을 증명 가능한 게임이라고 합니다.
zh_cn: 通过 zk 证明和客户端通信，玩家可以建立状态通道，在链外共享移动并确保其有效性。最后，可以向区块链提交 zk 证明，以确认游戏的公平性。这就构成了一个可证明的游戏。

source: ## Quick Start
es: ## Inicio Rápido
ko: ## 빠른 시작
zh_cn: ## 快速启动

source: > It is worth reading [theory](../theory/autonomous-worlds.md) to familiarize yourself with the concept of Autonomous Worlds (AWs) and the [Cairo ecosystem](../theory/cairo.md) before diving into the code.
es: > Merece la pena leer [teoría](../theory/autonomous-worlds.md) para familiarizarse con el concepto de Autonomous Worlds (AWs) y el [ecosistema de Cairo](../theory/cairo.md) antes de sumergirse en el código.
ko: > 개발에 들어가기 전에, [자율 세계(AW)](../theory/autonomous-worlds.md)와 [Cairo ecosystem](../theory/cairo.md)에 대한 기본 이론을 숙지하는 것이 권장됩니다.
zh_cn: > 在深入研究代码之前，这里有值得你阅读一下的 [理论](../theory/autonomous-worlds.md) 用以来熟悉自主世界（AW）的概念，以及[Cairo生态系统](../theory/cairo.md) 。

source: ### Install Dojoup
es: ### Instalando Dojoup
ko: ### Dojoup 설치
zh_cn: ### 安装 Dojoup

source: Dojo is built around a set of development tools - Katana, Torii and Sozo. Install them all easily with Dojoup. You can find detailed information about Dojoup [here](https://github.com/dojoengine/dojo/blob/master/dojoup/README.md).
es: Dojo está construido alrededor de un conjunto de herramientas de desarrollo - Katana, Torii y Sozo. Instálalas todas fácilmente con Dojoup. Puedes encontrar información detallada sobre Dojoup [aquí](https://github.com/dojoengine/dojo/blob/master/dojoup/README.md).
ko: Dojo는 Katana, Torii, Sozo 등의 개발 도구 세트를 제공합니다. 이러한 도구들을 Dojo를 통해 손쉽게 설치할 수 있습니다. Dojo에 관한 더 깊은 내용은 [여기](https://github.com/dojoengine/dojo/blob/master/dojoup/README.md)에서 확인할 수 있습니다.
zh_cn: Dojo 由 Katana、Torii 和 Sozo 三种开发工具组成。使用 Dojoup 可以轻松安装它们。有关 Dojoup 的详细信息，请点击 [此处](https://github.com/dojoengine/dojo/blob/master/dojoup/README.md)。

source: This will install Dojoup, then simply follow the instructions on-screen, which will make the `dojoup` command available in your CLI.
es: Esto instalará Dojoup, luego simplemente sigue las instrucciones que aparecen en pantalla, lo que hará que el comando `dojoup` esté disponible en tu línea de comandos (CLI).
ko: Dojoup을 설치한 후, 화면에 나타나는 지시사항을 따라주세요. 설치가 완료되면 CLI에서 dojoup 명령어를 사용할 수 있게 됩니다.
zh_cn: 这将安装 Dojoup，然后只需按照屏幕上的说明操作、 即可在 CLI 中使用 `dojoup` 命令。

source: For full `dojoup` reference and debugging see [Dojoup](../toolchain/dojoup.md).
es: Para una referencia completa y depuración de `dojoup` ver [Dojoup](../toolchain/dojoup.md).
ko: dojoup에 대한 자세한 명령어와 디버깅 방법은 [Dojoup](../toolchain/dojoup.md)를 참조하세요.
zh_cn: 有关 `dojoup` 的完整参考和调试，请参阅 [Dojoup](../toolchain/dojoup.md)。

source: ### Next steps
es: ### Próximos Pasos
ko: ### 다음 단계
zh_cn: ### 下一步

source: > Head to [Hello Dojo](../cairo/hello-dojo.md) to get create your first Dojo world.
es: > Dirígete a [Hello Dojo](../cairo/hello-dojo.md) para crear tu primer World Dojo.
ko: > [헬로 Dojo](../cairo/hello-dojo.md)으로 이동하여 첫 번째 Dojo 월드를 만드세요.
zh_cn: > 前往 [Hello Dojo](../cairo/hello-dojo.md) ，创建你的第一个 Dojo 世界。

source: ## Building from source
es: ## Construyendo desde el origen
ko: ## 소스에서 빌드
zh_cn: ## 从源码构建

source: > If you are just wanting to play with the toolchain, we strongly suggest following the [Quick Start](./quick-start.md) guide.
es: > Si sólo quieres jugar con la cadena de herramientas, te recomendamos encarecidamente que sigas la guía [Quick Start](./quick-start.md).
ko: > 툴체인만 사용해보고 싶다면 [빠른 시작](./quick-start.md) 가이드를 따르는 것이 좋습니다.
zh_cn: > 如果您只是想试试工具链，我们强烈建议您参考 [快速入门](./quick-start.md) 指南。

source: #### Prerequisites
es: #### Requisitos Previos
ko: #### 전제 조건
zh_cn: #### 先决条件

source: You will need the [Rust](https://rust-lang.org) compiler and Cargo, the Rust package manager. The easiest way to install both is with [`rustup.rs`](https://rustup.rs/).
es: Necesitarás el compilador de [Rust](https://rust-lang.org) y Cargo, el gestor de paquetes de Rust. La forma más sencilla de instalar ambos es utilizando [`rustup.rs`](https://rustup.rs/).
ko: [Rust](https://rust-lang.org) 컴파일러와 Rust 패키지 매니저인 Cargo가 필요합니다. 두 가지를 모두 설치하는 가장 쉬운 방법은 [`rustup.rs`](https://rustup.rs/)를 사용하는 것입니다.
zh_cn: 您需要 [Rust](https://rust-lang.org) 编译器和 Rust 软件包管理器 Cargo。 安装这两种工具的最简单方法是使用 [`rustup.rs`](https://rustup.rs/)。

source: On Windows, you will also need a recent version of [Visual Studio](https://visualstudio.microsoft.com/downloads/), installed with the "Desktop Development With C++" Workloads option.
es: En Windows, también necesitarás una versión reciente de [Visual Studio](https://visualstudio.microsoft.com/downloads/), instalada con la opción "Desarrollo de escritorio con C++" en las cargas de trabajo.
ko: Windows의 경우 최신 버전의 [Visual Studio](https://visualstudio.microsoft.com/downloads/)도 필요합니다, "C++를 사용한 데스크톱 개발" 워크로드 옵션으로 설치합니다.
zh_cn: 在 Windows 系统中，您还需要已经安装了 "使用 C++ 进行桌面开发 "工作负载选项的、 最新版本的 [Visual Studio](https://visualstudio.microsoft.com/downloads/)

source: #### Building
es: #### Construyendo
ko: #### 빌드
zh_cn: #### 构建

source: You can either use the different [Dojoup](#using-dojoup) flags:
es: Puedes utilizar las diferentes opciones de [Dojoup](#using-dojoup):
ko: 다른 [Dojoup](#using-dojoup) 플래그를 사용할 수 있습니다:
zh_cn: 您可以使用不同的 [Dojoup]（#using-dojoup）标记：
