Repository: dojoengine/book
Catalog: po/*.po
Languages: es, ko, zh_cn

source: Torii is an automatic indexer for dojo worlds. Built in rust to be blazingly fast and exceptionally scalable.
es: Torii es un indexador automático para Worlds dojo. Construido en rust para ser increíblemente rápido y excepcionalmente escalable.
ko: Torii는 dojo 월드를 위한 자동 인덱서입니다. Rust로 제작되어 매우 빠르고 확장성이 뛰어납니다.
zh_cn: Torii（译者注：torii是日文“鳥居”的罗马字） 是 dojo 世界的自动索引器。采用 rust 构建，速度极快，可扩展性极强。

source: ### Dojo indexer
es: ### Indexador de Dojo
ko: ### Dojo 인덱서
zh_cn: ### Dojo 索引器

source: Torii indexes your dojo worlds and exposes a GraphQL API to query them. Simply run:
es: Torii indexa los Worlds de tu dojo y expone una API GraphQL para consultarlos. Simplemente ejecuta:
ko: Torii는 Dojo 월드를 인덱싱하고 이를 쿼리할 수 있는 GraphQL API를 노출합니다. 다음과 같이 실행할 수 있습니다:
zh_cn: Torii 可为你的 dojo 世界建立索引，并提供 GraphQL API 以进行查询。只需运行：

source: and you'll have a GraphQL API running on `http://localhost:8080`!
es: ¡Y tendrás una API GraphQL ejecutándose en `http://localhost:8080`!
ko: 그러면 `http://localhost:8080`에서 GraphQL API가 실행됩니다!
zh_cn: 就可以在 `http://localhost:8080` 上运行 GraphQL API 了！

source: The `torii` binary can be installed via [`dojoup`](../../getting-started/quick-start.md), our dedicated installation package manager.
es: El binario `torii` se puede instalar a través de [`dojoup`](../../getting-started/quick-start.md), nuestro administrador de paquetes de instalación dedicado.
ko: `torii` 바이너리는 전용 설치 패키지 관리자인 [`dojoup`](../../getting-started/quick-start.md) 통해 설치할 수 있습니다.
zh_cn: 你可以通过我们专用的安装包管理器 [`dojoup`](../../getting-started/quick-start.md)安装 `torii` 二进制文件。

source: This will install Torii and the required dependencies on your local system.
es: Esto instalará Torii y las dependencias requeridas en su sistema local.
ko: 이렇게 하면 로컬 시스템에 Torii 및 필수 종속성들이 설치됩니다.
zh_cn: 这将在本地系统中安装 Torii 和所需的依赖项。

source: > 📚 **Reference** > > See the [`torii` Reference](./reference.md) for a complete reference.
es: > 📚 **Referencia** > > Consulte la [`torii` Reference](./reference.md) para obtener una referencia completa.
ko: > 📚 **참조** > > 전체 참조 내용은 [`torii` Reference](./reference.md)를 참조하세요.
zh_cn: > 📚 **参考资料** > > 请参阅 [`torii`参考](./reference.md) 获取完整参考。

source: ## torii reference
es: ## Referencia torii
ko: ## torii 참조
zh_cn: ## torii 参考资料

source: torii - An automatic indexer and networking layer for a world contract.
es: torii: - Un indexador automático y una capa de red para un contrato de World.
ko: torii - 월드 컨트랙트를 위한 자동 인덱서 및 네트워킹 레이어입니다.
zh_cn: torii - 世界合约的自动索引器和网络层。

source: `torii` starts the indexer and exposes GraphQL/gRPC API endpoints. The indexer queries the specified Starknet RPC endpoint for transaction blocks and listens for transactions related to the world contract. These transactions can include component/system registrations, entity state updates, system calls, and events. The parsed data is then stored in a local SQLite database.
es: `torii` inicia el indexador y expone los puntos finales de la API GraphQL/gRPC. El indexador consulta el punto final Starknet RPC especificado en busca de bloques de transacciones y escucha las transacciones relacionadas con el contrato de World. Estas transacciones pueden incluir registros de componentes/Systems, actualizaciones del estado de la entidad, llamadas al sistema y eventos. Luego, los datos analizados se almacenan en una base de datos SQLite local.
ko: `torii` 는 인덱서를 시작하고 GraphQL/gRPC API 엔드포인트를 노출합니다. 인덱서는 지정된 스타크넷 RPC 엔드포인트에서 트랜잭션 블록을 쿼리하고 월드 컨트랙트와 관련된 트랜잭션을 수신 대기합니다. 이러한 트랜잭션에는 컴포넌트/시스템 등록, 엔티티 상태 업데이트, 시스템 호출 및 이벤트가 포함될 수 있습니다. 파된 데이터는 로컬 SQLite 데이터베이스에 저장됩니다.
zh_cn: `torii`会启动索引器，并公开 GraphQL/gRPC API 端点。索引器会向指定的 Starknet RPC 端点查询事务块，并监听与世界契约相关的事务。这些事务包括组件/系统注册、实体状态更新、系统调用和事件。解析后的数据将存储在本地 SQLite 数据库中。

source: The GraphQL and gRPC API endpoints run in tandem with the indexer, providing custom queries specific to the world contract for client applications.
es: Los puntos finales de las API GraphQL y gRPC se ejecutan en conjunto con el indexador, proporcionando consultas personalizadas específicas del contrato mundial para aplicaciones cliente.
ko: GraphQL 및 gRPC API 엔드포인트는 인덱서와 함께 실행되어 클라이언트 애플리케이션을 위한 월드 컨트랙트에 특정한 사용자 지정 쿼리를 제공합니다.
zh_cn: GraphQL 和 gRPC API 端点与索引器同步运行，为客户端应用程序提供特定于世界契约的自定义查询。

source: `torii` uses a sqlite database to store indexed data. The database can be stored either in-memory or persistently on the filesystem.
es: `torii` usa una base de datos sqlite para almacenar datos indexados. La base de datos se puede almacenar en memoria o de forma persistente en el sistema de archivos.
ko: `torii`는 색인된 데이터를 저장하기 위해 sqlite 데이터베이스를 사용합니다. 데이터베이스는 인메모리에 저장하거나 파일 시스템에 영구적으로 저장할 수 있습니다.
zh_cn: `torii` 使用sqlite数据库存储索引数据。数据库既可以存储在内存中，也可以持久地存储在文件系统中。

source: - The in-memory database is ephemeral and only lasts as long as the indexer is running. This is a fast and simple option to start the indexer for development/testing. - Persistent storage should be used in production. It relies on the local filesystem for storage.
es: - La base de datos en memoria es efímera y solo dura mientras se ejecuta el indexador. Esta es una opción rápida y sencilla para iniciar el indexador para desarrollo/prueba. - En producción se debe utilizar almacenamiento persistente. Depende del sistema de archivos local para el almacenamiento.

source: Note: If using in-memory db, the memory will be garbage collected after a period of inactivity, causing queries to result in errors. A workaround is to start `katana` with the `--block-time` option or use a persistent database.
es: Nota: Si utiliza una db en memoria, la memoria se recolectará como basura después de un período de inactividad, lo que provocará que las consultas generen errores. Una solución alternativa es iniciar `katana` con la opción `--block-time` o usar una base de datos persistente.
ko: 참고: 인메모리 데이터베이스를 사용하는 경우, 일정 시간 동안 사용하지 않으면 메모리가 수집되어(Garbage Collect) 쿼리에서 오류가 발생할 수 있습니다. 해결 방법은 `--block-time` 옵션으로 `katana`를 시작하거나 영구 데이터베이스를 사용하는 것입니다.
zh_cn: 注意：如果使用内存数据库，在一段时间不活动后内存将被垃圾回收，导致查询出错。解决方法是使用 `--block-time` 选项启动 `katana` 或使用持久数据库。

source: `-w, --world` &nbsp;&nbsp;&nbsp;&nbsp; Address of the world contract to index
es: `-w, --world` &nbsp;&nbsp;&nbsp;&nbsp; Dirección del contrato world a indexar
ko: `-w, —world` &nbsp;&nbsp;&nbsp;&nbsp; 인덱싱할 월드 컨트랙트의 주소
zh_cn: `-w, --world` &nbsp;&nbsp;&nbsp;&nbsp; 要索引的世界合同的地址

source: `--rpc` &nbsp;&nbsp;&nbsp;&nbsp; Starknet RPC endpoint to use [default: http//localhost:5050]
es: `--rpc` &nbsp;&nbsp;&nbsp;&nbsp; Punto final Starknet RPC a utilizar [predeterminado: http//localhost:5050]

source: `-m, --manifest <MANIFEST>` &nbsp;&nbsp;&nbsp;&nbsp; Specify a local manifest to initialize from
es: `-m, --manifest <MANIFEST>` &nbsp;&nbsp;&nbsp;&nbsp; Especifique un manifiesto local desde el que inicializar
ko: `-m, —manifest <MANIFEST>` &nbsp;&nbsp;&nbsp;&nbsp; 초기화할 로컬 매니페스트를 지정합니다
zh_cn: `-m, --manifest <MANIFEST>` &nbsp;&nbsp;&nbsp;&nbsp; 指定要初始化的本地清单

source: `-d, --database-url <DATABASE_URL>` &nbsp;&nbsp;&nbsp;&nbsp; Database URL (read more above) [default: sqlite::memory:]
es: `-d, --database-url <DATABASE_URL>` &nbsp;&nbsp;&nbsp;&nbsp; URL de la base de datos (leer más arriba)[predeterminado: sqlite::memory:]
ko: `-d, --database-url <DATABASE_URL>` &nbsp;&nbsp;&nbsp;&nbsp; 데이터베이스 URL(위 내용 참조) [기본값: sqlite::memory:]
zh_cn: `-d, --database-url <DATABASE_URL>` &nbsp;&nbsp;&nbsp;&nbsp; 数据库 URL（更多信息请阅读上文） [默认：sqlite::memory:]

source: `-s, --start-block <START_BLOCK>` &nbsp;&nbsp;&nbsp;&nbsp; Specify a block to start indexing from, ignored if stored head exists [default: 0]
es: `-s, --start-block <START_BLOCK>` &nbsp;&nbsp;&nbsp;&nbsp; Especifique un bloque desde el que comenzar a indexar, ignorado si existe un encabezado almacenado [predeterminado: 0]
ko: `-s, --start-block <START_BLOCK>` &nbsp;&nbsp;&nbsp;&nbsp; 인덱싱을 시작할 블록 지정, 저장된 시작 지점이 있는 경우 무시됨 [기본값: 0]
zh_cn: `-s, --start-block <START_BLOCK>` &nbsp;&nbsp;&nbsp;&nbsp; 指定要从哪个块开始建立索引，如果存在存储头，则忽略 [默认：0]

source: `-h, --help` &nbsp;&nbsp;&nbsp;&nbsp; Print help
es: `-h, --help` &nbsp;&nbsp;&nbsp;&nbsp; Imprimir ayuda
ko: `h, --help` &nbsp;&nbsp;&nbsp;&nbsp; 도움말 출력
zh_cn: `-h, --help` &nbsp;&nbsp;&nbsp;&nbsp; 打印帮助

source: `-V, --version` &nbsp;&nbsp;&nbsp;&nbsp; Print version
es: `-V, --version` &nbsp;&nbsp;&nbsp;&nbsp; Versión impresa
ko: `-V, --version` &nbsp;&nbsp;&nbsp;&nbsp; 버전 정보 출 력
zh_cn: `-V, --version` &nbsp;&nbsp;&nbsp;&nbsp; 打印版本信息

source: In Dojo, you have access to custom queries and subscriptions that are specifically designed to work with the `caller` for client applications. GraphQL is the technology that makes this possible.
es: En Dojo, tiene acceso a consultas y suscripciones personalizadas diseñadas específicamente para funcionar con el `caller` para aplicaciones cliente. GraphQL es la tecnología que hace esto posible.

source: GraphQL is the rising star of backend technologies. It replaces REST as an API design paradigm and is becoming the new standard for exposing the data and functionality of a web server. It allows you to specify exactly what data you want to retrieve, and it delivers that data in a structured JSON format. This flexibility in data retrieval ensures that you get the information you need efficiently and in a format that's easy to work with.
es: GraphQL es la estrella en ascenso de las tecnologías backend. Reemplaza a REST como paradigma de diseño de API y se está convirtiendo en el nuevo estándar para exponer los datos y la funcionalidad de un servidor web. Le permite especificar exactamente qué datos desea recuperar y los entrega en un formato JSON estructurado. Esta flexibilidad en la recuperación de datos garantiza que obtenga la información que necesita de manera eficiente y en un formato con el que sea fácil trabajar.

source: GraphQL Playground is a `GraphQL IDE`` that allows you to interactively explore the functionality of a GraphQL API by sending queries and mutations to it. It’s somewhat similar to Postman which offers comparable functionality for REST APIs.
es: GraphQL Playground es un `GraphQL IDE` que le permite explorar interactivamente la funcionalidad de una API GraphQL enviándole consultas y mutaciones. Es algo similar a Postman, que ofrece una funcionalidad comparable para las API REST.

source: #### Pre-requisites
es: #### Requisitos previos

source: Make sure torii is running in your local terminal.
es: Asegúrese de que torii se esté ejecutando en su terminal local.

source: It starts GraphQL server at `http://0.0.0.0:8080/graphql`
es: Inicia el servidor GraphQL en `http://0.0.0.0:8080/graphql`

source: After the torii server starts on your local machine, you're ready to make query and subscription operations.
es: Una vez que el servidor torii se inicie en su máquina local, estará listo para realizar operaciones de consulta y suscripción.

source: ### Query operation
es: ### Operación de consulta

source: In [`hello-dojo`](../../cairo/hello-dojo.md#next-steps) we fetched some data from the `Moves` model. This time let's fetch only `id`, `name`, `class_hash` fields from `Position` model .
es: En [`hello-dojo`](../../cairo/hello-dojo.md#next-steps) obtuvimos algunos datos del Model `Moves`. Esta vez recuperaremos solo los campos `id`, `name`, `class_hash` del Model `Position`.

source: Great! If you're wondering about the number of fields a `Model` has or the details of a `Entities`, you can find all the information about the schema definition in the `Documentation Explorer` section of the GraphQL IDE. It's your go-to place for exploring the rest of the documentation.
es: ¡Excelente! Si se pregunta sobre la cantidad de campos que tiene un `Model` o los detalles de una `Entities`, puede encontrar toda la información sobre la definición del esquema en la sección `Documentation Explorer` del IDE GraphQL. Es su lugar de referencia para explorar el resto de la documentación.

source: Now lets retrieve more data from `Moves` model.
es: Ahora recuperemos más datos del Model `Moves`.

source: Feel free to play around with the query by removing any fields from the selection set and observe the responses sent by the server. It is your turn to create any kind of query for entities and models!
es: Siéntase libre de jugar con la consulta eliminando cualquier campo del conjunto de selección y observe las respuestas enviadas por el servidor. ¡Es tu turno de crear cualquier tipo de consulta para entidades y Models!

source: Subscriptions are a GraphQL feature that allows a server to send data to its clients when a specific event happens. Subscriptions are usually implemented with WebSockets. In that setup, the server maintains a steady connection to its subscribed client. This also breaks the “Request-Response-Cycle” that is used for with REST APIs.
es: Las suscripciones son una característica de GraphQL que permite a un servidor enviar datos a sus clientes cuando ocurre un evento específico. Las suscripciones suelen implementarse con WebSockets. En esa configuración, el servidor mantiene una conexión estable con su cliente suscrito. Esto también rompe el "Request-Response-Cycle” que se utiliza con las API REST.

source: Instead, the client initially opens up a long-lived connection to the server by sending a subscription query that specifies which event it is interested in. Every time this particular event happens, the server uses the connection to push the event data to the subscribed client(s).
es: En cambio, el cliente inicialmente abre una conexión de larga duración con el servidor enviando una consulta de suscripción que especifica qué evento le interesa. Cada vez que ocurre este evento en particular, el servidor usa la conexión para enviar los datos del evento al cliente/s suscrito.

source: In this example, you can listen when an `Model` is registered by executing this subscription
es: En este ejemplo, puede escuchar cuando se registra un `Model` ejecutando esta suscripción

source: Graphql also supports subscription to a targeted entity or model, for this we have to pass its id as an argument
es: Graphql también admite la suscripción a una entidad o Model de destino, para ello tenemos que pasar su identificación como argumento

source: In this example, our server provides a `entityUpdated` subscription, which should notify clients whenever an entity with id `0x28cd7ee02d7f6ec9810e75b930e8e607793b302445abbdee0ac88143f18da20` is updated. On the same subscription we can get the model(components) values of the updated entity . A client can execute a subscription that looks like this:
es: En este ejemplo, nuestro servidor proporciona una suscripción `entityUpdated`, que debe notificar a los clientes cada vez que se actualiza una entidad con ID `0x28cd7ee02d7f6ec9810e75b930e8e607793b302445abbdee0ac88143f18da20`. En la misma suscripción podemos obtener los valores del Model (componentes) de la entidad actualizada. Un cliente puede ejecutar una suscripción similar a esta:

source: According to your input, you will receive an output like this:
es: Según su entrada, recibirá un resultado como este:

source: ## Deploying Locally
es: ## Implementación Local
ko: ## 로컬 배포하기
zh_cn: ## 本地部署

source: Dojo is engineered for rapid development, boasting a lightning-fast local development environment named [Katana](./toolchain/katana/overview.md). Katana serves as an on-device Starknet blockchain, allowing you to rigorously test your smart contracts before transitioning them to the remote testnet.
es: Dojo está diseñado para un desarrollo rápido y cuenta con un entorno de desarrollo local ultrarrápido llamado [Katana](./toolchain/katana/overview.md). Katana sirve como una cadena de bloques Starknet en el dispositivo, lo que le permite probar rigurosamente sus smart contract antes de realizar la transición a la red de prueba remota.

source: ### Katana Deployments
es: ### Implementaciones de Katana
ko: ### Katana 배포하기
zh_cn: #### Katana 部署

source: Deploying to Katana could not be easier.
es: La implementación en Katana no podría ser más sencilla.
ko: Katana에 배포하는 것은 정말 간단합니다.
zh_cn: 部署合约到 Katana 再简单不过了。

source: > This assumes you have followed the [Quick Start](./getting-started/quick-start.md) guide and have a project initialized.
es: > Esto supone que ha seguido la guía [Inicio rápido](./getting-started/quick-start.md) y tiene un proyecto inicializado.
ko: > [빠른 시작](./getting-started/quick-start.md) 가이드를 따랐고 기본 프로젝트가 이미 설정 되어 있다고 가정합니다.
zh_cn: > 这里假设您已按照 [快速入门](./getting-started/quick-start.md) 指南进行了操作，并已初始化了一个项目。

source: From your project directory, run:
es: Desde el directorio de su proyecto, ejecute:
ko: 프로젝트 디렉토리에서 실행합니다:
zh_cn: 在项目目录下运行：

source: This has started a local Katana which you can now deploy on!
es: ¡Esto ha iniciado una Katana local en la que ahora puedes implementar!
ko: 이제 로컬 Katana를 시작하여 배포할 수 있습니다!
zh_cn: 这样就启动了一个本地Katana，您现在可以在上面进行部署！

source: ### Deploying to Katana
es: ### Implementación en Katana
ko: ### Katana에 배포하기
zh_cn: ### 部署到Katana

source: To deploy your project to Katana, run:
es: Para implementar su proyecto en Katana, ejecute:
ko: 프로젝트를 Katana에 배포하려면 실행하세요:
zh_cn: 要将项目部署到 Katana，请运行：

source: Note - this will only work if you have compiled your contracts. If you have not, run:
es: Nota: esto sólo funcionará si ha compilado sus contratos. Si no lo has hecho, ejecuta:
ko: 참고 - 이 방법은 컨트랙트를 이미 컴파일한 경우에만 작동합니다. 컴파일하지 않았다면 다음을 실행하세요:
zh_cn: 注意 - 只有在你的合约已经编译过的情况下才能运行。如果没有，请运行：

source: ## Deployment to Remote Network
es: ## Implementación en Red Remota
ko: ## 원격 네트워크에 배포
zh_cn: ## 部署到远程网络

source: > *IMPORTANT: Dojo is unaudited. Use at your own risk.*
es: > *IMPORTANTE: Dojo no está auditado. Úselo bajo su propio riesgo.*
ko: > *중요: Dojo는 audit을 받지 않았습니다. 본인 책임하에 사용하세요.*
zh_cn: > *重要提示：Dojo 未经审计。使用风险自负。*

source: Dojo makes it easy to deploy to remote networks, you just need to have a valid account and network endpoint.
es: Dojo facilita la implementación en redes remotas; solo necesita tener una cuenta válida y un punto final de red.
ko: 유효한 계정과 네트워크 엔드포인트만 있으면 Dojo를 사용하여 원격 네트워크에 쉽게 배포할 수 있습니다.
zh_cn: Dojo 可让您轻松部署到远程网络，您只需拥有一个有效账户和网络端点。

source: ### Remote Katana
es: ### Katana Remota
ko: ### 원격 Katana
zh_cn: ### 远程 Katana

source: Katanas are able to be hosted and run as remote testnets, however this is not recommended for production use.
es: Las Katanas se pueden alojar y ejecutar como redes de prueba remotas; sin embargo, esto no se recomienda para uso en producción.
ko: Katana는 원격 테스트넷으로 호스팅하고 실행할 수 있지만 프로덕션 사용에는 권장되지 않습니다.
zh_cn: Katanas 可以作为远程测试网托管和运行，但不建议用于生产。

source: __todo__: add instructions for deploying to remote katana
es: __todo__: agregue instrucciones para implementar en katana remota
ko: __todo__: 원격 Katana에 배포하기 위한 가이드 추가
zh_cn: __todo__：添加部署到远程 katana 的说明

source: [Madara](https://github.com/keep-starknet-strange/madara) is a blazingly fast Starknet sequencer. Built on the robust Substrate framework and fast, thanks to Rust 🦀, Madara delivers unmatched performance and scalability to power your Starknet-based Validity Rollup chain.
es: [Madara](https://github.com/keep-starknet-strange/madara) es un secuenciador Starknet increíblemente rápido. Construido sobre el robusto framework de Substrate y rápido, gracias a Rust 🦀, Madara ofrece un rendimiento y una escalabilidad inigualables para impulsar su cadena Validity Rollup basada en Starknet.

source: A public Madara testnet is available for deployment:
es: Hay una red de prueba pública de Madara disponible para su implementación:
ko: 퍼블릭 Madara 테스트넷이 개발용으로 이용가능합니다:
zh_cn: 已有公共的 Madara 测试网可供部署：

source: You can use the following account to deploy:
es: Puede usar la siguiente cuenta para realizar la implementación:
ko: 다음 계정을 사용하여 배포할 수 있습니다:
zh_cn: 您可以使用以下账户进行部署：

source: __todo__: add instructions for deploying to remote Starknet
es: __todo__: agregue instrucciones para implementar en Starknet remoto
ko: __todo__: 원격 스타크넷에 배포하기 위한 가이드 추가
zh_cn: __todo__：添加部署到远程Starknet的说明

source: # Building a Chess Game
es: # Construyendo un Juego de Ajedrez
ko: # 체스 게임 만들기
zh_cn: # 构建国际象棋游戏

source: _"I just finished reading The Dojo Book. What should I do next?"_
es: _"Acabo de terminar de leer El Libro del Dojo. ¿Qué debo hacer a continuación?"_
ko: _”방금 Dojo 책을 다 읽었습니다. 다음에는 무엇을 해야 하나요?"_
zh_cn: _“我刚刚读完Dojo Book。接下来我该做什么？”_

source: The answers to this question are always "Make something!", sometimes followed by a list of cool projects. This is a great answer for some people, but others might be looking for a little more direction.
es: Las respuestas a esta pregunta son siempre "¡Haz algo!", a veces seguidas de una lista de proyectos interesantes. Esta es una gran respuesta para algunas personas, pero otras podrían estar buscando un poco más de dirección.
ko: 이 질문에 대한 답은 항상 "무언가를 만들어보세요!"이며, 때로는 멋진 프로젝트 목록이 뒤따릅니다. 이는 어떤 사람들에게는 훌륭한 대답이지만, 어떤 사람들은 좀 더 구체적인 방향을 제공받길 원합니다.
zh_cn: 对这个问题的回答总是 "做点什么吧！"，有时还会列举一些很酷的项目。这对有些人来说是个不错的答案，但有些人可能需要更多的指导。

source: This guide is intended to fill the gap between heavily directed beginner tutorials and working on your projects. The primary goal here is to get you to write code. The secondary goal is to get you reading documentation.
es: Esta guía está destinada a llenar el vacío entre los tutoriales para principiantes muy dirigidos y el trabajo en sus proyectos. El objetivo principal aquí es conseguir que escribas código. El objetivo secundario es que leas la documentación.
ko: 이 가이드는 초보자 튜토리얼과 실제 프로젝트 사이의 간극을 메우기 위한 것입니다. 이 가이드의 주요 목표는 코드를 작성하도록 돕는 것입니다. 두 번째 목표는 문서를 다시 읽도록 하는 것입니다.
zh_cn: 本指南旨在填补指导性较强的初学者教程与项目工作之间的空白。这里的主要目标是让你编写代码。次要目标是让你阅读文档。

source: If you haven't read the Dojo Book yet, it is highly encouraged for you to do so before starting this project.
es: Si aún no ha leído el Libro Dojo, le recomendamos encarecidamente que lo haga antes de comenzar este proyecto.
ko: 아직 Dojo 문서를 읽지 않으셨다면 이 프로젝트를 시작하기 전에 읽어보시기를 적극 권장합니다.
zh_cn: 如果您还没有阅读过Dojo Book，强烈建议您在开始此项目之前先阅读一下。

source: ## What are we building?
es: ## ¿Qué estamos construyendo?
ko: ## 무엇을 만들게 되나요?
zh_cn: ## 我们在创造什么？

source: We're building an on-chain chess game contract that lets you start a new game and play chess. This guide does not cover every rules of the chess game. You will build step by step as follows:
es: Estamos creando un contrato de juego de ajedrez on-chain que le permite comenzar un nuevo juego y jugar ajedrez. Esta guía no cubre todas las reglas del juego de ajedrez. Construirás paso a paso de la siguiente manera:
ko: 저희는 새로운 게임을 시작하고 체스를 플레이할 수 있는 온체인 체스 게임 컨트랙트를 만들어 보려 합니다. 이 가이드는 체스 게임의 모든 규칙을 다루지는 않습니다. 다음과 같이 단계별로 구축할 것입니다:
zh_cn: 我们正在构建一个链上国际象棋游戏合约，让您可以开始新游戏并下棋。本指南并不涵盖国际象棋游戏的所有规则。您将按照以下步骤逐步构建：

source: 1. A system contract to spawn all the chess pieces 2. A system contract to make pieces move 3. Add some functions to check a legal move 4. Play chess ♟♙ - integration test!
es: 1. Un contrato de sistema para generar todas las piezas de ajedrez. 2. Un contrato sistema para hacer que las piezas se muevan 3. Agregue algunas funciones para verificar un movimiento legal. 4. Juega al ajedrez ♟♙ - ¡prueba de integración!

source: The full code of tutorial is based on [this repo](https://github.com/rkdud007/chess-dojo/tree/tutorialv3).
es: El código completo del tutorial se basa en [este repositorio](https://github.com/rkdud007/chess-dojo/tree/tutorialv3).

source: If this seems too hard, don't worry! This guide is for beginners. If you know some basics about Cairo and Dojo, you're good. We won't make a full chess game with all the rules. We're keeping it simple.
es: Si esto parece demasiado difícil, ¡no te preocupes! Esta guía es para principiantes. Si conoces algunos conceptos básicos sobre Cairo y Dojo, estás bien. No haremos una partida de ajedrez completa con todas las reglas. Lo mantendremos simple.
ko: 너무 어렵게 느껴지더라도 걱정하지 마세요! 이 가이드는 초보자를 위한 가이드입니다. Cairo와 Dojo에 대한 기본 지식만 알고 있다면 괜찮습니다. 모든 규칙이 포함된 완전한 체스 게임이 아니라 간단한 설명을 바탕으로 간단하게 완성하는 프로젝트 입니다.
zh_cn: 如果这看起来太难，不用担心！本指南适合初学者。如果你了解Cairo和Dojo的一些基本知识，那就没问题了。我们不会制作包含所有规则的完整游戏。我们将保持简单。
