Repository: dojoengine/book
Catalog: po/*.po
Languages: es, ko, zh_cn

source: Foreword
es: Introducción
ko: 서문
zh_cn: 前言

source: What is Dojo?
es: ¿Qué es Dojo?
ko: Dojo란 무엇인가요?
zh_cn: Dojo 是什么？

source: AW Theory
es: Teoría AW
ko: AW 이론
zh_cn: AW 理论

source: Cairo Ecosystem
es: Ecosistema de Cairo
ko: 카이로(Cairo) 생태계
zh_cn: Cairo生态系统

source: FAQs
es: Preguntas Frecuentes
zh_cn: 常见问题

source: Getting Started
es: Primeros Pasos
ko: 시작하기
zh_cn: 入门

source: Quick Start
es: Inicio Rápido
ko: 빠른 시작
zh_cn: 快速入门

source: Manual Install
es: Manual de Instalación
ko: 수동 설치
zh_cn: 手动安装

source: Development Setup
es: Configuración de Desarrollo
ko: 개발환경 설정
zh_cn: 开发设置

source: Contributing
es: Colaboradores
ko: 기여하기
zh_cn: 贡献

source: Community
es: Comunidad
ko: 커뮤니티
zh_cn: 社区

source: Get Started
es: Primeros Pasos
ko: 시작하기
zh_cn: 开始加入社区

source: Architecture
es: Arquitectura
ko: 아키텍처
zh_cn: 结构

source: Overview
es: Descripción General
ko: 개요
zh_cn: 概述

source: Commands
es: Comandos
ko: 명령어
zh_cn: 命令

source: Config
es: Configuración
ko: 기본 설정
zh_cn: 配置

source: Events
es: Eventos
ko: 이벤트(Events)
zh_cn: 活动

source: Authorization
es: Autorización
ko: 권한
zh_cn: 授权

source: Migration
es: Migración

source: ECS in 15 minutes
es: ECS en 15 minutos

source: Testing
es: Pruebas
ko: 테스트
zh_cn: 测试

source: Modules
es: Módulos

source: Toolchain
es: Herramientas
ko: 툴체인
zh_cn: 工具链

source: Reference
es: Referencias
ko: 참고
zh_cn: 参考资料

source: Deploying
es: Desplegando
ko: 배포
zh_cn: 部署

source: Locally
es: Localmente
ko: 로컬 환경
zh_cn: 本地

source: Remote
es: Remoto
ko: 원격 환경
zh_cn: 远程

source: 0. Setup
es: 0. Configuración
ko: 0. 설정
zh_cn: 0. 设置

source: 1. Initiate
es: 1. Iniciar
ko: 1. 시작
zh_cn: 1. 初始化

source: 2. Move
es: 2. Mover
ko: 2. 이동
zh_cn: 2. 移动

source: 3. Check Legal Move
es: 3. Comprobar Movimiento Legal
ko: 3. 가능 여부 확인
zh_cn: 3. 检查合法移动

source: Contributors
es: Colaboradores
ko: 기여자(Contributors)
zh_cn: 贡献者

source: > Dojo is an open-source project, currently in its early development phase, and warmly welcomes contributors. For additional resources, join the community on [Discord](https://discord.gg/vUN4Xq9Qv6) and check out the [contribution guide](./misc/contributors.md).
es: > Dojo es un proyecto de código abierto, actualmente en su fase inicial de desarrollo, y da una calurosa bienvenida a los contribuyentes. Para obtener recursos adicionales, únase a la comunidad en [Discord](https://discord.gg/vUN4Xq9Qv6) y consulte la [guía de contribución](./misc/contributors.md).
ko: > Dojo는 현재 초기 개발 단계에 있는 오픈소스 프로젝트로, 기여를 적극 환영합니다. 추가 자료가 필요하면 [Discord](https://discord.gg/vUN4Xq9Qv6)의 커뮤니티에 가입하고 [컨트리뷰션 가이드](./misc/contributors.md)를 참조하세요.
zh_cn: > Dojo 是一个开源项目，目前处于早期开发阶段，并热忱的欢迎贡献者们。更多相关资源，请在 [Discord](https://discord.gg/vUN4Xq9Qv6)上加入我们的社区，并查看我们的[Github](https://github.com/dojoengine/book) 。

source: ## Dojo: The Provable Game Engine
es: ## Dojo: El Provable Game Engine
ko: ## Dojo: 증명 가능한 게임 엔진
zh_cn: ## Dojo：可证明游戏引擎

source: Dojo is a provable game engine built using [Cairo](https://github.com/starkware-libs/cairo). It establishes a standard for game development via smart contracts, blending best practices with streamlined development and deployment tools. With Dojo by your side, you can evolve from initial concept to a fully realized game in days, not weeks.
es: Dojo es un provable game engine (motor de juego demostrable) creado con [Cairo](https://github.com/starkware-libs/cairo). Establece un estándar para el desarrollo de juegos a través de smart contract, combinando las mejores prácticas con herramientas de desarrollo e implementación optimizadas. Con Dojo a tu lado, puedes evolucionar desde el concepto inicial hasta un juego completamente realizado en días, no semanas.

source: This book is dedicated to familiarizing you with the Dojo engine and the potential of Provable games. A special section on the [Theory](./theory/autonomous-worlds.md) elucidates this emergent concept of autonomous worlds and Provable games.
es: Este libro está dedicado a familiarizarte con el Dojo engine y el potencial de los Provable games. Una sección especial sobre la [Teoría](./theory/autonomous-worlds.md) elucida este concepto emergente de Autonomous Worlds y Provable games.
ko: 이 책은 Dojo 엔진과 증명가능한 게임의 잠재력에 익숙해지는 데 중점을 두고 있습니다. [이론](./theory/autonomous-worlds.md)의 특별 섹션에서는 자율 세계와 증명 가능한 게임에 대한 새로운 개념을 설명합니다.
zh_cn: 本指南旨在让您熟悉 Dojo 引擎和 可证明（Provable） 游戏的变革潜力。 [理论](./theory/autonomous-worlds.md)专节阐明了自主世界和 可证明游戏这一新兴概念。

source: - [Quickstart](./getting-started/quick-start.md) - [What is Dojo? ](./theory/what-is-dojo.md) - [Explore the Architecture](./cairo/hello-dojo.md)
es: - [Inicio Rápido](./getting-started/quick-start.md) - [¿Qué es Dojo? ](./theory/what-is-dojo.md) - [Explorar la Arquitectura](./cairo/hello-dojo.md)
ko: - [빠른 시작](./getting-started/quick-start.md) - [Dojo 란 무엇인가요? ](./theory/what-is-dojo.md) - [헬로 Dojo](./cairo/hello-dojo.md)
zh_cn: - [快速入门](./getting-started/quick-start.md) - [什么是 Dojo？](./theory/what-is-dojo.md) - [探索架构](./cairo/hello-dojo.md)

source: ### Explainer
es: ### Explicación
ko: ### 설명
zh_cn: ### 说明者

source: Here's a video of [Cartridge](https://cartridge.gg/)'s [Tarrence](https://twitter.com/tarrenceva) explaining how Dojo works at the 2023 [Autonomous Anonymous Summit](https://twitter.com/pet3rpan_/status/1666764726427353091):
es: Aquí tienes un video de [Cartridge](https://cartridge.gg/) donde [Tarrence](https://twitter.com/tarrenceva) explicando cómo funciona Dojo en la [Autonomous Anonymous Summit 2023](https://twitter.com/pet3rpan_/status/1666764726427353091):
ko: 다음은 [Cartridge](https://cartridge.gg/)의 [Tarrence](https://twitter.com/tarrenceva)가 2023년 [자율 익명 서밋](https://twitter.com/pet3rpan_/status/1666764726427353091)에서 Dojo가 어떻게 작동하는지 설명하는 영상입니다:
zh_cn: 以下是[Cartridge](https://cartridge.gg/) 的[Tarrence](https://twitter.com/tarrenceva) 在 2023 年[Autonomous Anonymous Summit](https://twitter.com/pet3rpan_/status/1666764726427353091) 上说明 Dojo 如何工作的视频：

source: ### Organizational Structure
es: ### Estructura Organizativa
ko: ### 조직 구조
zh_cn: ### 组织结构

source: Dojo is an open-source initiative, licensed under Apache 2.0, dedicated to promoting and advancing the concept of Autonomous Worlds (AWs). It is spearheaded by [Cartridge](https://cartridge.gg/), [Realms & BibliothecaDAO](https://bibliothecadao.xyz/), [briq](https://briq.construction/) and many more [contributors](https://github.com/orgs/dojoengine/people).
es: Dojo es una iniciativa de código abierto, con licencia Apache 2.0, dedicada a promover y hacer avanzar el concepto de Autonomous Worlds (AWs). Está encabezado por [Cartridge](https://cartridge.gg/), [Realms & BibliothecaDAO](https://bibliothecadao.xyz/), [briq](https://briq.construction/) y muchos más. [colaboradores](https://github.com/orgs/dojoengine/people).

source: ### How do I get involved?
es: ### ¿Cómo puedo involucrarme?
ko: ### 참여하려면 어떻게 해야 하나요?
zh_cn: ### 我该如何参与？

source: Check out our [Github](https://github.com/dojoengine), our [Twitter](https://twitter.com/dojostarknet), [Discord](https://discord.gg/vUN4Xq9Qv6) and [contribution guide](https://book.dojoengine.org/misc/contributors.html)
es: Consulte nuestro [Github](https://github.com/dojoengine), nuestro [Twitter](https://twitter.com/dojostarknet), [Discord](https://discord.gg/vUN4Xq9Qv6) y [guía de contribución](https://book.dojoengine.org/misc/contributors.html).
ko: [깃허브](https://github.com/dojoengine), [트위터](https://twitter.com/dojostarknet), [디스코드](https://discord.gg/vUN4Xq9Qv6), [기여 가이드](https://book.dojoengine.org/misc/contributors.html)를 확인하세요
zh_cn: 查看我们的 [Github](https://github.com/dojoengine)、[Twitter](https://twitter.com/dojostarknet)、[Discord](https://discord.gg/vUN4Xq9Qv6) 和 [贡献指南](https://book.dojoengine.org/misc/contributors.html)

source: # What is Dojo?
es: ## ¿Qué es Dojo?
ko: # Dojo란 무엇인가요?
zh_cn: # Dojo 是什么？

source: Dojo is the culmination of lessons learned from attempts at building [onchain games](https://naavik.co/digest/primer-fully-on-chain-gaming), an emerging sector in the gaming industry. Any developer who has endeavored to build an on-chain game recognizes the inherent engineering hurdles - a realization that drove us to create Dojo. Just as you wouldn't recreate Unity every time you develop a new game, the same principle applies here. Dojo is designed to handle the complex infrastructure, allowing developers to focus on the unique aspects of their games.
es: Dojo es la culminación de las lecciones aprendidas en los intentos de crear [juegos on-chain](https://naavik.co/digest/primer-fully-on-chain-gaming), un sector emergente en la industria del juego. Cualquier desarrollador que haya intentado crear un juego on-chain reconoce los obstáculos inherentes a la ingeniería, algo que nos impulsó a crear Dojo. Del mismo modo que no recrearías Unity cada vez que desarrollas un nuevo juego, aquí se aplica el mismo principio. Dojo está diseñado para manejar la compleja infraestructura, permitiendo a los desarrolladores centrarse en los aspectos únicos de sus juegos.

source: Dojo aspires to be the go-to tool for building provable games. It is radically open-source, and all contributions are welcome.
es: Dojo aspira a convertirse en la herramienta de referencia para crear Provable games. Es radicalmente de código abierto, y todas las contribuciones son bienvenidas.
ko: Dojo의 목표는 증명 가능한 게임 제작 도구가 되는 것입니다. 기본적으로 모두 오픈 소스로 제공되며, 모든 기여자를 환영합니다.
zh_cn: Dojo 立志成为构建可证明游戏的首选工具。它完全开源，欢迎所有形式的贡献。

source: ## Stop building infrastructure; start building games
es: ## Deja de construir infraestructuras; empieza a construir juegos
ko: ## 인프라 그만 만들고, 게임 만들기 시작하세요
zh_cn: ## 停止做基础设施，开始做游戏

source: Dojo's suite of tools takes the infrastructure complexity out of building on-chain games. It includes:
es: El conjunto de herramientas de Dojo elimina la complejidad de la infraestructura para crear juegos en la cadena. Incluye:
ko: Dojo는 온체인 게임 개발에 필요한 복잡한 인프라 문제를 해결하기 위해 아래의 도구들을 제공합니다:
zh_cn: Dojo 的工具套件消除了构建链上游戏的基础设施复杂性。它包括：

source: Dojo offers a standardized approach to building games on smart contracts. Recognizing the intricacies of game design, Dojo simplifies the development process, allowing creators to focus on gameplay logic. This standardization paves the way for an interconnected network of worlds, streamlining developer expertise and promoting game integration.
es: Dojo ofrece un enfoque estandarizado para crear juegos con smart contracs. Al reconocer las complejidades del diseño de juegos, Dojo simplifica el proceso de desarrollo, permitiendo a los creadores centrarse en la lógica del juego. Esta estandarización allana el camino para una red interconectada de Worlds, optimizando la experiencia de los desarrolladores y promoviendo la integración de juegos.
ko: Dojo는 스마트 컨트랙트 기반의 표준화된 게임 제작 접근법을 제공합니다. 게임 디자인 자체는 복잡한데, Dojo의 표준화된 접근법은 개발 프로세스를 단순화하여 게임플레이 로직에만 집중할 수 있게 합니다. 이로써 서로 연결된 게임 네트워크의 기반을 마련하고, 게임플레이의 통합을 쉽게 해줍니다.
zh_cn: Dojo 提供了一种在智能合约上构建游戏的标准化方法。Dojo 认识到游戏设计的复杂性，简化了开发流程，使创作者能够专注于游戏逻辑。这种标准化为世界互联网络铺平了道路，让开发人员的专业知识能够有效的发挥，促进了游戏整合。

source: Utilizing the ECS (Entity Component System) as its core architecture, Dojo effectively manages the state and behavior of Autonomous Worlds (AWs). This model revolves around systems acting on entities, which are collections of pure data components. Systems efficiently determine which entities to process based on persistent queries over these components.
es: Utilizando el ECS (Entity Component System) como arquitectura central, Dojo gestiona eficazmente el estado y el comportamiento de los Autonomous Worlds (AWs). Este Model gira en torno a Systems que actúan sobre entidades, que son colecciones de componentes de datos puros. Los Systems determinan eficientemente qué entidades procesar basándose en consultas persistentes sobre estos componentes.
ko: Dojo는 ECS(엔티티 컴포넌트 시스템)를 핵심 아키텍처로 활용하여 자율 세계(AW)의 상태와 동작을 효과적으로 관리합니다. 이 모델은 순수한 데이터 컴포넌트의 집합인 엔티티에 따라 작동하는 시스템을 중심으로 작동합니다. 시스템은 이러한 컴포넌에 대한 지속적인 쿼리를 기반으로 처리할 엔티티를 효율적으로 결정합니다.
zh_cn: Dojo 采用 ECS（实体组件系统）作为架构模式，以有效管理和组织自主世界（AW）的状态和行为。在这种模式中，计算被定义为在一组实体上运行的系统列表，每个实体都由一组动态的纯数据组件组成。各系统通过对实体组件进行持久、高效的查询，选择要处理的实体。

source: Read detailed information about the [Dojo ECS](../cairo/overview.md).
es: Lea información detallada sobre el [Dojo ECS](../cairo/overview.md).
ko: [Dojo ECS](../cairo/overview.md)에 대한 자세한 정보를 읽어보세요.
zh_cn: 阅读有关 [Dojo ECS](../cairo/overview.md) 的详细信息。

source: ### [Torii](/crates/torii/README.md) - Starknet Indexer
es: ### [Torii](/crates/torii/README.md) - Indexador Starknet
ko: ### [Torii](/crates/torii/README.md) - 스타크넷 인덱서
zh_cn: ### [Torii](/crates/torii/README.md) - Starknet索引器

source: Building on-chain games often involves grappling with the challenge of indexing on-chain state. However, Dojo standardizes contract states to mirror traditional relational databases. This setup enables the [Torii Indexer](../toolchain/torii/overview.md) to auto-index all contract states, ensuring efficient and streamlined queries. Torii then exposes these states via a GraphQL API or gRPC (coming soon), allowing developers to easily query and retrieve data.
es: Construir juegos on-chain a menudo implica enfrentarse al reto de indexar el estado on-chain. Sin embargo, Dojo estandariza los estados de los contratos para reflejar las bases de datos relacionales tradicionales. Esta configuración permite al [Torii Indexer](../toolchain/torii/overview.md) indexar automáticamente todos los estados del contrato, garantizando consultas eficientes y racionalizadas. Torii luego expone estos estados a través de una API GraphQL o gRPC (próximamente), permitiendo a los desarrolladores consultar y recuperar datos fácilmente.
ko: 온체인 게임을 개발하면서 온체인 상태 인덱싱 문제를 해결해야 할 때가 있습니다. Dojo는 기존 관계형 데이터베이스를 반영하여 컨트랙트 상태를 표준화합니다. [Torii 인덱서](../toolchain/torii/overview.md)를 통해 모든 컨트랙트 상태가 자동으로 인덱싱되어, 효율적이며 간소화된 쿼리가 가능합니다. 그런 다음 Torii는 이러한 상태를 GraphQL API 또는 gRPC(곧 출시 예정)를 통해 노출하여 개발자가 데이터를 쉽게 쿼리하고 검색할 수 있도록 합니다.
zh_cn: 构建链上游戏通常需要解决链上状态索引的难题。不过，Dojo 将合约状态标准化，以反映传统的关系数据库。通过这种设置，[Torii 索引器](../toolchain/torii/overview.md)可以自动索引所有合约状态，确保高效、精简的查询。然后，Torii 通过 GraphQL API 或 gRPC（即将推出）公开这些状态，允许开发人员轻松查询和检索数据。

source: Using Torii drastically reduces the time and effort required to build on-chain games. It also eliminates the need to manually create indexers, which can be a tedious and error-prone process.
es: El uso de Torii reduce drásticamente el tiempo y el esfuerzo necesarios para crear juegos on-chain. También elimina la necesidad de crear manualmente indexadores, que puede ser un proceso tedioso y propenso a errores.
ko: Torii를 사용하면 온체인 게임을 개발하는데에 필요한 시간과 노력을 크게 줄일 수 있습니다. 또한 오류가 발생하기 쉬운 인덱서를 수동으로 생성할 필요가 없습니다.
zh_cn: 使用 Torii 大大减少了构建链上游戏所需的时间和精力。它还消除了手动创建索引器的需要，而手动创建索引器可能是一个乏味且容易出错的过程。

source: ### [Katana](/crates/katana/README.md) - Blazingly fast development network
es: ### [Katana](/crates/katana/README.md) - Red de desarrollo rapidísima
ko: ### [Katana](/crates/katana/README.md) - 빠른 개발용 네트워크
zh_cn: ### [Katana](/crates/katana/README.md) - 如闪电般快速的开发网

source: Katana is a customizable StarkNet development network. It is blazingly fast and allows you to iterate on your game logic swiftly.
es: Katana es una red de desarrollo Starknet personalizable. Es rapidísima y te permite iterar sobre la lógica de tu juego con rapidez.
ko: Katana는 커스터마이징 가능한 스타크넷 개발용 네트워크로, 빠른 반복 개발이 가능합니다.
zh_cn: Katana 是一个可定制的 StarkNet 开发网。它速度极快，可让您迅速迭代游戏逻辑。

source: ### [Sozo CLI](/crates/sozo/README.md) - CLI Management Tool
es: ### [Sozo CLI](/crates/sozo/README.md) - Herramienta de Gestión CLI
ko: ### [Sozo CLI](/crates/sozo/README.md) - CLI 관리 도구
zh_cn: ### [Sozo CLI](/crates/sozo/README.md) - CLI 管理工具

source: Dojo worlds are poised to become some of the largest contracts. Sozo is a CLI tool that assists you in managing your worlds. It enables you to create, build, test, and deploy your worlds. Additionally, you can craft new components and systems and register them with your world.
es: Los Worlds Dojo están a punto de convertirse en algunos de los mayores contratos. Sozo es una herramienta CLI que te ayuda a gestionar tus Worlds. Te permite crear, construir, probar y desplegar tus Worlds. Además, puedes crear nuevos componentes y Systems y registrarlos en tu World.
ko: Dojo 월드는 크게 확장된 컨트랙트입니다. Sozo는 월드를 관리하기 위한 CLI 도구로, 이를 통해 월드의 생성, 빌드, 테스트, 배포가 가능합니다. 또한 새로운 컴포넌트와 시스템을 제작하여 월드에 등록할 수도 있습니다.
zh_cn: 一些Dojo 世界有望成为链上最为庞大的那些合约。Sozo 是一款 CLI 工具，可帮助您管理您的世界。通过它，您可以创建、构建、测试和部署您的世界。此外，您还可以制作新的组件和系统，并将它们注册到您的世界中。

source: ### What Dojo doesn't give you
es: ### Que no te ofrece Dojo
ko: ### Dojo가 제공하지 않는 것
zh_cn: ### Dojo 不提供的东西

source: 1. Visual graphics - While Dojo provides networking and contracts, it doesn't offer graphical engines. You can bring your graphics of choice! Integrate your Dojo world with Unreal, Godot, or Unity.
es: 1. Gráficos visuales - Aunque Dojo proporciona redes y contratos, no ofrece motores gráficos. ¡Puedes traer los gráficos de tu elección! Integra tu World Dojo con Unreal, Godot o Unity.
ko: 1. 시각적 그래픽 - Dojo는 네트워킹과 컨트랙트는 제공하지만 그래픽 엔진은 제공하지 않습니다. 하지만 원하는 그래픽 엔진(예: 언리얼, 고도, 유니티)을 가져와 Dojo 월드와 통합이 가능합니다.
zh_cn: 1. 可视化图形 - Dojo 提供网络访问和合约，但不提供图形引擎。您可以自行选择图形引擎！将您的 Dojo 世界与虚幻、Godot 或 Unity 整合。

source: ## Understanding the Dojo Workflow: A Visual Guide
es: ## Entendiendo el Workflow de Dojo: Una Guía Visual
ko: ## Dojo 워크플로 이해하기: 비주얼 가이드
zh_cn: ## 理解 Dojo的工作流程：一份可视化指南

source: To help you understand how `Sozo` works, we've created a visual guide that outlines the flow of execution using the powerful sozo tool and the katana development network.
es: Para ayudarle a entender cómo funciona `Sozo`, hemos creado una guía visual que describe el flujo de ejecución utilizando la potente herramienta sozo y la red de desarrollo katana.
ko: 'Sozo'의 작동 방식을 이해하는 데 도움을 주기 위해 강력한 sozo 도구와 katana 개발 네트워크를 사용하여 흐름을 간략하게 설명하는 비쥬얼 가이드를 만들었습니다.
zh_cn: 为了帮助您了解 `Sozo` 的工作原理，我们制作了一份可视化指南，概述了使用功能强大的 `Sozo` 工具和 `Katana` 开发网的执行流程。

source: This visual representation will help you grasp the fundamental steps of working with Dojo, guiding you through the process of creating and managing your on-chain games.
es: Esta representación visual le ayudará a comprender los pasos fundamentales del trabajo con Dojo, guiándole a través del proceso de creación y gestión de sus juegos on-chain.
ko: 이 가이드는 Sozo 도구와 Katana 개발 네트워크를 활용하여 Dojo의 기본 단계와 온체인 게임 제작 및 관리 과정을 설명합니다.
zh_cn: 这种可视化表示法将帮助您掌握使用 Dojo 的基本步骤，指导您完成创建和管理链上游戏的过程。

source: > "Autonomous worlds represent persistent, permissionless, and decentralized open environments that users can freely interact with and contribute to."
es: > "Los Autonomous Worlds representan entornos abiertos persistentes, sin permisos y descentralizados con los que los usuarios pueden interactuar y contribuir libremente".
ko: > "자율 세계는 사용자가 자유롭게 상호 작용하고 기여할 수 있는 지속 가능하며 중앙 권한이 없는 분산된 개방된 환경을 말합니다.”
zh_cn: > "自主世界代表着持久、无许可和分散的开放环境，用户可以自由地与之互动并做出贡献"。

source: The precise definition of Autonomous Worlds (AWs) remains somewhat elusive, as it is more of an abstract concept that has yet to be fully crystallized. Lattice first [introduced](https://0xparc.org/blog/autonomous-worlds) the terminology in 2022, but the notion of open worlds operating on the blockchain has been around for a while. The abstraction introduced by MUD served as a catalyst for the market to recognize the potential of these worlds.
es: La definición precisa de Autonomous Worlds (AWs) sigue siendo algo difícil de alcanzar, ya que es más bien un concepto abstracto que aún no se ha cristalizado por completo. Lattice [introdujo](https://0xparc.org/blog/autonomous-worlds) la terminología por primera vez en 2022, pero la noción de Worlds abiertos operando en blockchain existe desde hace un tiempo. La abstracción introducida por la MUD sirvió de catalizador para que el mercado reconociera el potencial de estos Worlds.
ko: 자율 세계(AW)의 개념은 아직 완전히 구체화되지 않아 추상적인 면이 있습니다. Lattice가 2022년에 이 [용어](https://0xparc.org/blog/autonomous-worlds)를 처음 도입했으나, 블록체인에서 운용되는 오픈 월드라는 아이디어는 이미 오래 전부터 있었습니다. MUD가 추상적 개념으로 제시됨으로써, 시장은 이러한 월드의 잠재력을 더욱 인식하게 되었습니다.
zh_cn: 自主世界（AW）的确切定义仍然有些难以捉摸，因为它更像是一个抽象概念，尚未完全具体化。Lattice 在 2022 年首次[介绍](https://0xparc.org/blog/autonomous-worlds) 了这一术语，但在区块链上运行的开放世界这一概念已经存在了一段时间。MUD 引入的抽象概念是让市场认识到这些世界潜力的催化剂。

source: Autonomous Worlds share notable similarities with blockchains in their fundamental nature. Once established, they persist, maintaining their state throughout the lifespan of the chain. Players can join or leave, and developers can expand these worlds by deploying features in a permissionless manner, much like how contracts are added to a chain. While there is no universally accepted definition for an Autonomous World, we believe that a game must possess at least the following two essential features to be considered as such:
es: Los Autonomous Worlds comparten similitudes destacadas con las cadenas de bloques en su naturaleza fundamental. Una vez establecidos, persisten y mantienen su estado a lo largo de la vida útil de la cadena. Los jugadores pueden unirse o salir, y los desarrolladores pueden ampliar estos Worlds desplegando características de manera sin permisos, de manera similar a cómo se añaden contratos a una cadena. Aunque no existe una definición universalmente aceptada para un Autonomous Worlds, creemos que un juego debe poseer al menos las siguientes dos características esenciales para ser considerado como tal:
ko: 자율 세계는 근본적으로 블록체인과 여러 중요한 특징을 공유합니다. 한 번 만들어진 자율 세계는 체인의 수명 동안 지속되며, 플레이어들은 자유롭게 참여하거나 나갈 수 있습니다. 개발자들도 체인에 컨트랙트를 추가함으로써 자율 세계를 확장할 수 있습니다. 자율 세계의 정의는 명확하지 않지만, 유니티는 게임이 자율 세계로 간주되기 위해서는 적어도 다음 두 가지 요소가 필요하다고 강조합니다:
zh_cn: 自主世界在基本性质上与区块链有显著的相似之处。一旦建立，它们就会持续存在，在链的整个生命周期内保持状态。玩家可以加入或退出，开发者可以部署功能来扩展这些世界--这一切都无需权限，就像将合约添加到链上一样。虽然自主世界并没有公认的定义，但我们认为游戏必须至少具备以下两个基本特征才能被视为自主世界：

source: 1. Decentralized data availability layer: While the state execution may reside on a centralized layer, it is crucial that the state can be reconstructed if the execution layer ceases to exist. Rollups offer a solution, providing increased capacity execution layers while ensuring data is permanently settled on Ethereum. This guarantees the world's perpetual persistence. 2. Permissionless entry point for expanding the world: The World contract must be capable of accepting new systems and components without requiring permission. While this doesn't imply that every component and system will be utilized, they must adhere to this pattern, ensuring open and unrestricted access for potential enhancements.
es: 1. Capa de disponibilidad de datos descentralizada: Si bien la ejecución del estado puede residir en una capa centralizada, es crucial que el estado pueda reconstruirse si la capa de ejecución deja de existir. Los rollups ofrecen una solución que proporciona capas de ejecución de mayor capacidad y al mismo tiempo garantiza que los datos se establezcan permanentemente en Ethereum. Esto garantiza la persistencia perpetua del World. 2. Punto de entrada permissionless para expandir el World: El contrato del World debe ser capaz de aceptar nuevos Systems y componentes sin necesidad de permiso. Si bien esto no implica que se utilizarán todos los componentes y Systems, deben cumplir con este patrón, garantizando un acceso abierto y sin restricciones para posibles mejoras.
ko: 1. 분산형 데이터 가용성 계층: 상태는 중앙화된 레이어에서 실행될 수 있으나, 해당 레이어가 사라져도 상태를 복구할 수 있어야 합니다. 롤업은 데이터를 이더리움에 안정적으로 저장하며 실행 레이어의 용량을 확장하는 솔루션을 제공합니다. 이것은 월드의 지속성을 보장합니다. 2. 월드 확장을 위한 무허가 진입점: 월드 컨트랙트는 허가 없이 새로운 시스템과 구성 요소를 수용할 수 있어야 합니다. 모든 구성 요소와 시스템이 반드시 사용되는 것은 아니지만, 이 원칙을 따라서 열린 액세스와 잠재적인 개선을 보장해야 합니다.
zh_cn: 1. 分散数据可用层：虽然状态执行可能位于中心化层，但如果执行层不复存在，状态能否重建至关重要。Rollup提供了一种解决方案，在确保数据永久沉淀在以太坊上的同时，提供了容量更大的执行层。这保证了世界的永久持久性。 2. 用于扩展世界的无需权限入口：世界合约必须能够接受新的系统和组件，而无需获得许可。虽然这并不意味着每个组件和系统都会被利用，但它们必须遵守这一模式，确保开放和不受限制地访问潜在的增强功能。
