Repository: dojoengine/book
Catalog: po/*.po
Languages: es, ko, zh_cn

source: You've made the basic contracts for a chess game using the Dojo engine! This tutorial was just the beginning. There are many ways to make the game better, like optimizing parts, adding checks, or considering special cases. If you want to do more with this chess game, try these challenges:
es: ¡Has creado los contratos básicos para un juego de ajedrez usando el Dojo engine! Este tutorial fue solo el comienzo. Hay muchas formas de mejorar el juego, como optimizar piezas, agregar controles o considerar casos especiales. Si quieres hacer más con este juego de ajedrez, prueba estos desafíos:
ko: Dojo 엔진을 사용하여 체스 게임의 기본 컨트랙트를 만들었습니다! 이 튜토리얼은 시작에 불과합니다. 최적화, 추가적인 수 적합성 체크, 특수한 수 고려 등 게임을 개선할 수 있는 방법은 많습니다. 이 체스 게임으로 더 많은 것을 해보고 싶으시다면 다음 챌린지에 도전해 보세요:
zh_cn: 您已经使用 Dojo 引擎制作了国际象棋游戏的基本合约！本教程只是一个开始。有很多方法可以让游戏变得更好，例如优化部分、添加检查或考虑特殊情况。如果您想在这个国际象棋游戏中做得更多，请尝试这些挑战：

source: - Add a checkmate feature. Our game doesn't end now, so decide when it should! - Include special moves like castling, En Passant Capture, or Pawn Promotion. - Make your own chess rules! You could even create your own version of the [immortal game](https://immortal.game/)
es: - Agregar una función de jaque mate. Nuestro juego no termina ahora, ¡así que decide cuándo debería terminar! - Incluye movimientos especiales como enroque, captura al paso o promoción de peones. - ¡Haz tus propias reglas de ajedrez! Incluso podrías crear tu propia versión del [juego inmortal](https://immortal.game/)

source: Lastly, share your project with others in the [Dojo community](https://discord.gg/akd2yfuRS3)!
es: ¡Por último, comparte tu proyecto con otros en la [comunidad Dojo](https://discord.gg/akd2yfuRS3)!
ko: 마지막으로, [Dojo 커뮤니티](https://discord.gg/akd2yfuRS3)에서 다른 사람들과 프로젝트를 공유하세요!
zh_cn: 最后，与 [Dojo 社区](https://discord.gg/akd2yfuRS3) 中的其他人分享您的项目！

source: # 4. Modularize functions
es: # 4. Modularizar funciones

source: In order to keep our code has dry as possible, you can modularize your functions. To do this, we'll create an `utils.cairo` file and add the below:
es: Para mantener nuestro código lo más seco posible, puede modularizar sus funciones. Para hacer esto, crearemos un archivo `utils.cairo` y agregaremos lo siguiente:

source: In your, `action_contracts`, these functions can be imported for use as follows
es: En su `action_contracts`, estas funciones se pueden importar para usarlas de la siguiente manera

source: That's right! you have successfully modularized your functions.
es: ¡Así es! Ha modularizado con éxito sus funciones.

source: ## Contributing to Dojo Book
es: ## Contribuyendo al libro de Dojo
ko: ## 기여하기
zh_cn: ## 为《Dojo Book》做贡献

source: As the Dojo engine progresses and develops, it is essential for the Dojo book to keep pace with these advancements. Updating and refining the book ensures that it remains a relevant and valuable resource for those interested in understanding and utilizing the latest Dojo engine features and capabilities. All help is welcome!
es: A medida que el Dojo engine progresa y se desarrolla, es esencial que el libro de Dojo siga el ritmo de estos avances. Actualizar y perfeccionar el libro garantiza que siga siendo un recurso relevante y valioso para aquellos interesados en comprender y utilizar las funciones y capacidades más recientes del Dojo engine. ¡Toda ayuda es bienvenida!
ko: Dojo 엔진이 발전함에 따라 Dojo 책도 마찬가지로 계속 업데이트가 되어야합니다. 이 책을 계속 업데이트하여 최신 Dojo 엔진 기능을 이해하고 활용하는 데 관심이 있는 분들에게 가치 있는 자료가 되도록 노력하겠습니다. 모든 도움을 환영합니다!
zh_cn: 随着 Dojo 引擎的进步和发展，Dojo 书籍需要跟上这些进展的步伐。对本书进行更新和完善，可以确保它对于那些有兴趣了解和使用最新 Dojo 引擎特性和功能的人来说，本书仍然是一个相关和有价值的资源。欢迎大家提供帮助！

source: ### The purpose of the book
es: ### El propósito del libro.
ko: ### 책의 목적
zh_cn: ### 本书的目的

source: The Dojo book is designed to be a comprehensive resource that caters to users at various levels of experience. It aims to serve as both an introductory guide for those new to Dojo and its ancillary packages, as well as a reference for more experienced users seeking to deepen their understanding of the engine's features and capabilities.
es: El libro Dojo está diseñado para ser un recurso integral dirigido a usuarios de distintos niveles de experiencia. Su objetivo es servir como guía introductoria para quienes son nuevos en Dojo y sus paquetes auxiliares, así como también como referencia para usuarios más experimentados que buscan profundizar su comprensión de las características y capacidades del motor.
ko: Dojo 책은 다양한 경험 수준의 사용자를 위한 종합적인 자료로 설계되었습니다. Dojo 및 보조 패키지를 처음 접하는 사용자를 위한 입문서이자 엔진의 기능과 성능을 더 깊이 이해하고자 하는 숙련된 사용자를 위한 참고서 역할을 하는 것을 목표로 합니다.
zh_cn: Dojo 一书旨在为不同经验水平的用户提供全面的资源。它既可作为 Dojo 及其辅助软件包新手的入门指南，也可作为经验丰富的用户加深对引擎特性和功能的理解的参考资料。

source: The book is split into some major chapters:
es: El libro está dividido en algunos capítulos principales:
ko: 이 책은 몇 가지 주요 장으로 나뉩니다:
zh_cn: 本书分为几个主要章节：

source: - Framework Theory - Getting Started - Building a World
es: - Teoría del Framework - Primeros Pasos - Construyedo un World
ko: - 프레임워크 이론 - 시작하기 - 월드 구축
zh_cn: - 框架理论 - 入门 - 构建世界

source: ### Code of Conduct
es: ### Código de Conducta
ko: ### 행동 강령
zh_cn: ### 代码标准

source: The book follows the [Rust Code of Conduct](https://www.rust-lang.org/policies/code-of-conduct).
es: El libro sigue el [Código de conducta de Rust](https://www.rust-lang.org/policies/code-of-conduct).
ko: 이 책은 [Rust Code of Conduct](https://www.rust-lang.org/policies/code-of-conduct)을 따릅니다.
zh_cn: 本书遵循 [Rust Code of Conduct](https://www.rust-lang.org/policies/code-of-conduct)。

source: ### Ways to contribute
es: ### Formas de contribuir
ko: ### 기여하는 방법
zh_cn: ### 贡献方式

source: If you think that some content is missing or out-of-date, feel free to open an issue. If you find multiple pieces of content lacking, please open up a separate issue for each.
es: Si cree que falta algún contenido o que está desactualizado, no dude en abrir un problema. Si encuentra que faltan varios contenidos, abra un issue separado para cada uno.
ko: 일부 내용이 누락되었거나 오래되었다고 생각되면 언제든지 이슈를 개설해 주세요. 여러 개의 콘텐츠가 누락된 경우 각각에 대해 별도의 이슈를 개설해 주세요.
zh_cn: 如果您认为某些内容缺失或过时，请随时在git上提出issue。如果您发现有多个内容缺失，请为每个内容单独开立一个issue。

source: The issues will then be labeled so other contributors can find chunks of work they are interested in more easily.
es: Luego, los issues se etiquetarán para que otros contribuyentes puedan encontrar fragmentos de trabajo que les interesen más fácilmente.
ko: 그러면 이슈에 레이블이 지정되어 다른 기여자들이 관심 있는 작업 내용을 더 쉽게 찾을 수 있습니다.
zh_cn: 你提出issue在之后将被贴上相关的标签，以便其他贡献者更容易找到他们感兴趣的任务。

source: The issue should contain what is missing, or what could be improved, in as much detail as you deem necessary.
es: El issue debe contener lo que falta o lo que podría mejorarse, con el mayor detalle que considere necesario.
ko: 이슈에는 누락된 내용이나 개선할 수 있는 내용이 필요하다고 생각되는 만큼 자세히 포함되어야 합니다.
zh_cn: Issue应包含哪些地方缺失了，或哪些地方可以改进，只要你认为有必要，都可以详细说明。

source: Feel free to contribute changes to the book by opening a pull request - anything is welcome, from reformulating a sentence, fixing a typo, to adding new sections or chapters.
es: Siéntase libre de contribuir con cambios al libro abriendo una pull request; cualquier cosa es bienvenida, desde reformular una oración, corregir un error tipográfico hasta agregar nuevas secciones o capítulos.
ko: PR를 개설하여 문장을 고치거나 오타를 수정하는 것부터 새로운 섹션이나 챕터를 추가하는 것까지 무엇이든 자유롭게 책에 기여하세요.
zh_cn: 欢迎随时通过提交PR请求对本书进行修改--从改写一个句子、修正一个错别字到添加新的段落或章节，我们都欢迎。

source: When your pull request is open, other contributors will take a look and may request changes. Do not be discouraged!
es: Cuando su pull request esté abierta, otros contribuyentes la echarán un vistazo y podrán solicitar cambios. ¡No se desanime!
ko: PR을 열게 되면 다른 기여자가 검토하고 변경을 요청할 수 있습니다. 낙심하지 마세요!
zh_cn: 当您的PR开放时，其他贡献者会查看并可能要求你进行一些修正。请不要气馁！

source: ### Writing style
es: ### Estilo de escritura
ko: ### 글쓰기 스타일
zh_cn: ### 写作风格

source: This section documents a few standards for writing used throughout the book.
es: Esta sección documenta algunos estándares de escritura utilizados a lo largo del libro.
ko: 이 섹션에서는 책 전체에서 사용되는 몇 가지 글쓰기 표준을 설명합니다.
zh_cn: 本节记录了一些贯穿全书的写作标准。

source: #### Chapters start with a second level heading
es: #### Los capítulos comienzan con un título de segundo nivel.
ko: #### 챕터는 두 번째 레벨 제목으로 시작합니다
zh_cn: #### 章节从二级标题开始（译者注：请参考markdown语法）

source: We use:
es: Nosotros usamos:
ko: 우리는 사용합니다:
zh_cn: 我们使用：

source: We do not use:
es: Nosotros no usamos:
ko: 우리는 사용하지 않습니다:
zh_cn: 我们不使用（译者注：此为一级大标题语法，只应该作为页面标题存在而不应该作为页面内的内容标题而存在）：

source: Hello Dojo
ko: 헬로 Dojo

source: World
ko: 월드(World)
zh_cn: 世界

source: Components
ko: 컴포넌트(Components)
zh_cn: 组件

source: Systems
ko: 시스템(Systems)
zh_cn: 系统

source: Entities
ko: 엔티티(Entities)
zh_cn: 实体

source: Dojo Modules
ko: Dojo 모듈
zh_cn: Dojo的模块

source: Client SDKs
ko: 클라이언트 SDK
zh_cn: 客户端 SDK

source: Core
ko: 코어
zh_cn: 核心

source: build
ko: 빌드
zh_cn: 编译

source: test
ko: 테스트
zh_cn: 测试

source: migrate
ko: 마이그레이션
zh_cn: 迁移

source: execute
ko: 실행
zh_cn: 执行

source: register
ko: 등록
zh_cn: 注册

source: system
ko: 시스템
zh_cn: 系统

source: component
ko: 컴포넌트
zh_cn: 组件

source: events
ko: 이벤트
zh_cn: 事件

source: Tutorial
ko: 튜토리얼
zh_cn: 教程

source: Onchain Chess
ko: 온체인 체스
zh_cn: 链上国际象棋

source: 4. Test Chess
ko: 4. 체스 테스트
zh_cn: 4. 测试国际象棋

source: Dojo employs [Cairo](https://github.com/starkware-libs/cairo) to deliver a robust architecture and toolset for designing autonomous worlds and onchain games. It features an integrated entity component system (ECS) and includes a native indexer, RPC testnet, and a comprehensive CLI management toolkit.
ko: Dojo는 [Cairo](https://github.com/starkware-libs/cairo)를 사용하여 자율 세계와 온체인 게임 설계를 위한 강력한 아키텍처와 툴셋을 제공합니다. 카이로는 통합 엔티티 컴포넌트 시스템(ECS)을 갖추고 있으며 네이티브 인덱서, RPC 테스트넷, 포괄적인 CLI 관리 툴킷을 포함하고 있습니다.
zh_cn: Dojo 采用 [Cairo语言](https://github.com/starkware-libs/cairo)，为设计自主世界和链上游戏提供了强大的架构和工具集。它拥有一个集成的实体组件系统（ECS），包括一个本地索引器、RPC 测试网和一个全面的 CLI 管理工具包。

source: <video controls poster="https://gf326cjag4w6pdpc42qp22enfhxsywmq6sgs7mkxbn6el7aioyxa.arweave.net/MXevCSA3LeeN4uag_WiNKe8sWZD0jS-xVwt8RfwIdi4"> <source src="https://sfx25btazqz62pajxecorlp4exskwgokakub44rxmpnsosep5iqa.arweave.net/kW-uhmDMM-08CbkE6K38JeSrGcoCqB5yN2PbJ0iP6iA" type="video/mp4"> Your browser does not support the video tag. </video>
ko: <video controls poster="https://gf326cjag4w6pdpc42qp22enfhxsywmq6sgs7mkxbn6el7aioyxa.arweave.net/MXevCSA3LeeN4uag_WiNKe8sWZD0jS-xVwt8RfwIdi4"> <source src="https://sfx25btazqz62pajxecorlp4exskwgokakub44rxmpnsosep5iqa.arweave.net/kW-uhmDMM-08CbkE6K38JeSrGcoCqB5yN2PbJ0iP6iA" type="video/mp4"> 브라우저가 동영상 태그를 지원하지 않습니다. </video>
zh_cn: <video controls poster="https://gf326cjag4w6pdpc42qp22enfhxsywmq6sgs7mkxbn6el7aioyxa.arweave.net/MXevCSA3LeeN4uag_WiNKe8sWZD0jS-xVwt8RfwIdi4"> <source src="https://sfx25btazqz62pajxecorlp4exskwgokakub44rxmpnsosep5iqa.arweave.net/kW-uhmDMM-08CbkE6K38JeSrGcoCqB5yN2PbJ0iP6iA" type="video/mp4"> 您的浏览器不支持视频标记。 </video>

source: Dojo is an open-source initiative, licensed under MIT, dedicated to promoting and advancing the concept of Autonomous Worlds (AWs). It is spearheaded by [Cartridge](https://cartridge.gg/), [Realms & BibliothecaDAO](https://bibliothecadao.xyz/), [briq](https://briq.construction/) and many more [contributors](https://github.com/orgs/dojoengine/people).
ko: Dojo는 MIT 라이선스를 받은 오픈소스 이니셔티브로, 자율 세계(Autonomous Worlds)의 개념을 홍보하고 발전시키는 데 전념하고 있습니다. [Cartridge](https://cartridge.gg/), [Realms & BibliothecaDAO](https://bibliothecadao.xyz/), [briq](https://briq.construction/) 및 기타 여러 [컨트리뷰터](https://github.com/orgs/dojoengine/people)가 주도하고 있습니다.
zh_cn: Dojo 是一项开源计划，采用 MIT 许可，致力于推广和推进自主世界 (AW) 概念。它由[Cartridge](https://cartridge.gg/)、[Realms & BibliothecaDAO](https://bibliothecadao.xyz/)、[briq](https://briq.construction/)和更多[贡献者们](https://github.com/orgs/dojoengine/people)牵头。 中文版由[Starknet Astro](https://twitter.com/StarkNetAstroCN)与[AW Research](https://twitter.com/AW_Research)共同翻译。

source: Dojo is the culmination of lessons learned from attempts at building [on-chain games](https://naavik.co/digest/primer-fully-on-chain-gaming), an emerging sector in the gaming industry. Any developer who has endeavored to build an on-chain game recognizes the inherent engineering hurdles - a realization that drove us to create Dojo. Just as you wouldn't recreate Unity every time you develop a new game, the same principle applies here. Dojo is designed to handle the complex infrastructure, allowing developers to focus on the unique aspects of their games.
ko: Dojo는 게임 업계에서 떠오르는 분야인 [온체인 게임](https://naavik.co/digest/primer-fully-on-chain-gaming)을 구축하기 위한 다양한 시도와 교훈을 종합한 결과물입니다. 온체인 게임 개발에 경험이 있는 개발자라면 이 분야의 내재된 엔지니어링 문제점을 잘 알고 있을 것입니다. 이러한 깨달음을 바탕으로 Dojo가 탄생했습니다. 새로운 게임을 개발할 때마다 Unity를 처음부터 만들 필요가 없는 것처럼, Dojo는 복잡한 게임 인프라 처리를 대신해줍니다, 이를 통해 개발자는 게임의 특징에만 집중할 수 있습니다.
zh_cn: Dojo 是在游戏行业的新兴领域--[链上游戏](https://naavik.co/digest/primer-fully-on-chain-gaming) 的尝试中吸取的经验教训的结晶。任何尝试过开发链上游戏的开发者都会明白其中固有的工程障碍--这种认识促使我们创建了 Dojo。正如您不会在每次开发新游戏时都重新创建 Unity 一样，同样的原则也适用于此。Dojo 旨在处理复杂的基础架构，让开发人员能够专注于其游戏的独特之处。

source: ### Entity Component System (ECS)
ko: ### 엔티티 컴포넌트 시스템(ECS)
zh_cn: ### 实体组件系统（ECS）

source: Dojo Sozo Workflow
ko: ## Dojo 워크플로
zh_cn: Dojo Sozo 工作流程

source: ## Autonomous Worlds
ko: ## 자율 세계(Autonomous Worlds)
zh_cn: ## 自主世界

source: We're firm believers in the potential for Autonomous Worlds to catalize the exploration of novel forms in the medium provided by zk proofs and blockchain technology. This is not only about games, but also about new forms of artwork, coordination, fun, emerging from tinkering and radical innovation, eventually questioning the very notion of "play" in this brave new decentralized and trustless world.
ko: 우리는 자율 세계가 영지식 증명과 블록체인 기술을 통한 새로운 탐험의 잠재력을 지니고 있다고 생각합니다. 이것은 단순히 게임을 넘어서, 새로운 예술 작품, 협력, 창의성, 그리고 이 혁신적인 탈중앙화 세계에서 ‘놀이’라는 개념 자체를 재평가하는 방식에 관한 것입니다.
zh_cn: 我们坚信，自主世界有潜力在 zk 证明和区块链技术提供的媒介中催化对新形式的探索。这不仅关系到游戏，还关系到新形式的艺术作品、协调、乐趣，它们都来自修补和激进创新，最终在这个勇敢的去中心化和无信任的新世界中对 "游玩" 的概念提出质疑。

source: - [Community Hub](https://dojoengine.notion.site/Dojo-Engine-Community-Hub-d316194b998941c48ddf771a4dd5ff08#bcd6a32db1b2406cb6c325f3b700d45a) - [Discord](https://discord.gg/KG9w9BmDrV) - [Twitter](https://twitter.com/dojostarknet) - [Awesome Dojo](https://github.com/dojoengine/awesome-dojo)
ko: - [커뮤니티 허브](https://dojoengine.notion.site/Dojo-Engine-Community-Hub-d316194b998941c48ddf771a4dd5ff08#bcd6a32db1b2406cb6c325f3b700d45a) - [디스코드](https://discord.gg/KG9w9BmDrV) - [트위터](https://twitter.com/dojostarknet) - [Awesome Dojo](https://github.com/dojoengine/awesome-dojo)

source: ## Dojo in 15 Minutes
ko: ## 15분 안에 Dojo 게임 만들기
zh_cn: ## 十五分钟进道场(dojo)

source: Think of Dojo as an abstraction over Cairo, similar to how React is to JavaScript. It enables you to write shorthand commands that expand into complex queries during compile time. Dojo is grounded in the well-known architecture known as the Entity Component System (ECS).
ko: Dojo는 자바스크립트에서 React가 그러하듯 Cairo를 추상화한 것이라고 생각하면 됩니다. 이를 통해 컴파일 시간 동안 복잡한 쿼리로 확장되는 단축 명령을 작성할 수 있습니다. Dojo는 엔티티 컴포넌트 시스템(ECS)이라는 잘 알려진 아키텍처에 기반을 두고 있습니다.
zh_cn: 你可以将 Dojo 视为 Cairo 的抽象，类似于 React 对 JavaScript 的抽象。它能让您编写速记命令，并在编译时扩展为复杂的查询。Dojo 基于著名的实体组件系统（Entity Component System，ECS）架构。

source: In Dojo, you design your worlds using Systems and Components. Systems outline the logic of your world, while components signify the state. This powerful pattern allows you to structure your logic in a highly modular way. If you don't understand this yet, don't fret; we'll delve into it in detail below.
ko: Dojo에서는 시스템과 컴포넌트를 사용해 월드를 디자인합니다. 시스템은 월드의 로직을, 컴포넌트는 상태를 나타냅니다. 이 강력한 패턴을 사용하면 고도로 모듈화된 방식으로 로직을 구조화할 수 있습니다. 아직 이해가 안 되더라도 걱정하지 마세요. 아래에서 자세히 설명해드리겠습니다.
zh_cn: 在 Dojo 中，您可以使用系统和组件来设计您的世界。系统概括了世界的逻辑，而组件则表示状态。这种强大的模式允许你以高度模块化的方式构建逻辑。如果你还不明白，不要着急，我们将在下文中详细介绍。

source: Inspect the contents of the `dojo-starter` project, and you'll notice the following structure (excluding the non-cairo files):
ko: `dojo-starter` 프로젝트의 내용을 살펴보면 다음과 같은 구조를 확인할 수 있습니다(Cairo가 아닌 파일 제외):
zh_cn: 检查 `dojo-starter` 项目的内容，你会发现其结构如下（不包括非Cairo代码文件）：

source: Dojo projects largely resemble standard Cairo projects, with the distinction being some special attribute tags you use when creating `Components` and `Systems`. Let's explore this next.
ko: Dojo 프로젝트는 표준 Cairo 프로젝트와 대체로 비슷하지만, `Components`와 `Systems`을 생성할 때 사용하는 몇 가지 특수 속성 태그가 다릅니다. 이에 대해 살펴보겠습니다.
zh_cn: Dojo 项目在很大程度上类似于标准的 Cairo 项目，区别在于创建 `组件` 和 `系统` 时使用的一些特殊属性标记。让我们接下来探讨一下。

source: Open the `src/components.cairo` file to continue.
ko: 계속하려면 `src/components.cairo` 파일을 엽니다.
zh_cn: 打开`src/components.cairo`文件以继续。

source: Notice the `#[derive(Component, Copy, Drop, Serde, SerdeLen)]` attributes. For a component to be recognized, we *must* include `Component`. This signals to the Dojo compiler that this struct should be treated as a component.
ko: `#[derive(Component, Copy, Drop, Serde, SerdeLen)]` 어트리뷰트를 주목하세요. 컴포넌트가 인식되려면 `Component`를 반드시 포함해야 합니다. 이것은 Dojo 컴파일러에게 이 구조체를 컴포넌트로 취급해야 한다는 신호를 보냅니다.
zh_cn: 请注意 `#[derive(Component, Copy, Drop, Serde, SerdeLen)]`属性。要识别组件，我们*必须*包含 `Component`。这将向 Dojo 编译器发出信号，表明此结构体应被视为组件。

source: Our `Moves` component houses a `remaining` value in its state. The `#[key]` attribute informs Dojo that this component is indexed by the `player` field. If this is unfamiliar to you, we'll clarify its importance later in the chapter. Essentially, it implies that you can query this component using the `player` field.
ko: `Moves` 컴포넌트에는 `remaining` 값이 그 상태로 들어 있습니다. `#[key]` 속성은 이 컴포넌트가 `player` 필드에 의해 인덱싱된다는 것을 Dojo에 알려줍니다. 이 속성이 익숙하지 않으시다면 이 장의 뒷부분에서 그 중요성을 설명하겠습니다. 기본적으로 `player` 필드를 사용하여 이 컴포넌트를 쿼리할 수 있음을 의미합니다.
zh_cn: 我们的 `Moves` 组件在其状态中包含一个 `remaining` 值。`#[key]` 属性告知 Dojo，该组件是由 `player`字段索引的。如果你对这一点不熟悉，我们将在本章后面的内容中说明它的重要性。从本质上讲，它意味着您可以使用 `player` 字段来查询此组件。

source: In a similar vein, we possess a `Position` component that holds `x` and `y` values. Once again, this component is indexed by the `player` field.
ko: 비슷한 맥락에서 `x`와 `y` 값을 보유하는 `Position` 컴포넌트가 있습니다. 다시 한 번, 이 컴포넌트는 `player` 필드에 의해 인덱싱됩니다.
zh_cn: 同样，我们还拥有一个保存 `x` 和 `y` 值的 `Position` 组件。同样，该组件由 `player` 字段索引。

source: Now, let's examine the `src/systems.cairo` file:
ko: 이제 `src/systems.cairo` 파일을 살펴봅시다:
zh_cn: 现在，让我们检查一下`src/systems.cairo`文件：

source: Let us break this down:
ko: 자세히 살펴보겠습니다:
zh_cn: 让我们来分析一下：

source: Just as we use the `#[derive(Component)]` attribute, the `#[system]` attribute informs the Dojo compiler that this struct is a system, instructing it to compile accordingly.
ko: `#[derive(Component)]` 속성을 사용하는 것처럼, `#[system]` 속성은 Dojo 컴파일러에 이 구조체가 `system` 임을 알려주고 그에 따라 컴파일하도록 지시합니다.
zh_cn: 正如我们使用的 `#[derive(Component)]` 属性一样，`#[system]` 属性通知 Dojo 编译器此结构是一个系统，并指示它进行相应的编译。

source: You'll observe that the system features an `execute` function. It's crucial to note that all Dojo systems necessitate an `execute` function. This function accepts a `Context` as its parameter. The `Context` is a distinct struct that provides information about the world and the caller.
ko: 시스템에 `execute` 기능이 있는 것을 볼 수 있습니다. 모든 Dojo 시스템에는 `execute` 함수가 필요하다는 점에 유의하는 것이 중요합니다. 이 함수는 `Context`를 매개변수로 받습니다. `Context`는 세계와 호출자에 대한 정보를 제공하는 별개의 구조체입니다.
zh_cn: 您会发现该系统有一个 `execute` 函数。需要注意的是，所有 Dojo 系统都需要一个 `execute` 函数。该函数接受一个 `Context` 作为参数。`Context`（上下文） 是一个独特的结构，它提供了关于世界和调用者的信息。

source: It's worth mentioning that a system can contain more than just the `execute` function. You're free to include numerous functions as needed. However, the `execute` function is mandatory since it's invoked when your system is executed.
ko: 시스템에는 `execute` 함수만 포함할 수 있는 것이 아니라는 점을 언급할 필요가 있습니다. 필요에 따라 다양한 함수를 자유롭게 포함할 수 있습니다. 그러나 `execute` 함수는 시스템이 실행될 때 호출되므로 필수입니다.
zh_cn: 值得一提的是，一个系统可以不仅仅包含 `execute` 函数。您可以根据需要自由添加多个函数。不过，`execute` 函数是必须的，因为系统执行时会调用它。

source: Now lets look at the next line:
ko: 이제 다음 줄을 살펴보겠습니다:
zh_cn: 现在让我们看看下一行：

source: Here we use `get!` [command](./commands.md) to retrieve the `Position` component for the `ctx.origin` entity. `ctx.origin` is the address of the caller. When called for the first time, it will return:
ko: 여기서는 `get!` [command](./commands.md)를 사용하여 `ctx.origin` 엔티티에 대한 `Position` 구성 요소를 검색합니다. `ctx.origin`은 호출자의 주소입니다. 처음 호출되면 다음과 같이 반환됩니다:
zh_cn: 在这里，我们使用 `get!` [命令](./commands.md) 来获取 `ctx.origin` 实体的 `Position` 组件。`ctx.origin` 是调用者的地址。第一次调用时，它将返回：

source: Here we use the `set!` [command](./commands.md) to set the `Moves` and `Position` components for the `ctx.origin` entity.
ko: 여기서는 `set!` [command](./commands.md)를 사용하여 `ctx.origin` 엔티티에 대한 `Moves` 및 `Position` 구성 요소를 설정합니다.
zh_cn: 这里我们使用 `set!` [命令](./commands.md) 为 `ctx.origin` 实体设置`Moves`和`Position`组件。

source: - Explained the anatomy of a Dojo project - Explained the importace of the `#[derive(Component)]` and `#[system]` attribute - Explained the `execute` function - Explained the `Context` struct - Touched on the `get!` and `set!` commands
ko: - Dojo 프로젝트의 구조에 대해 설명했습니다 - `#[derive(Component)]`와 `#[system]` 속성의 중요성에 대해 설명했습니다 - `execute` 함수에 대한 설명 - `Context`구조체 설명 - `get!` 및 `set!` 명령어에 대해 설명했습니다
zh_cn: - 解释了 Dojo 项目的解剖结构 - 解释 `#[derive(Component)]`和 `#[system]`属性的含义 - 解释了 `execute` 函数 - 解释了 `Context` 结构 - 介绍了 `get!` 和 `set!` 命令

source: Now that we have some theory out of the way, lets build the Dojo project!
ko: 몇 가지 이론을 정리해 보았으니, 이제 Dojo 프로젝트를 만들어 보겠습니다.
zh_cn: 既然我们已经掌握了一些理论知识，那就来构建 Dojo 项目吧！

source: Now lets deploy it to [Katana](../toolchain/katana/overview.md)! First we need to get Katana running:
ko: 이제 [Katana](../toolchain/katana/overview.md)에 배포해 보겠습니다! 먼저 Katana를 실행해야 합니다:
zh_cn: 现在，让我们将其部署到 [Katana](../toolchain/katana/overview.md) 中！首先，我们需要让 Katana 运行：

source: Success! [Katana](../toolchain/katana/overview.md) should now be running locally on your machine. Now lets deploy!
ko: 성공! 이제 [Katana](../toolchain/katana/overview.md)가 머신에서 로컬로 실행되고 있을 것입니다. 이제 배포해 봅시다!
zh_cn: 成功！现在，[Katana](../toolchain/katana/overview.md)应已在本地计算机上运行。现在开始部署！

source: Your 🌎 is now deployed at `0x71b95a2c000545624c51813444b57dbcdcc153dfc79b6b0e3a9a536168d1e16`!
ko: 🌎는 이제 `0x71b95a2c000545624c51813444b57dbcdcc153dfc79b6b0e3a9a536168d1e16`에 배포되었습니다!

source: Let's discuss the `Scarb.toml` file in the project. This file contains environment variables that make running CLI commands in your project a breeze. (Read more about it [here](./config.md)).
ko: 프로젝트의 `Scarb.toml` 파일에 대해 설명하겠습니다. 이 파일에는 프로젝트에서 CLI 명령을 쉽게 실행할 수 있는 환경 변수가 포함되어 있습니다. (자세한 내용은 [여기](./config.md) 참조).
zh_cn: 让我们讨论一下项目中的 `Scarb.toml` 文件。该文件包含环境变量，可使在项目中运行 CLI 命令变得轻而易举。(点击[此处](./config.md)了解更多信息）。

source: Add the world address to the bottom of the file:
ko: 파일 하단에 월드 주소를 추가합니다:
zh_cn: 在文件底部添加世界地址：

source: This establishes the world address for your project. You can then run commands like:
ko: 이렇게 하면 프로젝트의 월드 주소가 설정됩니다. 그런 다음, 다음과 같은 명령을 실행할 수 있습니다:
zh_cn: 这样就为项目建立了世界地址。然后就可以运行以下命令：

source: By doing so, you've just activated the spawn system. You now have a local world that you can interact with.
ko: 이렇게 하면 spawn 시스템을 활성화한 것입니다. 이제 상호작용할 수 있는 로컬 월드가 생겼습니다.
zh_cn: 这样就激活了产卵系统。现在你有了一个可以互动的本地世界。

source: With your local world set up, let's delve into indexing. You can index the entire world with this simple command:
ko: 로컬 월드가 설정되었으니 이제 인덱싱에 대해 자세히 알아봅시다. 이 간단한 명령으로 전체 월드를 인덱싱할 수 있습니다:
zh_cn: 设置好本地世界后，让我们来深入研究索引。你可以用这个简单的命令为整个世界建立索引：

source: Executing the above activates a local torii server using SQLite as its database, which is exposed at `http://0.0.0.0:8080`. It will automatically index your world into tables, allowing you to query them using GraphQL.
ko: 위의 명령어를 실행하면 `http://0.0.0.0:8080`에 노출된 SQLite를 데이터베이스로 사용하는 로컬 torii 서버가 활성화됩니다. 이 서버는 자동으로 월드를 테이블로 인덱싱하여 GraphQL을 사용하여 쿼리할 수 있도록 합니다.
zh_cn: 执行上述操作可激活本地 torii 服务器，使用 SQLite 作为其数据库，数据库地址为 `http://0.0.0.0:8080`。它会自动将你的世界索引到表中，允许你使用 GraphQL 查询。

source: We've covered quite a bit! Here's a recap:
ko: 꽤 많은 내용을 다루었습니다! 요약하면 다음과 같습니다:
zh_cn: 我们已经讲了很多！下面我们来回顾一下：
