Repository: dojoengine/book
Catalog: po/*.po
Languages: es, ko, zh_cn

source: `component` is used to interact with a World's components. It is useful for querying about a component's information, or a component value of an entity.
es: `component` se utiliza para interactuar con los componentes de un World. Es útil para consultar sobre la información de un componente o el valor de un componente de una entidad.
ko: `component`는 월드의 컴포넌트와 상호작용하는 데 사용됩니다. 컴포넌트의 정보나 엔티티의 컴포넌트 값을 쿼리할 때 유용합니다.
zh_cn: `component`用于与世界的组件进行交互。它可用于查询组件信息或实体的组件值。

source: Get the class hash of a component
es: Obtener el class hash de un componente
ko: 컴포넌트의 클래스 해시 가져오기
zh_cn: 获取组件的Class Hash

source: _`NAME`_ &nbsp;&nbsp;&nbsp;&nbsp;The name of the component
es: _`NAME`_ &nbsp;&nbsp;&nbsp;&nbsp;El nombre del componente
ko: _`NAME`_ &nbsp;&nbsp;&nbsp;&nbsp;컴포넌트의 이름
zh_cn: _`NAME`_ &nbsp;&nbsp;&nbsp;&nbsp;组件名称

source: Get the component value for an entity
es: Obtener el valor del componente para una entidad
ko: 엔티티의 컴포넌트 값 가져오기
zh_cn: 获取实体的组件值

source: _`NAME`_ &nbsp;&nbsp;&nbsp;&nbsp;The name of the component
es: _`NAME`_ &nbsp;&nbsp;&nbsp;&nbsp;El nombre del componente
ko: _`NAME`_ &nbsp;&nbsp;&nbsp;&nbsp;컴포넌트의 이름
zh_cn: _`NAME`_ &nbsp;&nbsp;&nbsp;&nbsp;组件名称

source: _`KEYS`_ &nbsp;&nbsp;&nbsp;&nbsp;The keys of the entity that you want to query. &nbsp;&nbsp;&nbsp;&nbsp;Comma separated values e.g., 0x12345,0x69420,...
es: _`KEYS`_ &nbsp;&nbsp;&nbsp;&nbsp;Las claves de la entidad que desea consultar. &nbsp;&nbsp;&nbsp;&nbsp;Valores separados por comas, por ejemplo, 0x12345,0x69420,...

source: `events` is used to queries world events.
es: `eventos` se utiliza para consultar eventos de World.
ko: `events`는 월드 이벤트를 쿼리하는 데 사용됩니다.
zh_cn: `events`用于查询世界事件。

source: `auth` is used to manage world authorization.
es: `auth` se utiliza para gestionar la autorización del World.
ko: `auth`은 월드 인증을 관리하는 데 사용됩니다.
zh_cn: `auth` 用于管理世界授权。

source: `katana` is a _blazingly fast_ local Starknet node, designed to support local development with Dojo.
es: `katana` es un nodo local de Starknet _increíblemente rápido_, diseñado para respaldar el desarrollo local con Dojo.
ko: `katana`는 Dojo와 함께 로컬 개발을 지원하기 위해 설계된 _엄청나게 빠른_ 로컬 스타크넷 노드입니다.
zh_cn: `katana` （译者注：katana是日文“刀”的罗马字）是一个速度惊人的本地星网节点，旨在支持使用 Dojo 进行本地开发。

source: ### Features
es: ### Características
ko: ### 특징
zh_cn: ### 功能

source: - [Starknet JSON-RPC v0.3.0](https://github.com/starkware-libs/starknet-specs/tree/v0.3.0) support - Custom methods for manipulating the blockchain states
es: - Soporte [Starknet JSON-RPC v0.3.0](https://github.com/starkware-libs/starknet-specs/tree/v0.3.0) - Métodos personalizados para manipular los estados de blockchain
ko: - [스타크넷 JSON-RPC v0.3.0](https://github.com/starkware-libs/starknet-specs/tree/v0.3.0) 지원 - 블록체인 상태 조작을 위한 사용자 정의 메서드들
zh_cn: - 支持 [Starknet JSON-RPC v0.3.0](https://github.com/starkware-libs/starknet-specs/tree/v0.3.0) - 用于操作区块链状态的自定义方法

source: `katana` binary is available via [`dojoup`](../../getting-started/quick-start.md).
es: El binario `katana` está disponible a través de [`dojoup`](../../getting-started/quick-start.md).
ko: `katana` 바이너리는 [`dojoup`](../../getting-started/quick-start.md)를 통해 사용할 수 있습니다.
zh_cn: `katana`二进制文件可通过 [`dojoup`](../../getting-started/quick-start.md) 获取。

source: ### Installing from source
es: ### Instalando desde la fuente
ko: ### 소스 코드로 부터 설치하기
zh_cn: ### 从源码安装

source: ### Usage
es: ### Uso
ko: ### 사용법
zh_cn: ### 使用方法

source: > 📚 **Reference** > > See the [`katana` Reference](./reference.md) for an in depth reference and documentation on Katana.
es: > 📚 **Referencia** > > Consulte la [`referencia de katana`](./reference.md) para obtener una referencia detallada y documentación sobre Katana.
ko: > 📚 **참조** > > katana에 대한 자세한 참조 및 문서는 [`katana` Reference](./reference.md)를 참조하세요.
zh_cn: > 📚 **参考资料** > > 请参阅 [`katana`参考资料](./reference.md)，了解有关 Katana 的深度参考资料和文档。

source: ## katana reference
es: ## Referencia de katana
zh_cn: ## katana参考资料

source: katana - Create a local testnet node for deploying and testing Starknet smart contracts.
es: katana - Cree un nodo de prueba local para implementar y probar smart contracs de Starknet.
ko: katana - 스타크넷 스마트 컨트랙트를 배포하고 테스트하기 위한 로컬 테스트넷 노드를 생성합니다.
zh_cn: katana - 创建本地测试网节点，用于部署和测试Starknet智能合约。

source: ### DESCRIPTION
es: ### DESCRIPCIÓN
ko: ### 설명
zh_cn: ### 描述

source: Create a local testnet node for deploying and testing Starknet smart contracts. Katana supports deployment and execution of the **new** as well as the **legacy** (Cairo 0) Cairo contracts.
es: Cree un nodo de testnet local para implementar y probar smart contracs de Starknet. Katana apoya el despliegue y ejecución de los contratos **nuevos** y **heredados** (Cairo 0) de Cairo.
ko: 스타크넷 스마트 컨트랙트를 배포하고 테스트하기 위한 로컬 테스트넷 노드를 생성합니다. Katana **새로운** Cairo 컨트랙트뿐만 아니라 **레거시**(Cairo 0) Cairo 컨트랙트의 배포와 실행을 지원합니다.
zh_cn: 创建本地测试网节点，用于部署和测试Starknet智能合约。Katana 支持部署和执行 **新** 以及 **旧**（Cairo 0）Cairo合约。

source: This section covers an extensive list of information about Mining Modes, Supported RPC Methods, Katana flags and their usages. You can run multiple flags at the same time.
es: Esta sección cubre una lista extensa de información sobre modos de minería, métodos RPC admitidos, indicadores de Katana y sus usos. Puede ejecutar varias banderas al mismo tiempo.
ko: 이 섹션에서는 마이닝 모드, 지원되는 RPC 메서드, Katana 플래그와 그 사용법에 대한 광범위한 정보를 다룹니다. 여러 플래그를 동시에 실행할 수 있습니다.
zh_cn: 本节包含有关挖矿模式、支持的 RPC 方法、Katana 标志符及其用法的大量信息。您可以同时运行多个标志符。

source: #### Mining Modes
es: #### Modos de Minería
ko: #### 마이닝 모드
zh_cn: #### 挖矿模式

source: In Katana, mining modes determine how frequent blocks are mined. By default, a new block is automatically mined as soon as a transaction is submitted.
es: En Katana, los modos de minería determinan la frecuencia con la que se extraen los bloques. De forma predeterminada, se extrae automáticamente un nuevo bloque tan pronto como se envía una transacción.
ko: Katana에서는 마이닝 모드에 따라 블록이 채굴되는 빈도가 결정됩니다. 기본적으로 트랜잭션이 제출되는 즉시 새 블록이 자동으로 채굴됩니다.
zh_cn: 在 Katana 中，挖矿模式决定了区块的挖矿频率。默认情况下，一旦有交易提交，就会自动挖出一个新区块。

source: You can switch from the default mining behaviour to interval mining, where a new block is created at a fixed time interval selected by the user. To enable this mode of mining, use the `--block-time <MILLISECONDS>` flag, as demonstrated in the following example.
es: Puede cambiar del comportamiento de minería predeterminado a la minería a intervalos, donde se crea un nuevo bloque en un intervalo de tiempo fijo seleccionado por el usuario. Para habilitar este modo de minería, use el indicador `--block-time <MILLISECONDS>`, como se demuestra en el siguiente ejemplo.
ko: 기본 마이닝 동작에서 사용자가 선택한 고정된 시간 간격으로 새 블록이 생성되는 간격 채굴로 전환할 수 있습니다. 이 채굴 모드를 활성화하려면 다음 예시와 같이 `—block-time <MILLISECONDS>` 플래그를 사용하세요.

source: #### Forking
es: #### Bifurcación

source: Katana supports forking from a Starknet RPC provider. You can configure your node to enable the forking feature by providing a valid RPC provider using the `--rpc-url <URL>` flag., which would initiate Katana to fork the latest block of the provided network. If you would like to fork from a specific block, you can do so using `--fork-block-number <BLOCK_NUMBER>`.
es: Katana admite la bifurcación de un proveedor de RPC de Starknet. Puede configurar su nodo para habilitar la función de bifurcación proporcionando un proveedor RPC válido usando el indicador `--rpc-url <URL>`, lo que iniciaría a Katana a bifurcar el último bloque de la red proporcionada. Si desea bifurcar desde un bloque específico, puede hacerlo usando `--fork-block-number <BLOCK_NUMBER>`.

source: NOTE: This does not allow fetching of historical blocks but only blocks that are mined by Katana. However, support for fetching historical blocks will be added in the future.
es: NOTA: Esto no permite recuperar bloques históricos, sino solo bloques extraídos por Katana. Sin embargo, en el futuro se agregará soporte para recuperar bloques históricos.

source: #### Messaging
es: #### Mensajería

source: Katana also allows users to perform L1 <-> L2 integration using the messaging feature. There are two types of messaging service supported by Katana:
es: Katana también permite a los usuarios realizar la integración L1 <-> L2 utilizando la función de mensajería. Hay dos tipos de servicios de mensajería compatibles con Katana:

source: If configured to _Ethereum_ messaging, Katana will listen/send messages on an Ethereum chain. This type of messaging behaves similar to the canonical Starknet sequencer with the exception that messages from L2 -> L1 will be sent directly to the settlement chain for consumption, instead of having to wait for the corresponding blocks of the messages to be proven on the settlement chain (which in reality would be a very time consuming process).
es: Si está configurado para mensajería _Ethereum_, Katana escuchará/enviará mensajes en una cadena de Ethereum. Este tipo de mensajería se comporta de manera similar al secuenciador canónico de Starknet con la excepción de que los mensajes de L2 -> L1 se enviarán directamente a la cadena de liquidación para su consumo, en lugar de tener que esperar a que los bloques correspondientes de mensajes se prueben en la liquidación. cadena (que en realidad sería un proceso que llevaría mucho tiempo).

source: The _Starknet_ messaging, however, is an experimental feature that allows Katana to listen/send messages on a Starknet chain. It attempts to replicate the behaviour of Ethereum messaging but with a Starknet chain as the settlement layer. This is achieved by having Katana listen to the Starknet chain for new blocks and then sending the messages to the settlement chain for consumption. This is an experimental and opinionated feature, and is not recommended for production use.
es: La mensajería _Starknet_, sin embargo, es una característica experimental que permite a Katana listen/enviar mensajes en una cadena Starknet. Intenta replicar el comportamiento de la mensajería de Ethereum pero con una cadena Starknet como capa de liquidación. Esto se logra haciendo que Katana escuche la cadena Starknet en busca de nuevos bloques y luego envíe los mensajes a la cadena de liquidación para su consumo. Esta es una característica experimental y obstinada, y no se recomienda para uso en producción.

source: The messaging config file is a JSON file that contains the following fields:
es: El archivo de configuración de mensajería es un archivo JSON que contiene los siguientes campos:

source: #### Supported Transport Layers
es: #### Capas de Transporte Admitidas
ko: #### 지원되는 전송 계층
zh_cn: #### 支持的传输层

source: Only HTTP connection is supported at the moment. The server listens on port 5050 by default, but it can be changed by running the following command:
es: Por el momento, solo se admite la conexión HTTP. El servidor escucha en el puerto 5050 de forma predeterminada, pero se puede cambiar ejecutando el siguiente comando:
ko: 현재는 HTTP 연결만 지원됩니다. 서버는 기본적으로 포트 5050에서 수신 대기하지만 다음 명령을 실행하여 변경할 수 있습니다:
zh_cn: 目前只支持 HTTP 连接。服务器默认监听 5050 端口，但可以通过运行以下命令进行更改：

source: #### Starknet Feature Compatibility
es: #### Compatibilidad de Características de Starknet
ko: #### 스타크넷 기능 호환성
zh_cn: #### Starknet功能兼容性

source: ##### Supported Transaction Type
es: ##### Tipo de Transacción Soportada
ko: ##### 지원되는 트랜잭션 유형
zh_cn: ##### 支持的交易类型

source: #### Supported RPC Methods
es: #### Métodos RPC Soportados
ko: #### 지원되는 RPC 매서드
zh_cn: #### 支持的 RPC 方法

source: ##### Starknet Methods
es: ##### Métodos Starknet
ko: ##### 스타크넷 매서드
zh_cn: ##### Starknet方法

source: Katana supports version **v0.3.0** of the Starknet JSON-RPC specifications. The standard methods are based on [this](https://github.com/starkware-libs/starknet-specs/tree/v0.3.0) reference.
es: Katana admite la versión **v0.3.0** de las especificaciones Starknet JSON-RPC. Los métodos estándar se basan en [esta](https://github.com/starkware-libs/starknet-specs/tree/v0.3.0) referencia.
ko: Katana 스타크넷 JSON-RPC 사양의 **v0.3.0** 버전을 지원합니다. 표준 메서드는 [여기](https://github.com/starkware-libs/starknet-specs/tree/v0.3.0)를 기반으로 합니다.
zh_cn: Katana 支持版本**v0.3.0**的星网 JSON-RPC 规范。标准方法基于 [此处](https://github.com/starkware-libs/starknet-specs/tree/v0.3.0) 的参考文献。

source: ##### Custom Methods
es: ##### Métodos Personalizados
ko: ##### 사용자 지정 매서드
zh_cn: ##### 自定义方法

source: Katana provides a convenient set of custom RPC methods to quickly and easily configure the node to suit your testing environment.
es: Katana proporciona un conjunto conveniente de métodos RPC personalizados para configurar rápida y fácilmente el nodo para adaptarlo a su entorno de prueba.
ko: Katana는 테스트 환경에 맞게 노드를 빠르고 쉽게 구성할 수 있는 편리한 사용자 지정 RPC 메서드를 제공합니다.
zh_cn: Katana 提供了一套方便的自定义 RPC 方法，可快速、轻松地配置节点，以适应测试环境。

source: `katana_generateBlock` Mine a new block which includes all currently pending transactions.
es: `katana_generateBlock` Extraiga un nuevo bloque que incluya todas las transacciones actualmente pendientes.
ko: `katana_generateBlock` 현재 보류 중인 모든 트랜잭션을 포함하는 새 블록을 채굴합니다.
zh_cn: `katana_generateBlock` 挖掘一个新区块，其中包括当前所有待处理的交易。

source: `katana_nextBlockTimestamp` Get the time for the next block.
es: `katana_nextBlockTimestamp` Obtenga la hora para el siguiente bloque.
ko: `katana_nextBlockTimestamp` 다음 블록의 시간을 가져옵니다.
zh_cn: `katana_nextBlockTimestamp` 获取下一个区块的时间。

source: `katana_increaseNextBlockTimestamp` Increase the time for the block by a given amount of time, in seconds.
es: `katana_increaseNextBlockTimestamp` Aumenta el tiempo del bloque en una cantidad determinada de tiempo, en segundos.
ko: `katana_increaseNextBlockTimestamp` 블록의 시간을 주어진 시간만큼(초 단위) 늘립니다.
zh_cn: `katana_increaseNextBlockTimestamp` 将区块的时间增加给定的时间量，以秒为单位。

source: `katana_setNextBlockTimestamp` Similar to `katana_increaseNextBlockTimestamp` but takes the exact timestamp that you want in the next block.
es: `katana_setNextBlockTimestamp` Similar a `katana_increaseNextBlockTimestamp` pero toma la marca de tiempo exacta que deseas en el siguiente bloque.
ko: `katana_setNextBlockTimestamp` `katana_increaseNextBlockTimestamp`와 유사하지만 다음 블록에서 원하는 정확한 타임스탬프를 가져옵니다.
zh_cn: `katana_setNextBlockTimestamp` 与 `katana_increaseNextBlockTimestamp` 类似，但会在下一个区块中使用你想要的确切时间戳。

source: `katana_predeployedAccounts` Get the info for all of the predeployed accounts.
es: `katana_predeployedAccounts` Obtenga la información de todas las cuentas previamente implementadas.
ko: `katana_predeployedAccounts` 사전 배포된 모든 계정에 대한 정보를 가져옵니다.
zh_cn: `katana_predeployedAccounts` 获取所有预部署账户的信息。

source: `katana_setStorageAt` Set an exact value of a contract's storage slot.
es: `katana_setStorageAt` Establezca un valor exacto del espacio de almacenamiento de un contrato.
ko: `katana_setStorageAt` 컨트랙트의 스토리지 슬롯의 정확한 값을 설정합니다.
zh_cn: `katana_setStorageAt` 设置合约存储槽中的精确值。

source: `--silent` &nbsp;&nbsp;&nbsp;&nbsp; Don't print anything on startup.
es: `--silent` &nbsp;&nbsp;&nbsp;&nbsp; No imprime nada al inicio.
ko: `—silent` &nbsp;&nbsp;&nbsp;&nbsp; 시작 시 아무 것도 출력하지 않습니다.
zh_cn: `--silent` &nbsp;&nbsp;&nbsp;&nbsp; 启动时不打印任何内容。

source: `--no-mining` &nbsp;&nbsp;&nbsp;&nbsp; Disable auto and interval mining, and mine on demand instead.
es: `--no-mining` &nbsp;&nbsp;&nbsp;&nbsp; Desactive la minería automática y de intervalos y, en su lugar, extraiga según demanda.
ko: `—no-mining` &nbsp;&nbsp;&nbsp;&nbsp; 자동 마이닝 및 간격 마이닝을 비활성화하고 대신 요청에 따라 채굴하는 방식을 사용합니다.
zh_cn: `--no-mining` &nbsp;&nbsp;&nbsp;&nbsp; 禁用自动采矿和间隔采矿，改为按需采矿。

source: `-b, --block-time <MILLISECONDS>` &nbsp;&nbsp;&nbsp;&nbsp; Block time in milliseconds for interval mining.
es: `-b, --block-time <MILLISECONDS>` &nbsp;&nbsp;&nbsp;&nbsp; Tiempo de bloque en milisegundos para minería de intervalos.

source: `--dump-state <PATH>` &nbsp;&nbsp;&nbsp;&nbsp; Dump the state of chain on exit to the given file. &nbsp;&nbsp;&nbsp;&nbsp; If the value is a directory, the state will be written to `<PATH>/state.bin`.
es: `--dump-state <PATH>` &nbsp;&nbsp;&nbsp;&nbsp; Vuelque el estado de la cadena al salir del archivo dado. &nbsp;&nbsp;&nbsp;&nbsp; Si el valor es un directorio, el estado se escribirá en `<PATH>/state.bin`.
ko: `—dump-state <PATH>` &nbsp;&nbsp;&nbsp;&nbsp; 종료 시 체인의 상태를 지정된 파일에 덤프합니다. &nbsp;&nbsp;&nbsp;&nbsp; 값이 디렉터리인 경우 상태는 `<PATH>/state.bin`에 기록됩니다.
zh_cn: `--dump-state <PATH>` &nbsp;&nbsp;&nbsp;&nbsp; 将退出时链的状态转存到给定文件。 &nbsp;&nbsp;&nbsp;&nbsp; 如果值是目录，状态将被写入 `<PATH>/state.bin`。

source: `--load-state <PATH>` &nbsp;&nbsp;&nbsp;&nbsp; Initialize the chain from a previously saved state snapshot.
es: `--load-state <PATH>` &nbsp;&nbsp;&nbsp;&nbsp; Inicialice la cadena a partir de una instantánea de estado previamente guardada.
ko: `—load-state <PATH>` &nbsp;&nbsp;&nbsp;&nbsp; 이전에 저장한 상태 스냅샷에서 체인을 시작합니다.
zh_cn: `--load-state <PATH>` &nbsp;&nbsp;&nbsp;&nbsp;从先前保存的状态快照初始化链。

source: `--rpc-url <URL>` &nbsp;&nbsp;&nbsp;&nbsp; The Starknet RPC provider to fork the network from.
es: `--rpc-url <URL>` &nbsp;&nbsp;&nbsp;&nbsp; El proveedor de Starknet RPC desde el cual bifurcar la red.

source: `--json-log` &nbsp;&nbsp;&nbsp;&nbsp; Output logs in JSON format.
es: `--json-log` &nbsp;&nbsp;&nbsp;&nbsp; Registros de salida en formato JSON.

source: `--fork-block-number <BLOCK_NUMBER>` &nbsp;&nbsp;&nbsp;&nbsp; Fork the network at a specific block.
es: `--fork-block-number <BLOCK_NUMBER>` &nbsp;&nbsp;&nbsp;&nbsp; Bifurca la red en un bloque específico.

source: `--messaging <PATH>` &nbsp;&nbsp;&nbsp;&nbsp; Configure the messaging service to allow Katana to listen/send messages on a settlement chain that can be either Ethereum or another Starknet sequencer (experimental).
es: `--messaging <PATH>` &nbsp;&nbsp;&nbsp;&nbsp; Configure el servicio de mensajería para permitir que Katana escuche/envíe mensajes en una cadena de liquidación que puede ser Ethereum u otro secuenciador Starknet (experimental).

source: `-h, --help` &nbsp;&nbsp;&nbsp;&nbsp; Print help (see a summary with '-h').
es: `-h, --help` &nbsp;&nbsp;&nbsp;&nbsp; Imprimir ayuda (ver un resumen con '-h').
ko: `h, --help` &nbsp;&nbsp;&nbsp;&nbsp; 도움말을 출력합니다('-h' 요약 참조).
zh_cn: `-h, --help` &nbsp;&nbsp;&nbsp;&nbsp; 打印帮助（用"-h "查看摘要）。

source: `-V, --version` &nbsp;&nbsp;&nbsp;&nbsp; Print version information.
es: `-V, --version` &nbsp;&nbsp;&nbsp;&nbsp; Imprimir información de la versión.
ko: `-V, --version` &nbsp;&nbsp;&nbsp;&nbsp;버전 정보를 출력합니다.
zh_cn: `-V, --version` &nbsp;&nbsp;&nbsp;&nbsp; 打印版本信息。

source: #### Server Options
es: #### Opciones del Servidor
ko: #### 서버 옵션
zh_cn: #### 服务器选项

source: `-p, --port <PORT>` &nbsp;&nbsp;&nbsp;&nbsp; Port number to listen on. [default: 5050]
es: `-p, --port <PORT>` &nbsp;&nbsp;&nbsp;&nbsp; Número de puerto para escuchar. [predeterminado: 5050]
ko: `-p, —port <PORT>` &nbsp;&nbsp;&nbsp;&nbsp; 수신할 포트 번호입니다. [기본값: 5050]
zh_cn: `-p, --port <PORT>` &nbsp;&nbsp;&nbsp;&nbsp; 要监听的端口号[默认：5050］。

source: `--host <HOST>` &nbsp;&nbsp;&nbsp;&nbsp; The IP address the server will listen on.
es: `--host <HOST>` &nbsp;&nbsp;&nbsp;&nbsp; La dirección IP en la que escuchará el servidor.
ko: `--host <HOST>` &nbsp;&nbsp;&nbsp;&nbsp; 서버가 수신 대기할 IP 주소입니다.
zh_cn: `--host <HOST>` &nbsp;&nbsp;&nbsp;&nbsp; 服务器监听的 IP 地址。

source: `--seed <SEED>` &nbsp;&nbsp;&nbsp;&nbsp; Specify the seed for randomness of accounts to be predeployed.
es: `--seed <SEED>` &nbsp;&nbsp;&nbsp;&nbsp; Especifique la semilla para la aleatoriedad de las cuentas que se implementarán previamente.
ko: `—seed <SEED>` &nbsp;&nbsp;&nbsp;&nbsp; 사전 배포할 계정의 무작위성을 위한 시드를 지정합니다.
zh_cn: `--seed <SEED>` &nbsp;&nbsp;&nbsp;&nbsp; 指定要预先部署的账户随机性种子。

source: `--accounts <NUM>` &nbsp;&nbsp;&nbsp;&nbsp; Number of pre-funded accounts to generate. [default: 10]
es: `--accounts <NUM>` &nbsp;&nbsp;&nbsp;&nbsp; Número de cuentas prefinanciadas a generar. [predeterminado: 10]
ko: `—accounts<NUM>` &nbsp;&nbsp;&nbsp;&nbsp; 생성할 미리 펀딩된 계정 수입니다. [기본값: 10]
zh_cn: `--accounts <NUM>` &nbsp;&nbsp;&nbsp;&nbsp; 要生成的预注资账户数 [默认值：10]。

source: `--disable-fee` &nbsp;&nbsp;&nbsp;&nbsp; Disable charging fee for transactions.
es: `--disable-fee` &nbsp;&nbsp;&nbsp;&nbsp; Deshabilite el cobro de tarifas por transacciones.
ko: `—disable-fee` &nbsp;&nbsp;&nbsp;&nbsp; 거래 수수료 청구를 비활성화합니다.
zh_cn: `--disable-fee` &nbsp;&nbsp;&nbsp;&nbsp;禁用交易收gas费。

source: #### Environment Options
es: #### Opciones de Entorno
ko: #### 환경 옵션
zh_cn: #### 环境选项

source: `--chain-id <CHAIN_ID>` &nbsp;&nbsp;&nbsp;&nbsp; The chain ID. [default: KATANA]
es: `--chain-id <CHAIN_ID>` &nbsp;&nbsp;&nbsp;&nbsp; La identificación de la cadena. [predeterminado: KATANA]
ko: `--chain-id <CHAIN_ID>` &nbsp;&nbsp;&nbsp;&nbsp; 체인 ID입니다. [기본값: KATANA]
zh_cn: `--chain-id <CHAIN_ID>` &nbsp;&nbsp;&nbsp;&nbsp; 链 ID [默认值：KATANA］。

source: `--gas-price <GAS_PRICE>` &nbsp;&nbsp;&nbsp;&nbsp; The gas price.
es: `--gas-price <GAS_PRICE>` &nbsp;&nbsp;&nbsp;&nbsp; El precio del gas.
ko: `—gas-price <GAS_PRICE>` &nbsp;&nbsp;&nbsp;&nbsp; 가스 가격입니다.
zh_cn: `--gas-price <GAS_PRICE>` &nbsp;&nbsp;&nbsp;&nbsp; Gas价格。

source: `--validate-max-steps <VALIDATE_MAX_STEPS>` &nbsp;&nbsp;&nbsp;&nbsp; The maximum number of steps available for the account validation logic.
es: `--validate-max-steps <VALIDATE_MAX_STEPS>` &nbsp;&nbsp;&nbsp;&nbsp; El número máximo de pasos disponibles para la lógica de validación de la cuenta.
ko: `--validate-max-steps <VALIDATE_MAX_STEPS>` &nbsp;&nbsp;&nbsp;&nbsp; 계정 유효성 검사 로직에 사용할 수 있는 최대 단계 수입니다.
zh_cn: `--validate-max-steps <VALIDATE_MAX_STEPS>` &nbsp;&nbsp;&nbsp;&nbsp; 账户验证逻辑的最大步骤数。

source: `--invoke-max-steps <INVOKE_MAX_STEPS>` &nbsp;&nbsp;&nbsp;&nbsp; The maximum number of steps available for the account execution logic.
es: `--invoke-max-steps <INVOKE_MAX_STEPS>` &nbsp;&nbsp;&nbsp;&nbsp; El número máximo de pasos disponibles para la lógica de ejecución de la cuenta.
ko: `--invoke-max-steps <INVOKE_MAX_STEPS>` &nbsp;&nbsp;&nbsp;&nbsp; 계정 실행 로직에 사용할 수 있는 최대 스텝 수입니다.
zh_cn: `--invoke-max-steps <INVOKE_MAX_STEPS>` &nbsp;&nbsp;&nbsp;&nbsp; 账户执行逻辑的最大步数。

source: ### Shell Completions
es: ### Finalizaciones de Shell
ko: ### 셸 완성
zh_cn: ### Shell 补完

source: `katana` completions shell
es: shell de terminaciones `katana`
ko: `katana` 완성 셸

source: Generates a shell completions script for the given shell.
es: Genera un script de finalización de shell para el shell determinado.
ko: 주어진 셸에 대한 셸 완성 스크립트를 생성합니다.
zh_cn: 为给定的 shell 生成 shell 补完脚本。

source: Supported shells are:
es: Los shells soportados son:
ko: 지원되는 셸은 다음과 같습니다:
zh_cn: 支持的shell有：

source: #### EXAMPLES
es: #### EJEMPLOS
ko: #### 예시
zh_cn: #### 示例

source: Generate shell completions script for `bash` and appends it to a `.bashrc` file:
es: Genere un script de finalización de shell para `bash` y agréguelo a un archivo `.bashrc`:
ko: `bash`에 대한 셸 완성 스크립트를 생성하여 `.bashrc` 파일에 추가합니다:
zh_cn: 为 `bash` 生成 shell 补完脚本，并将其添加到 `.bashrc` 文件中：

source: 1. Create 15 dev accounts and disable transaction fee mechanism
es: 1. Cree 15 cuentas de desarrollo y desactive el mecanismo de tarifas de transacción
ko: 1. 15개의 개발용 계정 생성 및 거래 수수료 메커니즘 비활성화
zh_cn: 1. 创建 15 个开发用账户并禁用交易费机制

source: 2. Set the chain id to `SN_GOERLI` and run the server on port 8545
es: 2. Establezca la identificación de la cadena en `SN_GOERLI` y ejecute el servidor en el puerto 8545
ko: 2. 체인 아이디를 `SN_GOERLI`로 설정하고 포트 8545에서 서버를 실행합니다
zh_cn: 2. 将链 id 设置为 `SN_GOERLI`，并在 8545 端口运行服务器

source: 3. Load previously stored state and dump the state of this session to a file on shutdown
es: 3. Cargue el estado previamente almacenado y vuelque el estado de esta sesión en un archivo al cerrar
ko: 3. 이전에 저장된 상태를 로드하고 종료 시 이 세션의 상태를 파일로 덤프합니다
zh_cn: 3. 加载先前存储的状态，并在网络关闭时将此会话的状态转储到文件中

source: ## Torii - Networking & Indexing
es: ## Torii - Redes e Indexación
ko: ## Torii - 네트워킹 및 인덱싱
zh_cn: ## Torii - 网络和索引
