Repository: dojoengine/book
Catalog: po/*.po
Languages: es, ko, zh_cn

source: To start, let's set up a project to run locally on your machine. From an empty directory, execute:
es: Para comenzar, configuremos un proyecto para que se ejecute localmente en su máquina. Desde un directorio vacío, ejecute:
ko: 먼저 컴퓨터에서 로컬로 실행할 프로젝트를 설정해 보겠습니다. 빈 디렉토리에서 실행합니다:
zh_cn: 首先，让我们建立一个在本地运行的项目。在一个空目录下执行：

source: Congratulations! You now have a local Dojo project. This command creates a `dojo-starter` project in your current directory. It's the ideal starting point for a new project and equips you with everything you need to begin.
es: ¡Felicidades! Ahora tienes un proyecto Dojo local. Este comando crea un proyecto `dojo-starter` en su directorio actual. Es el punto de partida ideal para un nuevo proyecto y te proporciona todo lo que necesitas para empezar.
ko: 축하합니다! 이제 로컬 Dojo 프로젝트가 생겼습니다. 이 명령은 현재 디렉토리에 `dojo-starter` 프로젝트를 만듭니다. 이 프로젝트는 새 프로젝트를 시작하기에 이상적인 시작점이며, 시작하는 데 필요한 모든 것을 갖추고 있습니다.
zh_cn: 恭喜您您现在有了一个本地 Dojo 项目。该命令会在您的当前目录下创建一个 `dojo-starter` 项目。它是新项目的理想起点，为您提供了开始项目所需的一切。

source: #### Anatomy of a Dojo Project
es: #### Anatomía de un proyecto Dojo
ko: #### Dojo 프로젝트 뜯어보기
zh_cn: #### Dojo项目剖析

source: Inspect the contents of the `dojo-starter` project, and you'll notice the following structure (excluding the non-Cairo files):
es: Inspeccione el contenido del proyecto `dojo-starter` y notará la siguiente estructura (excluyendo los archivos que no son de Cairo):

source: Dojo projects bear a strong resemblance to typical Cairo projects. The primary difference is the inclusion of a special attribute tag used to define your data models. In this context, we'll refer to these models as components.
es: Los proyectos de dojo guardan un gran parecido con los proyectos típicos de Cairo. La principal diferencia es la inclusión de una etiqueta de atributo especial que se utiliza para definir sus Models de datos. En este contexto, nos referiremos a estos Models como componentes.

source: As we're crafting an ECS, we'll adhere to the specific terminology associated with Entity Component Systems.
es: Mientras elaboramos un ECS, nos adheriremos a la terminología específica asociada con Entity Component Systems.

source: Open the `src/models.cairo` file to continue.
es: Abra el archivo `src/models.cairo` para continuar.

source: Notice the `#[derive(Model, Copy, Drop, Serde)]` attributes. For a model to be recognized, we _must_ include `Model`. This signals to the Dojo compiler that this struct should be treated as a model.
es: Observe los atributos `#[derive(Model, Copy, Drop, Serde)]`. Para que un Model sea reconocido, _debemos_ incluir `Model`. Esto le indica al compilador Dojo que esta estructura debe tratarse como un Model.

source: Our `Moves` model houses a `player` field. At the same tine, we have the `#[key]` attribute, it informs Dojo that this model is indexed by the `player` field. If this is unfamiliar to you, we'll clarify its importance later in the chapter. Essentially, it implies that you can query this component using the `player` field. Our `Moves` model also contains the `remaining` and `last_direction` fields
es: Nuestro Model `Moves` alberga un campo de`player`. Al mismo tiempo, tenemos el atributo `#[key]`, le informa a Dojo que este Model está indexado por el campo `player`. Si esto no le resulta familiar, aclararemos su importancia más adelante en este capítulo. Esencialmente, implica que puedes consultar este componente usando el campo `player`. Nuestro Model `Moves` también contiene los campos `remaining` y `last_direction`

source: In a similar vein, we have a `Position` component that have a Vec2 data structure. Vec holds `x` and `y` values. Once again, this component is indexed by the `player` field.
es: De manera similar, tenemos un componente `Position` que tiene una estructura de datos Vec2. Vec tiene valores `x` e `y`. Una vez más, este componente está indexado por el campo `player`.

source: Now, let's examine the `src/actions.cairo` file:
es: Ahora, examinemos el archivo `src/actions.cairo`:

source: ### Breaking it down
es: ### Desglosándolo

source: As you can see a `System` is like a dojo(starknet) contract. It imports the Models we defined earlier and exposes two functions `spawn` and `move`. These functions are called when a player spawns into the world and when they move respectively.
es: Como puede ver, un `System` es como un contrato de dojo (starknet). Importa los Models que definimos anteriormente y expone dos funciones `spawn` y `move`. Estas funciones se llaman cuando un jugador aparece en el World y cuando se mueve, respectivamente.

source: Here we use `get!` [command](./commands.md) to retrieve the `Position` and `Moves` model for the `player` entity, which is the address of the caller.
es: Aquí usamos `get!` [comando](./commands.md) para recuperar el Model `Position` y `Moves` para la entidad `player`, que es la dirección de la persona que llama.

source: Now the next line:
es: Ahora la siguiente línea:
ko: 이제 다음 줄입니다:
zh_cn: 现在是下一行：

source: Here we use the `set!` [command](./commands.md) to set the `Moves` and `Position` models for the `player` entity.
es: Aquí usamos el [comando](./commands.md) `set!` para configurar los Models `Moves` y `Position` para la entidad `player`.

source: We covered a lot here in a short time. Let's recap:
es: Cubrimos mucho aquí en poco tiempo. Recapitulemos:
ko: 짧은 시간에 많은 내용을 다루었습니다. 다시 한 번 요약해 보겠습니다:
zh_cn: 在很短的时间内，我们在这里做了很多事情。让我们来回顾一下：

source: - Explained the anatomy of a Dojo project - Explained the importance of the `#[derive(Model)]`attribute - Explained the `execute` function - Explained the `Context` struct - Touched on the `get!` and `set!` commands
es: - Explicó la anatomía de un proyecto Dojo. - Explicó la importancia del atributo `#[derive(Model)]` - Explicó la función `execute`. - Explicó la estructura `Context`. - Se tocaron los comandos `get!` y `set!`

source: ### Run it locally!
es: ### ¡Ejecútalo localmente!
ko: ### 로컬에서 실행
zh_cn: #### 在本地运行！

source: Now that we've covered some theory, let's build the Dojo project! In your primary terminal:
es: Ahora que hemos cubierto algo de teoría, ¡construyamos el proyecto Dojo! En su terminal principal:

source: That compiled the components and system into an artifact that can be deployed! Simple as that!
es: ¡Eso compiló los componentes y el sistema en un artefacto que se puede implementar! ¡Simple como eso!
ko: 컴포넌트와 시스템을 배포할 수 있는 아티팩트로 컴파일했습니다! 아주 간단합니다 :)
zh_cn: 这就把组件和系统编译成了一个可以部署的工件！就这么简单！

source: Now, let's deploy it to [Katana](../toolchain/katana/overview.md)! First, we need to get Katana running. Open a second terminal and execute:
es: ¡Ahora, implementémoslo en [Katana](../toolchain/katana/overview.md)! Primero, necesitamos hacer funcionar a Katana. Abra una segunda terminal y ejecute:

source: Success! [Katana](../toolchain/katana/overview.md) should now be running locally on your machine. Now, let's deploy! In your primary terminal, execute:
es: ¡Éxito! [Katana](../toolchain/katana/overview.md) ahora debería estar ejecutándose localmente en su máquina. ¡Ahora, implementemos! En su terminal principal, ejecute:

source: This will deploy the artifact to [Katana](../toolchain/katana/overview.md). You should see terminal output similar to this:
es: Esto implementará el artefacto en [Katana](../toolchain/katana/overview.md). Deberías ver una salida de terminal similar a esta:
ko: 이렇게 하면 아티팩트가 [Katana](../toolchain/katana/overview.md)에 배포됩니다. 이와 비슷한 터미널 출력이 보일 것입니다:
zh_cn: 这将把工件部署到 [Katana](../toolchain/katana/overview.md) 中。你应该会看到类似下面的终端输出：

source: Your 🌎 is now deployed at `0x1af130f7b9027f3748c1e3b10ca4a82ac836a30ac4f2f84025e83a99a922a0c`!
es: ¡Su 🌎 ahora está implementado en `0x1af130f7b9027f3748c1e3b10ca4a82ac836a30ac4f2f84025e83a99a922a0c`!

source: This establishes the world address for your project.
es: Esto establece la dirección del World de su proyecto.

source: Let's discuss the `Scarb.toml` file in the project. This file contains environment variables that make running CLI commands in your project a breeze. (Read more about it [here](./config.md)). Make sure your file specifies the version of Dojo you have installed!. In this case version `v0.3.0`
es: Analicemos el archivo `Scarb.toml` en el proyecto. Este archivo contiene variables de entorno que facilitan la ejecución de comandos CLI en su proyecto. (Lea más sobre esto [aquí](./config.md)). ¡Asegúrese de que su archivo especifique la versión de Dojo que ha instalado! En este caso versión `v0.3.0`

source: ### Indexing
es: ### Indexación
ko: ### 인덱싱
zh_cn: ### 索引

source: With your local world address established, let's delve into indexing. You can index the entire world. Open a new terminal and input this simple command:
es: Una vez establecida su dirección del World local, profundicemos en la indexación. Puedes indexar el World entero. Abra una nueva terminal e ingrese este simple comando:

source: Running the command mentioned above starts a Torii server on your local machine. This server uses SQLite as its database and is accessible at http://0.0.0.0:8080/graphql. Torii will automatically organize your data into tables, making it easy for you to perform queries using GraphQL. When you run the command, you'll see terminal output that looks something like this:
es: Al ejecutar el comando mencionado anteriormente se inicia un servidor Torii en su máquina local. Este servidor utiliza SQLite como base de datos y se puede acceder a él en http://0.0.0.0:8080/graphql. Torii organizará automáticamente sus datos en tablas, lo que le facilitará realizar consultas utilizando GraphQL. Cuando ejecute el comando, verá una salida de terminal similar a esta:

source: You can observe that our `Moves` and `Position` models have been successfully registered. Next, let's use the GraphiQL IDE to retrieve data from the `Moves` model. In your web browser, navigate to `http://0.0.0.0:8080/graphql`, and enter the following query:
es: Puede observar que nuestros Models `Moves` y `Position` se han registrado correctamente. A continuación, usemos el IDE GraphiQL para recuperar datos del Model `Moves`. En su navegador web, navegue hasta `http://0.0.0.0:8080/graphql` e ingrese la siguiente consulta:

source: After you run the query, you will receive an output like this:
es: Después de ejecutar la consulta, recibirá un resultado como este:

source: Awesome, now let's work with subscriptions to get real-time updates. Let's clean up your workspace on the GraphiQL IDE and input the following subscription:
es: Genial, ahora trabajemos con las suscripciones para obtener actualizaciones en tiempo real. Limpiemos su espacio de trabajo en GraphiQL IDE e ingresemos la siguiente suscripción:

source: Once you execute the subscription, you will receive notifications whenever new entities are updated or created. For now, don't make any changes to it and proceed to create a new entity.
es: Una vez que ejecute la suscripción, recibirá notificaciones cada vez que se actualicen o creen nuevas entidades. Por ahora, no le hagas ningún cambio y procede a crear una nueva entidad.

source: To accomplish this, we have to go back to our primary terminal and check the contracts section.
es: Para ello tenemos que volver a nuestro terminal principal y consultar el apartado de contratos.

source: We have to use `actions` contract address to start to create entities. In your main local terminal, run the following command:
es: Tenemos que usar la dirección del contrato de `actions` para comenzar a crear entidades. En su terminal local principal, ejecute el siguiente comando:

source: By running this command, you've activated the spawn system, resulting in the creation of a new entity. This action establishes a local world that you can interact with.
es: Al ejecutar este comando, ha activado el sistema de generación, lo que resulta en la creación de una nueva entidad. Esta acción establece un World local con el que puedes interactuar.

source: Now, go back to your GraphiQL IDE, and you will notice that you have received the subscription's results, which should look something like this:
es: Ahora, regrese a su IDE GraphiQL y notará que ha recibido los resultados de la suscripción, que deberían verse así:

source: In the GraphiQL IDE, by clicking the `DOCS`-button on the right, you can open the API documentation. This documentation is auto-generated based on our schema definition and displays all API operations and data types of our schema.. In order to know more about query and subscription, you can jump to [GraphQL](../toolchain/torii/graphql.md) section. We've covered quite a bit! Here's a recap:
es: En GraphiQL IDE, al hacer clic en el botón `DOCS` a la derecha, puede abrir la documentación de la API. Esta documentación se genera automáticamente en función de nuestra definición de esquema y muestra todas las operaciones API y tipos de datos de nuestro esquema. Para saber más sobre consultas y suscripción, puede ir a [GraphQL](../toolchain/torii/graphql .md) sección. ¡Hemos cubierto bastante! Aquí hay un resumen:

source: - Built a Dojo world - Deployed the project to Katana - Indexed the world with Torii - Ran the spawn system locally - Interacted with GraphQL
es: - Construyó un World en Dojo - Implementé el proyecto en Katana. - Indexado el World con Torii. - Ejecuté el sistema de generación localmente. - Interactuado con GraphQL

source: ### Next Steps
es: ### Próximos pasos
ko: ### 다음 단계
zh_cn: ### 接下来的步骤

source: This overview provides a rapid end-to-end glimpse into Dojo. However, the potential of these worlds is vast! Designed to manage hundreds of systems and components, Dojo is equipped for expansive creativity. So, what will you craft next?
es: Esta descripción general proporciona una visión rápida de principio a fin de Dojo. Sin embargo, ¡El potencial de estos Worlds es enorme! Diseñado para gestionar cientos de Systems y componentes, Dojo está equipado para una creatividad expansiva. Entonces, ¿qué vas a crear a continuación?
ko: 이 개요는 Dojo에 대한 간략한 개요를 제공합니다. 하지만 이 월드의 잠재력은 무궁무진합니다! 수백 개의 시스템과 구성 요소를 관리할 수 있도록 설계된 Dojo는 무한한 창의력을 발휘할 수 있는 환경을 갖추고 있습니다. 그렇다면 다음에는 무엇을 제작할까요?
zh_cn: 本概述仅仅提供了一个对 Dojo 端到端的快速了解。然而，这些世界的潜力是巨大的！Dojo 被设计为用于管理数百个系统和组件，可发挥无限的创造力。那么，您下一步将制作什么呢？

source: ## Entities
es: ## Entidades
ko: ## 엔티티(Entities)
zh_cn: ## 实体

source: > Entities are the primary key value within the world, to which components can be attached.
es: > Las entidades son el valor clave principal dentro del World, al que se pueden adjuntar componentes.
ko: > 엔티티는 월드 내에서 컴포넌트들로 이루어진 기본 키 값입니다.
zh_cn: > 实体是世界中的主要关键值，组件可以附加到实体上。

source: Different ECS systems handle entities in various ways. In Dojo, entities are treated as a primary key value within the world, to which components can be attached. To illustrate this concept, consider a simple example of a character in a game that has a `Moves` and a `Position` component.
es: Los diferentes Systems ECS manejan entidades de diversas maneras. En Dojo, las entidades se tratan como un valor de clave principal dentro del World, al que se pueden adjuntar componentes. Para ilustrar este concepto, considere un ejemplo simple de un personaje en un juego que tiene un componente `Moves` y `Position`.
ko: 각기 다른 ECS 시스템은 다양한 방식으로 엔티티를 처리합니다. Dojo에서 엔티티는 컴포넌트들을 붙일 수 있는 월드 내 기본 키 값으로 취급됩니다. 이 개념을 설명하기 위해 게임 속 캐릭터에 `Moves`와 `Position` 컴포넌트가 있는 간단한 예를 생각해 보겠습니다.
zh_cn: 不同的 ECS 系统处理实体的方式各不相同。在 Dojo 中，实体被视为世界中的一个主键值，可以附加组件。为了说明这一概念，请看一个简单的例子：游戏中的角色有一个 `Moves` 和一个 `Position`组件。

source: When defining the components for this entity, it is important to note that we do not reference the entity directly. Instead, we simply provide two structs that the entity will contain.
es: Al definir los componentes de esta entidad, es importante tener en cuenta que no hacemos referencia a la entidad directamente. En lugar de eso, simplemente proporcionamos dos estructuras que contendrá la entidad.
ko: 이 엔티티의 컴포넌트를 정의할 때 엔티티를 직접 참조하지 않는다는 점에 유의하는 것이 중요합니다. 대신 엔티티에 포함될 두 개의 구조체를 제공하기만 하면 됩니다.
zh_cn: 在定义该实体的组件时，需要注意的是，我们并不直接引用该实体。相反，我们只是提供了实体将包含的两个结构。这种方法强调了 ECS 系统的灵活性和可组合性，允许轻松创建和修改具有各种组件组合的实体。

source: Now, let's create a `Spawn` for the character. It is important to note that we have not explicitly defined an Entity anywhere. Instead, we use the `ctx.origin` to reference the current entity.
es: Ahora, creemos un `Spawn` para el personaje. Es importante tener en cuenta que no hemos definido explícitamente una Entidad en ninguna parte. En su lugar, usamos `ctx.origin` para hacer referencia a la entidad actual.
ko: 이제 캐릭터에 대한 `Spawn`을 생성해 봅시다. 여기서는 엔티티를 명시적으로 정의하지 않았다는 점에 유의해야 합니다. 대신 `ctx.origin`을 사용하여 현재 엔티티를 참조합니다.
zh_cn: 现在，让我们为角色创建一个 `Spawn`。需要注意的是，我们没有在任何地方明确定义实体。相反，我们使用 `ctx.origin` 来引用当前实体。

source: In this example we are using the `ctx.origin` to reference the current entity.
es: En este ejemplo estamos usando `ctx.origin` para hacer referencia a la entidad actual.
ko: 이 예제에서는 현재 엔티티를 참조하기 위해 `ctx.origin`을 사용하고 있습니다.
zh_cn: 在本例中，我们使用 `ctx.origin` 来引用当前实体。

source: > ECS Theory: Plenty has been written on ECS systems, to go deeper read [ECS-FAQ](https://github.com/SanderMertens/ecs-faq)
es: > Teoría de ECS: Se ha escrito mucho sobre los Systems ECS; para profundizar, lea [ECS-FAQ](https://github.com/SanderMertens/ecs-faq)
ko: > ECS 이론: ECS 시스템에 대한 자세한 내용은 [ECS-FAQ](https://github.com/SanderMertens/ecs-faq)를 참조하십시오
zh_cn: > ECS 理论：关于 ECS 系统的文章很多，如需深入了解，请阅读 [ECS-FAQ](https://github.com/SanderMertens/ecs-faq)

source: Testing is a crucial part of any software development process. Dojo provides a testing framework that allows you to write tests for your smart contracts. Since Dojo uses a custom compiler, you need to use `sozo` to test your contracts.
es: Las pruebas son una parte crucial de cualquier proceso de desarrollo de software. Dojo proporciona un marco de prueba que le permite escribir pruebas para sus smart contract. Dado que Dojo usa un compilador personalizado, necesitas usar `sozo` para probar tus contratos.
ko: 테스트는 모든 소프트웨어 개발 프로세스에서 중요한 부분입니다. Dojo는 스마트 컨트랙트에 대한 테스트를 작성할 수 있는 테스트 프레임워크를 제공합니다. Dojo는 커스텀 컴파일러를 사용하기 때문에 컨트랙트를 테스트하려면 `sozo`를 사용해야 합니다.
zh_cn: 测试在任何软件开发过程中都是重要组成部分。Dojo 提供了一个测试框架，允许您为智能合约编写测试。由于 Dojo 使用自定义编译器，因此您需要使用 `sozo` 来测试您的合约。

source: From your project directory, simply:
es: Desde el directorio de su proyecto, simplemente:
ko: 프로젝트 디렉토리에서 간단히 실행할 수 있습니다:
zh_cn: 在项目目录中，只需：

source: This will search for all tests within your project and run them.
es: Esto buscará todas las pruebas dentro de su proyecto y las ejecutará.
ko: 프로젝트 내의 모든 테스트를 검색하여 실행합니다.
zh_cn: 这将搜索项目中的所有测试并运行它们。

source: ### Writing Unit Tests
es: ### Escritura de Tests Unitarios
ko: ### 유닛 테스트 작성
zh_cn: ### 编写单元测试

source: It is best practise to include unit tests in the same file as the model/System you are writing.
es: Se recomienda incluir pruebas unitarias en el mismo archivo que el Model/Sistema que está escribiendo.

source: Lets show a `model` test example from the [dojo-starter](https://github.com/dojoengine/dojo-starter):
es: Mostremos un ejemplo de test de `model` de [dojo-starter] (https://github.com/dojoengine/dojo-starter):

source: In this test we are testing the `is_zero` and `is_equal` functions of the `Position` model. It is good practise to test all functions of your models.
es: En esta prueba estamos probando las funciones `is_zero` y `is_equal` del Model `Position`. Es una buena práctica probar todas las funciones de sus Models.

source: ### Writing Integration Tests
es: ### Redacción de Tests de Integración
ko: ### 통합 테스트 작성하기
zh_cn: ### 编写集成测试

source: Integration tests are e2e tests that test the entire system. You can write integration tests for your world by creating a `tests` directory in your project root. Then create a file for each integration test you want to write.
es: Los tests de integración son tests e2e que prueban todo el sistema. Puede escribir pruebas de integración para su World creando un directorio `tests` en la raíz de su proyecto. Luego cree un archivo para cada prueba de integración que desee escribir.
ko: 통합 테스트는 전체 시스템을 테스트하는 e2e 테스트입니다. 프로젝트 루트에서 `tests` 디렉토리를 생성하여 월드에 대한 통합 테스트를 작성할 수 있습니다. 그런 다음 작성하려는 각 통합 테스트에 대한 파일을 만듭니다.
zh_cn: 集成测试是测试整个系统的 e2e 测试。您可以在项目根目录下创建一个 `tests` 目录，为您的世界编写集成测试。然后为要编写的每个集成测试创建一个文件。

source: This is the example from the [dojo-starter](https://github.com/dojoengine/dojo-starter):
es: Este es el ejemplo de [dojo-starter](https://github.com/dojoengine/dojo-starter):
ko: [dojo-starter](https://github.com/dojoengine/dojo-starter)의 예제입니다:
zh_cn: 这是来自 [dojo-starter](https://github.com/dojoengine/dojo-starter): 的示例：

source: #### Useful Dojo Test Functions
es: #### Funciones útiles de Test de Dojo
ko: #### 유용한 Dojo 테스트 함수들
zh_cn: #### 有用的 Dojo 测试函数

source: `spawn_test_world(models, systems)` - This function will create a test world with the models and systems you pass in. It will also deploy the world and register the models and systems.
es: `spawn_test_world(models, systems)`: esta función creará un World de prueba con los Models y Systems que ingrese. También implementará el World y registrará los Models y Systems.

source: ## Dojo Modules
es: ## Módulos Dojo
ko: ## Dojo 모듈
zh_cn: ## Dojo 的模块

source: With standardization of Systems and Components we can create a module architecture for Dojo. This allows us to create reusable modules that can be used in any Dojo world.
es: Con la estandarización de Systems y Componentes podemos crear una arquitectura de módulo para Dojo. Esto nos permite crear módulos reutilizables que se pueden usar en cualquier World Dojo.
ko: 시스템과 구성 요소의 표준화를 통해 Dojo를 위한 모듈 아키텍처를 만들 수 있습니다. 이를 통해 모든 Dojo 월드에서 사용할 수 있는 재사용 가능한 모듈을 만들 수 있습니다.
zh_cn: 通过系统和组件的标准化，我们可以为 Dojo 创建一个模块架构。这样，我们就可以创建可在任何 Dojo 世界中使用的可重用模块。

source: ### Module Architecture
es: ### Arquitectura del Módulo
ko: ### 모듈 아키텍처
zh_cn: ### 模块架构

source: Think of modules as ERCs for Dojo. They are a standard way to create and share functionality. Modules are a collection of Systems and Components that can be imported into a Dojo world. Dojo is following the ERC patterns and has modules already defined for ERC20, ERC721, and ERC1155.
es: Piense en los módulos como ERC para Dojo. Son una forma estándar de crear y compartir funciones. Los módulos son una colección de Systems y componentes que se pueden importar a un World Dojo. Dojo sigue los patrones de ERC y ya tiene módulos definidos para ERC20, ERC721 y ERC1155.
ko: 모듈을 Dojo의 ERC라고 생각하세요. 모듈은 기능을 만들고 공유하는 표준 방법입니다. 모듈은 Dojo 월드로 가져올 수 있는 시스템과 컴포넌트의 모음입니다. Dojo는 ERC 패턴을 따르고 있으며 ERC20, ERC721, ERC1155에 대한 모듈이 이미 정의되어 있습니다.
zh_cn: 我们可将模块视为 Dojo 的 ERC。它们是创建和共享功能的标准方式。模块是可导入 Dojo 世界的系统和组件的集合。Dojo 遵循 ERC 模式，并已经为 ERC20、ERC721 和 ERC1155 定义了模块。

source: Dojo's ERC20 module is a standard implementation of the ERC20 token standard, but it utilizes Dojo Systems and Components. This allows us to leverage the excellent properties of the ERC20 standard and use it natively within the Dojo environment.
es: El módulo ERC20 de Dojo es una implementación estándar del estándar de token ERC20, pero utiliza Systems y componentes de Dojo. Esto nos permite aprovechar las excelentes propiedades del estándar ERC20 y utilizarlo de forma nativa dentro del entorno Dojo.
ko: Dojo의 ERC20 모듈은 ERC20 토큰의 표준 구현이지만, Dojo 시스템 및 구성 요소를 활용합니다. 이를 통해 ERC20 표준의 우수한 특성을 활용하고 Dojo 환경 내에서 기본적으로 사용할 수 있습니다.
zh_cn: Dojo 的 ERC20 模块是 ERC20 token标准的标准实现，但它使用了 Dojo 系统和组件。这使我们能够利用 ERC20 标准的出色特性，并在 Dojo 环境中使用它。

source: ### Integration into Your World
es: ### Integración en Tu World
ko: ### 월드에 통합하기
zh_cn: ### 集成到你的世界
