Repository: dojoengine/book
Catalog: po/*.po
Languages: es, ko, zh_cn

source: Or, by using a single Cargo command:
es: O bien, utilizando un solo comando de Cargo:
ko: 또는 단일 Cargo 명령을 사용하여:
zh_cn: 或者，使用一条Cargo命令：

source: Or, by manually building from a local copy of the [Dojo repository](https://github.com/dojoengine/dojo):
es: O bien, construyendo manualmente desde una copia local del [repositorio de Dojo](https://github.com/dojoengine/dojo):
ko: 또는 [Dojo repository](https://github.com/dojoengine/dojo)의 로컬 복사본에서 수동으로 빌드할 수 있습니다:
zh_cn: 或者从本地的 [Dojo repository](https://github.com/dojoengine/dojo) 拷贝中手动构建：

source: # Development Setup
es: # Configuración de Desarrollo
ko: # 개발환경 설정
zh_cn: # 开发设置

source: > This article is a guide to setting up a development environment for Dojo. It is not suggested to follow this guide if you are just wanting to play with the toolchain. We strongly suggest following the [Quick Start](../getting-started/quick-start.md) guide.
es: > Este artículo es una guía para configurar un entorno de desarrollo para Dojo. No se sugiere seguir esta guía si sólo quieres jugar con la cadena de herramientas. Sugerimos encarecidamente seguir la guía [Quick Start](../getting-started/quick-start.md).
ko: > 이 문서는 Dojo의 개발 환경 설정에 대한 안내서입니다. 단순히 툴체인만 사용하고자 하는 경우 이 가이드를 따르지 않는 것이 좋습니다. [빠른 시작](../getting-started/quick-start.md) 가이드를 따르는 것을 강력히 권장합니다.
zh_cn: > 本文是为 Dojo 设置开发环境的指南。如果您只是想试试工具链，则不建议遵循本指南。我们强烈建议您阅读 [快速入门](../getting-started/quick-start.md)指南。

source: ### Prerequisites
es: #### Requisitos Previos
ko: ### 전제 조건
zh_cn: ### 先决条件

source: ## Guide
es: ## Guía
ko: ## 가이드
zh_cn: ## 指引

source: ### Clone
es: ### Clonar
ko: ### 복사

source: #### 1. Install Rust and Dependencies
es: #### 1. Instalar Rust y Dependencias
ko: #### 1. Rust 및 종속성 설치
zh_cn: #### 1. 安装 Rust 和依赖

source: Start by installing Rust and running the test suite to confirm your setup:
es: Comienza instalando Rust y ejecutando el conjunto de pruebas para confirmar la configuración:
ko: 먼저 Rust를 설치하고 테스트를 실행하여 설정이 정확한지 확인합니다:
zh_cn: 首先安装 Rust 并运行测试套件来确认你的安装是否成功：

source: > Note: Depending on your Linux distribution, you may need to install additional dependencies. Make sure to install any suggested or missing dependencies that arise during the setup process.
es: > Nota: Dependiendo de la distribución de Linux que estés usando, es posible que necesites instalar dependencias adicionales. Asegúrate de instalar todas las dependencias sugeridas o faltantes que surjan durante el proceso de configuración.
ko: > 참고: Linux 배포판에 따라 추가 종속성을 설치해야 할 수도 있습니다. 설치 과정에서 제안되거나 누락된 종속성이 있으면 반드시 설치하세요.
zh_cn: > 注意：根据您的 Linux 发行版，您可能需要安装其他依赖项。请确保你安装了在设置过程中出现的任何建议的或缺失的依赖项。

source: #### 2. Install Scarb Package Manager
es: #### 2. Instalar el Administrador de Paquetes Scarb
ko: #### 2. Scarb 패키지 관리자 설치
zh_cn: #### 2. 安装 Scarb 软件包管理器

source: Next, install the [Scarb](https://docs.swmansion.com/scarb) package manager by running:
es: Luego, instala el gestor de paquetes [Scarb](https://docs.swmansion.com/scarb) ejecutando el siguiente comando:
ko: 다음으로 [Scarb](https://docs.swmansion.com/scarb) 패키지 관리자를 실행하여 설치합니다:
zh_cn: 接下来，通过运行如下命令来进行 [Scarb](https://docs.swmansion.com/scarb) 软件包管理器的安装：

source: #### 3. Add the Cairo 1.0 VSCode Extension
es: #### 3. Configura la extensión de Cairo para VSCode
ko: #### 3. Cairo 1.0 VSCode 확장 추가하기
zh_cn: #### 3. 添加 Cairo 1.0 VSCode 扩展

source: Install the [Cairo 1.0](https://marketplace.visualstudio.com/items?itemName=starkware.cairo1) extension for Visual Studio Code.
es: Instale la extensión [Cairo 1.0](https://marketplace.visualstudio.com/items?itemName=starkware.cairo1) para Visual Studio Code.
ko: Visual Studio Code용 [Cairo 1.0](https://marketplace.visualstudio.com/items?itemName=starkware.cairo1) 확장 프로그램을 설치합니다.
zh_cn: 安装 Visual Studio Code 的 [Cairo 1.0](https://marketplace.visualstudio.com/items?itemName=starkware.cairo1) 扩展。

source: _Coming soon_
es: _Próximamente_
zh_cn: 即将推出

source: ### Container
es: ### Contenedor
zh_cn: ### 容器

source: # Contributing to the Core
es: # Contribuyendo al Core
ko: # 기여하기
zh_cn: # 为核心做出贡献

source: Dojo is an open-source project, currently in its early development phase, and warmly welcomes contributors.
es: Dojo es un proyecto de open-source, actualmente en su fase inicial de desarrollo, y da una calurosa bienvenida a los colaboradores.
ko: Dojo는 현재 초기 개발 단계에 있는 오픈소스 프로젝트로, 기여자를 적극 환영합니다.
zh_cn: > Dojo 是一个开源项目，目前处于早期开发阶段并热忱的欢迎贡献者们。

source: ## How to Contribute
es: ### Formas de Contribuir
ko: ## 기여 방법
zh_cn: ## 如何贡献

source: Head to the [Github](https://github.com/dojoengine/dojo/issues) for open issues, if you see an issue that is unassigned, please request in the comments to be assigned to it. If you have an idea for a new feature, please create an issue with the `enhancement` tag.
es: Dirígete a [Github](https://github.com/dojoengine/dojo/issues) para ver las incidencias abiertas, si ves una incidencia que no está asignada, por favor solicita en los comentarios que te la asignen. Si tienes una idea para una nueva funcionalidad, crea una incidencia con la etiqueta `enhancement`.
ko: [깃허브](https://github.com/dojoengine/dojo/issues)에서 이슈들를 확인하고, 할당되지 않은 이슈가 있으면 댓글로 요청하여 할당받으세요. 새로운 기능에 대한 아이디어가 있다면 `enhancement` 태그와 함께 이슈를 생성해 주세요.
zh_cn: 请前往 [Github](https://github.com/dojoengine/dojo/issues) 查看open状态的的issue，如果你看到一个未分配的issue，请在评论中申请将它分配给你。如果你有关于新功能的想法，请创建一个带有 `enhancement` 标签的issue。

source: ## Get Started
es: ## Primeros Pasos
ko: ## 시작하기
zh_cn: ## 开始加入社区

source: > You should have a good understanding of Cairo before proceeding. If you're unfamiliar with Cairo, we recommend you read the [Cairo documentation](https://book.cairo-lang.org/title-page.html) first.
es: > Debe tener un buen conocimiento de Cairo antes de continuar. Si no está familiarizado con El Cairo, le recomendamos que lea primero la [documentación de El Cairo] (https://book.cairo-lang.org/title-page.html).

source: ## A New Approach to Game Development
es: ## Un Nuevo Enfoque Para el Desarrollo de Juegos

source: Dojo provides an advanced abstraction layer over Cairo, mirroring React's relationship with JavaScript. Its specialized architecture simplifies game design and development. By leveraging Dojo, developers can use succinct commands that transform into comprehensive queries at compile time. This chapter delves deeper into Dojo's unique architecture.
es: Dojo proporciona una capa de abstracción avanzada sobre Cairo, reflejando la relación de React con JavaScript. Su arquitectura especializada simplifica el diseño y desarrollo de juegos. Al aprovechar Dojo, los desarrolladores pueden utilizar comandos concisos que se transforman en consultas completas en tiempo de compilación. Este capítulo profundiza en la arquitectura única de Dojo.

source: #### Delving into the Architecture
es: #### Profundizando en la Arquitectura

source: Dojo efficiently encapsulates boilerplate contracts within the compiler, letting developers concentrate on the distinct aspects of their game or app.
es: Dojo encapsula de manera eficiente contratos repetitivos dentro del compilador, lo que permite a los desarrolladores concentrarse en los distintos aspectos de su juego o aplicación.

source: Consider this as the most basic Dojo world setup:
es: Considere esto como la configuración de un World Dojo más básica:

source: While seemingly simple, behind the scenes Dojo generates foundational contracts, setting the stage for you to focus purely on data and logic.
es: Si bien parece simple, detrás de escena, Dojo genera contratos fundamentales, preparando el escenario para que usted se concentre únicamente en los datos y la lógica.

source: Lets take a look at the `main.cairo`:
es: Echemos un vistazo al `main.cairo`:

source: ### Breakdown
es: ### Descomponer

source: This just a regular Cairo contract, with some specifics.
es: Este es sólo un contrato normal y corriente de Cairo, con algunos detalles.

source: #### `Position` struct
es: #### Estructura `Position`

source: In a Dojo world, state is defined using models. These are structs marked with the `#[derive(Model)]` attribute, functioning similarly to a keypair store. The primary key for a model is indicated using the `#[key]` attribute; for instance, the `player` field serves as the primary key in this context.
es: En un World Dojo, el estado se define mediante Models. Estas son estructuras marcadas con el atributo `#[derive(Model)]`, que funcionan de manera similar a un almacén de pares de claves. La clave principal de un Model se indica mediante el atributo `#[key]`; por ejemplo, el campo `player` sirve como clave principal en este contexto.

source: Read more about models [here](./models.md).
es: Lea más sobre los Models [aquí](./models.md).

source: #### `spawn` function - a dojo system
es: #### Función `spawn`- Un sistema dojo

source: In the `spawn` function, take note of the second parameter: the `IWorldDispatcher` interface. This provides a gateway to the world contract. By integrating it into the function, it enables the `get!` and `set!` macros to interface directly with the world contract.
es: En la función `spawn`, tome nota del segundo parámetro: la interfaz `IWorldDispatcher`. Esto proporciona una puerta de entrada al contrato de World. Al integrarlo en la función, permite que las macros `get!` y `set!` interactúen directamente con el contrato World.

source: Commands, a significant innovation in Dojo, are further explored [here](./commands.md).
es: Los comandos, una innovación significativa en Dojo, se exploran más a fondo [aquí](./commands.md).

source: #### `#[storage]` attribute
es: #### Atributo `#[storage]`

source: You will notice there is no storage in the contract. This is because the storage is in the world contract. You can however use this attribute to store data in the System contract itself, but we suggest you use the world contract for storage.
es: Notarás que no hay almacenamiento en el contrato. Esto se debe a que el almacenamiento está en el contrato del World. Sin embargo, puede utilizar este atributo para almacenar datos en el contrato del sistema, pero le sugerimos que utilice el contrato de World para el almacenamiento.

source: ### High level transaction flow of a world
es: ### Flujo de transacciones de alto nivel de un World

source: To call a Dojo world you invoke a system, which then calls the [world](./world.md) and does the necessary state changes.
es: Para llamar a un World Dojo, se invoca un sistema, que luego llama al [World](./world.md) y realiza los cambios de estado necesarios.

source: > **To think about:** Consider Autonomous Worlds as sovereign blockchains residing within another blockchain - a nested blockchain, so to speak. Just as you can deploy contracts onto Ethereum to enhance its functionality, you can similarly introduce systems into the World contract to enrich its features. While anyone can contribute to the World, akin to Ethereum, authorization is required to interact with model state. There is a dedicated topic to [Authorisation](./authorization.md).
es: > **Para pensar:** Considere los Autonomous Worlds como cadenas de bloques soberanas que residen dentro de otra cadena de bloques: una cadena de bloques anidada, por así decirlo. Así como puedes implementar contratos en Ethereum para mejorar su funcionalidad, también puedes introducir Systems en el contrato del World para enriquecer sus características. Si bien cualquiera puede contribuir al World, al igual que Ethereum, se requiere autorización para interactuar con el estado Model. Hay un tema dedicado a [Autorización](./autorización.md).

source: ## The World Contract
es: ## El Contrato del World

source: The world contract functions as a central store for the world models and systems. Every contract that interacts with the world, must use the world contract address as the first parameter. This is how the world contract is able to manage the state of the world.
es: El contrato del World funciona como un almacén central para los Models y Systems mundiales. Todo contrato que interactúe con el World debe utilizar la dirección del contrato World como primer parámetro. Así es como el contrato del World puede gestionar el estado del World.

source: Although we suggest strongly to structure your world around an ECS pattern you are not required to do so. You can simply use the dojo-models as a keypair store along with the supporting infrastructure.
es: Aunque sugerimos encarecidamente estructurar su World en torno a un patrón ECS, no está obligado a hacerlo. Simplemente puede utilizar los Models dojo como almacén de pares de claves junto con la infraestructura de soporte.

source: > Dojo core abstracts the world contract away, you do not write it and it is not meant to be altered when building a world. However, it's important to understand how it works and how it interacts with the rest of the system.
es: > El núcleo del Dojo abstrae el contrato World, no lo escribes y no debe modificarse al construir un World. Sin embargo, es importante comprender cómo funciona y cómo interactúa con el resto del sistema.

source: ### The `uuid()` command
es: ### El comando `uuid()`
ko: ### `uuid()` 명령어
zh_cn: ### `uuid()`命令

source: It is often useful to generate unique IDs for entities. The `uuid()` fn can be used to generate a unique ID.
es: A menudo es útil generar IDs únicos para las entidades. La función `uuid()` puede utilizarse para generar un ID único.
ko: 엔티티의 고유 ID를 생성하는 것이 유용한 경우가 많습니다. `uuid()` 함수를 사용하여 고유 ID를 생성할 수 있습니다.
zh_cn: 为实体生成唯一 ID 通常很有用。`uuid()` 函数可用来生成唯一 ID。

source: Use it like this:
es: Úsalo así:
ko: 이렇게 사용하세요:
zh_cn: 像这样使用它：

source: ### Full World API
es: ### Full API World
ko: ### 전체 월드 API
zh_cn: ### 完整的世界API

source: The world exposes an interface which can be interacted with by any client.
es: El World expone una interfaz con la que puede interactuar cualquier cliente.
ko: 월드에는 모든 클라이언트가 상호 작용할 수 있는 인터페이스가 노출됩니다.
zh_cn: 世界公开了一个接口，任何客户端都可以与之交互。

source: > **IMPORTANT:** Before defining your systems, prioritize permissions. Plan carefully to ensure proper access and security.
es: > **IMPORTANTE:** Antes de definir sus Systems, priorice los permisos. Planifique cuidadosamente para garantizar el acceso y la seguridad adecuados.

source: - Systems function as contract methods. - Contracts containing Systems gain permissions to write to models. - Systems pass a `world` address as their first parameter unless utilizing the [`#[dojo::contract]`](#the-dojocontract-decorator) decorator. - Systems engage the world contract to alter models' state. - The world contract is invoked through systems. - Systems ought to be concise and specific. - In most scenarios, systems are stateless.
es: - Los Systems funcionan como métodos de contrato. - Los contratos que contienen Systems obtienen permisos para escribir en Models. - Los Systems pasan una dirección `world` como primer parámetro a menos que utilicen el decorador [`#[dojo::contract]`](#the-dojocontract-decorator). - Los Systems participan en el contrato World para alterar el estado de los Models. - El contrato World se invoca a través de Systems. - Los Systems deben ser concisos y específicos. - En la mayoría de los escenarios, los Systems no tienen estado.

source: ### What are Systems?
es: ### ¿Qué son los Systems?

source: Within dojo we define systems as functions within a Contract that act on the world.
es: Dentro del dojo definimos Systems como funciones dentro de un Contrato que actúan sobre el World.

source: Systems play a pivotal role in your world's logic, directly mutating its component states. It's important to understand that to enact these mutations, a system needs explicit permission from the [`models`](./models.md) owner.
es: Los Systems desempeñan un papel fundamental en la lógica de su World, mutando directamente los estados que lo componen. Es importante comprender que para implementar estas mutaciones, un sistema necesita un permiso explícito del propietario de [`models`](./models.md).

source: ### System Permissions
es: ### Permisos del Sistema

source: Since the whole contract is giving write access to the model, it is important to be careful when defining systems. A simple way to think about it is:
es: Dado que todo el contrato otorga acceso de escritura al Model, es importante tener cuidado al definir los Systems. Una forma sencilla de pensarlo es:

source: System Permissions
es: Permisos del Sistema

source: ### System Structure
es: ### Estructura del Sistema

source: Every system function starts with a [`world`](./world.md) address as its initial parameter. This design permits these functions to alter the world's state. Notably, this structure also makes systems adaptable and reusable across multiple worlds!
es: Cada función del sistema comienza con una dirección [`world`](./world.md) como parámetro inicial. Este diseño permite que estas funciones alteren el estado del World. En particular, esta estructura también hace que los Systems sean adaptables y reutilizables en múltiples Worlds

source: Let's look at the simplest possible system which mutates the state of the `Moves` component.
es: Veamos el sistema más simple posible que muta el estado del componente `Moves`.
ko: `Moves` 컴포넌트의 상태를 변경하는 가장 간단한 시스템을 살펴봅시다.
zh_cn: 让我们来看一个最简单的系统，它可以改变 `Moves` 组件的状态。

source: ## Breaking it down
es: ## Descomponiéndolo

source: #### System is a contract
es: #### El Sistema es un contrato

source: As you can see a System is like a regular Starknet contract. It can include storage, and it can implement interfaces.
es: Como puede ver, un sistema es como un contrato normal de Starknet. Puede incluir almacenamiento y puede implementar interfaces.

source: #### `Spawn` function
es: #### Función `Spawn`

source: The spawn function is currently the only function that exists in this system. It is called when a player spawns into the world. It is responsible for setting up the player's initial state.
es: La función de spawn es actualmente la única función que existe en este sistema. Se llama cuando un jugador aparece en el World. Es responsable de configurar el estado inicial del jugador.

source: ### The `#[dojo::contract]` Decorator
es: ### El Decorador `# [dojo :: contract]`

source: All StarkNet contracts are defined using the `#[starknet::contract]` decorator, ensuring accurate compilation. In this context, Dojo introduces the `#[dojo::contract]` decorator, which aims to minimize boilerplate in contract writing. It’s imperative to acknowledge that utilizing this decorator is entirely optional.
es: Todos los contratos de StarkNet se definen utilizando el decorador `#[starknet::contract]`, lo que garantiza una compilación precisa. En este contexto, Dojo presenta el decorador `#[dojo::contract]`, cuyo objetivo es minimizar el texto repetitivo en la redacción del contrato. Es imperativo reconocer que utilizar este decorador es completamente opcional.

source: The `#[dojo::contract]` decorator allows developers to omit including `world: IWorldDispatcher` as a parameter. Behind the scenes, it injects the world into the contract and eliminates some imports, thereby streamlining the development process.
es: El decorador `#[dojo::contract]` permite a los desarrolladores omitir incluir `world: IWorldDispatcher` como parámetro. Entre bastidores, inyecta el World en el contrato y elimina algunas importaciones, agilizando así el proceso de desarrollo.

source: > To interact with Systems read more in the [sozo](../toolchain/sozo/overview.md) docs.
es: > Para interactuar con los Systems, lea más en los documentos [sozo](../toolchain/sozo/overview.md).

source: - Models store structured data in your world. - Models are Cairo structs with additional features. - Models can implement traits. - Use the `#[derive(Model)]` decorator to define them. - Custom enums and types are supported. - Define the primary key using the `#[key]` attribute.
es: - Los Models almacenan datos estructurados en tu World. - Los Models son estructuras de Cairo con características adicionales. - Los Models pueden implementar traits. - Utilice el decorador `#[derive(Model)]` para definirlos. - Se admiten enumeraciones y tipos personalizados. - Defina la clave principal utilizando el atributo `#[key]`.

source: ### Models are Structs
es: ### Los Models son Structs

source: Models are structs annotated with the `#[derive(Model)]` attribute. Consider these models as a key-value store, where the `#[key]` attribute is utilized to define the primary key. While models can contain any number of fields, adhering to best practices in Entity-Component-System (ECS) design involves maintaining small, isolated models. This approach fosters modularity and composability, enabling you to reuse models across various entity types.
es: Los Models son estructuras anotadas con el atributo `#[derive(Model)]`. Considere estos Models como un almacén de valores clave, donde el atributo `#[key]` se utiliza para definir la clave principal. Si bien los Models pueden contener cualquier cantidad de campos, cumplir con las mejores prácticas en el Entity Component System (ECS) implica mantener Models pequeños y aislados. Este enfoque fomenta la modularidad y la componibilidad, lo que le permite reutilizar Models en varios tipos de entidades.

source: #### The #[key] attribute
es: #### El atributo #[key]
ko: #### #[key] 속성
zh_cn: #### #[key]属性

source: The `#[key]` attribute indicates to Dojo that this model is indexed by the `player` field. You need to define a key for each model, as this is how you query the model. However, you can create composite keys by defining multiple fields as keys.
es: El atributo `#[key]` indica a Dojo que este Model está indexado por el campo `player`. Debe definir una clave para cada Model, ya que así es como se consulta el Model. Sin embargo, puede crear claves compuestas definiendo varios campos como claves.

source: In this case you then would set the model with both the player and location fields:
es: En este caso, entonces configurarías el Model con los campos de jugador y de ubicación:

source: #### Implementing Traits
es: #### Implementación de Traits
ko: #### 특성 구현하기
zh_cn: #### 实现Trait

source: Models can implement traits. This is useful for defining common functionality across models. For example, you may want to define a `Position` model that implements a `PositionTrait` trait. This trait could define functions such as `is_zero` and `is_equal` which could be used when accessing the model.
es: Los Models pueden implementar traits. Esto es útil para definir una funcionalidad común entre Models. Por ejemplo, es posible que desee definir un Model `Position` que implemente un traits `PositionTrait`. Este traits podría definir funciones como `is_zero` y `is_equal` que podrían usarse al acceder al Model.

source: #### Custom Setting models
es: #### Models de Configuración Personalizada

source: Suppose we need a place to keep a global value with the flexibility to modify it in the future. Take, for instance, a global `combat_cool_down` parameter that defines the duration required for an entity to be primed for another attack. To achieve this, we can craft a model dedicated to storing this value, while also allowing for its modification via a decentralized governance model.
es: Supongamos que necesitamos un lugar para mantener un valor global con la flexibilidad de modificarlo en el futuro. Tomemos, por ejemplo, un parámetro global `combat_cool_down` que define la duración requerida para que una entidad esté preparada para otro ataque. Para lograr esto, podemos diseñar un Model dedicado a almacenar este valor y al mismo tiempo permitir su modificación a través de un Model de gobernanza descentralizada.
