Repository: dojoengine/book
Catalog: po/*.po
Languages: es, ko, zh_cn

source: Dojo is engineered for rapid development, boasting a lightning-fast local development environment named [Katana](./toolchain/katana/overview.md). Katana serves as an on-device Starknet blockchain, allowing you to rigorously test your smart contracts before transitioning them to the a remote testnet.
ko: Dojo는 빠른 개발을 위해 설계되었으며, [Katana](./toolchain/katana/overview.md)라는 초고속 로컬 개발 환경을 지원합니다. Katana는 온디바이스 스타크넷 블록체인의 역할을 하며, 스마트 컨트랙트를 테스트넷으로 배포하기 전에 Katana에서 테스트할 수 있습니다.
zh_cn: Dojo 专为快速开发而设计，拥有一个名为 [Katana](./toolchain/katana/overview.md)的快如闪电的本地开发环境。Katana 可作为设备上的Starknet区块链，允许您在将智能合约迁移到远程测试网络之前对其进行严格测试。

source: [Madara](https://github.com/keep-starknet-strange/madara) is a blazinly fast Starknet sequencer. Built on the robust Substrate framework and fast, thanks to Rust 🦀, Madara delivers unmatched performance and scalability to power your Starknet-based Validity Rollup chain.
ko: [Madara](https://github.com/keep-starknet-strange/madara)는 엄청나게 빠른 스타크넷 시퀀서입니다. 견고한 Substrate 프레임워크에 구축되었으며, Rust 🦀 덕분에 빠른 속도를 자랑하는 Madara는 스타크넷 기반 유효성 롤업 체인을 구동할 수 있는 탁월한 성능과 확장성을 제공합니다.
zh_cn: [Madara](https://github.com/keep-starknet-strange/madara)是一款高速Starknet排序器。Madara 基于强大的 Substrate 框架构建，由于采用了 Rust 🦀，因此速度极快，可提供无与伦比的性能和可扩展性，为您的基于Starknet的Validity Rollup链（译者注：如通常意义上的appchain）提供动力。

source: **Testnet RPC:** https://api.cartridge.gg/x/shinai/madara
ko: **테스트넷 RPC:** https://api.cartridge.gg/x/shinai/madara

source: 1. A system to spawn all the chess pieces 2. A system to make pieces move 3. Add some functions to check a legal move 4. Play chess ♟♙ - integration test!
ko: 1. 모든 체스 말 생성 시스템 2. 기물의 움직임을 만드는 시스템 3. 합법적인 이동을 확인하는 몇 가지 기능 추가 4. 체스 플레이 - 통합 테스트!
zh_cn: 1. 生成所有棋子的系统 2. 让棋子移动的系统 3. 加入检查移动合法性的函数 4. 下棋 ♟♙ - 集成测试！

source: The full code of tutorial is based on [this repo](https://github.com/rkdud007/chess-dojo/tree/tutorialv2).
ko: 튜토리얼의 전체 코드는 [이 리포지토리](https://github.com/rkdud007/chess-dojo/tree/tutorialv2)를 기반으로 합니다.
zh_cn: 教程的完整代码基于 [这个仓库](https://github.com/rkdud007/chess-dojo/tree/tutorialv2)。

source: After you finish all the five chapters, we can move on to the frontend guide.
ko: 5개의 챕터를 모두 완료한 후에는 프론트엔드 가이드로 넘어갈 수 있습니다.
zh_cn: 完成全部五章后，我们就可以继续学习前端指南了。

source: The project comes with a lot of boilerplate codes. Clear it all. Make sure both `components.cairo` and `systems.cairo` files are empty.
ko: 이 프로젝트에는 많은 기본 템플릿 코드가 포함되어 있습니다. 프로젝트에서 필요하지 않습니다, 모두 지우세요. `components.cairo`와 `systems.cairo` 파일이 모두 비어 있는지 확인합니다.
zh_cn: 该项目带有大量模板代码。请全部清除。确保 `components.cairo` 和 `systems.cairo` 文件为空。

source: In `lib.cairo`, retain only:
ko: `lib.cairo`에서는 다음의 코드만 유지 합니다:
zh_cn: 在`lib.cairo`中，仅保留：

source: First, add this basic component to `components.cairo` file. If you are not familar with component syntax in Dojo engine, go back to this [chapter](../../cairo/components.md).
ko: 먼저 이 기본 컴포넌트를 `components.cairo` 파일에 추가합니다. Dojo 엔진의 컴포넌트 구문에 익숙하지 않다면 이 [챕터](../../cairo/components.md)로 돌아가세요.
zh_cn: 首先，将这个基本组件添加到`components.cairo`文件中。如果你不熟悉 Dojo 引擎中的组件语法，请回顾这个 [章节](../../cairo/components.md).。

source: Starting from the next chapter, you will implement `initiate` and `move` systems one in each chapter. Let's create each system in its own file for better modularity.
ko: 다음 챕터부터는 각 챕터에서 `initiate`과 `move` 시스템을 하나씩 구현할 것입니다. 모듈성을 높이기 위해 각 시스템을 자체 파일로 만들어 보겠습니다.
zh_cn: 从下一章节开始，您将在每一章节中依次实现 `initiate` 和 `move` 系统。为了更好地实现模块化，我们会在单独的文件中创建每个系统。

source: Create a `systems` folder at `src`. Create `initiate.cairo`and `move.cairo` two files inside the folder. Each file should contain a basic system structure.
ko: `src`에 `systems` 폴더를 생성합니다. 폴더 안에 `initiate.cairo`와 `move.cairo` 두 개의 파일을 생성합니다. 각 파일에는 기본적인 시스템 구조가 포함되어야 합니다.
zh_cn: 在 `src` 创建一个 `systems` 文件夹。在文件夹内创建 `initiate.cairo` 和 `move.cairo` 两个文件。每个文件都应包含一个基本的系统结构。

source: For example, `initiate.cairo` look like this:
ko: 예를 들어 `initiate.cairo`는 다음과 같습니다:
zh_cn: 例如，`initiate.cairo` 看起来像这样：

source: and in `systems.cairo` we will use `initiate_system` like this:
ko: `systems.cairo`에서는 `initiate_system`을 다음과 같이 사용합니다:
zh_cn: 在 `systems.cairo` 中，我们将这样使用 `initiate_system`：

source: Do the same with the other systems. Update `systems.cairo` to:
ko: 다른 시스템에서도 동일하게 수행합니다. `systems.cairo`를 다음과 같이 업데이트합니다:
zh_cn: 对其他系统执行同样操作。更新 `systems.cairo` 为：

source: Great! then let's solve this error.
ko: 좋습니다! 그럼 이 오류를 해결해 보겠습니다.
zh_cn: 很好！那就让我们来解决这个错误吧。

source: One thing you have to make sure is, that `<Option<PieceType>>` is the type that we created. So this type does not implement basic traits like SerdeLen. You need to define the implementation by your own.
ko: `<Option<PieceType>>`은 우리가 만든 타입입니다. 따라서 이 타입은 SerdeLen과 같은 기본 특성을 가지지 않습니다. 여러분이 직접 정의해야 합니다.
zh_cn: 必须明确的一点是，`<Option<PieceType>>` 是我们创建的类型。因此，该类型没有实现 SerdeLen 等基本traits。你需要自己定义实现。

source: Fix other issues as above, so that you can run the `sozo build` command runs successfully.
ko: 위와 같이 다른 문제를 수정하여 `sozo build` 명령이 성공적으로 실행될 수 있도록 합니다.
zh_cn: 修复上述其他问题，以便成功运行 `sozo build` 命令。

source: ## Run test
ko: ## 테스트 실행
zh_cn: ## 运行测试

source: For the no implementation error, implement the PrintTrait to run sozo test successfully. For the not dropped error, add the Drop trait. Address other errors by adding derives or implementing them on a case-by-case basis.
ko: no implementation 에러의 경우 PrintTrait을 구현하여 sozo test를 성공적으로 실행합니다. not dropped 에러의 경우 Drop 특성을 추가합니다. 다른 오류는 파생 요소를 추가하거나 직접 구현하여 해결합니다.
zh_cn: 对于`no implementation`错误，请实现 `PrintTrait` 以成功运行 `sozo test`。对于`not dropped`错误，添加 `Drop` trait。其他错误可通过添加派生或实现来逐一解决。

source: ## Add more components
ko: ## 더 많은 컴포넌트 추가하기
zh_cn: ## 添加更多组件

source: Before you move on, add more components so we can use them in the next chapter when creating systems.
ko: 계속 진행하기 전에 다음 장에서 시스템을 만들 때 사용할 수 있도록 더 많은 컴포넌트를 추가하세요.
zh_cn: 在继续之前，请添加更多组件，以便在下一章创建系统时使用。

source: - `Color` enum enum with values White and Black - `Game` component:
ko: - 값이 흰색과 검은색인 `Color` enum - `Game` 컴포넌트:
zh_cn: - 具有白色和黑色值的 `Color` 枚举 - `Game`组件：

source: - `GameTurn` component:
ko: - `GameTurn` 컴포넌트:
zh_cn: - `GameTurn`组件：

source: - We will later set game entity composed of the `Game` and `GameTurn` components. - Run `sozo build` and `sozo test` and ensure all tests pass.
ko: - `Game`과 `GameTurn` 컴포넌트로 구성된 게임 엔티티를 설정합니다. - `sozo build`와 `sozo test`를 실행하고 모든 테스트가 통과했는지 확인합니다.
zh_cn: - 稍后我们将设置由 `Game` 和 `GameTurn` 组件组成的游戏实体。 - 运行 `sozo build` 和 `sozo test` 并确保所有测试通过。

source: Try to solve on your own, and before you move on check the answer below.
ko: 스스로 도전해보고, 다음 장으로 넘어가기 전에 아래의 답을 확인하세요.
zh_cn: 在进行下一步之前，请试着自己解题并对照下面的答案。

source: <details> <summary>Click to see full `components.cairo` code</summary>
ko: <details> <summary>전체 `components.cairo` 코드를 보려면 클릭하세요</summary>
zh_cn: <details> <summary>点击查看完整的 `components.cairo` 代码</summary>

source: # 1. Initiate System
ko: # 1. 시작 시스템
zh_cn: # 1. 初始化系统

source: This chapter will address implementing `initiate_system`, which spawns the game and squares containing pieces.
ko: 이 장에서는 게임과 기물이 들어있는 보드 사각을 생성하는 `initiate_system`을 구현하는 방법을 다룹니다.
zh_cn: 本章将讨论 `initiate_system` 的实现，它将生成游戏和包含棋子的方格。

source: ## What is `initiate_system`?
ko: ## `initiate_system`이란 무엇인가요?
zh_cn: ## 什么是`initiate_system`？

source: To play chess, you need to start the game and spawn the pieces. `initiate_system` will spawn the game entity and then place each piece in its proper position. Ensure the game status matches the correct piece type, and the right piece color is in its designated position on the board.
ko: 체스를 플레이하려면 게임을 시작하고 말들을 스폰해야 합니다. `initiate_system`은 게임 엔티티를 스폰한 다음 각 말을 적절한 위치에 배치합니다. 게임 상태가 올바른 말 종류와 일치하는지, 올바른 말 색상이 보드의 지정된 위치에 있는지 확인합니다.
zh_cn: 要下棋，您需要开始游戏并生成棋子。`initiate_system` 会生成游戏实体，然后将每个棋子放置在适当的位置。确保游戏状态与正确的棋子类型相匹配，并且正确颜色的棋子位于棋盘上的指定位置。

source: _Copy the unit tests below and paste them at the bottom of your `systems/initiate.cairo` file._
ko: 아래의 단위 테스트를 복사하여 `systems/initiate.cairo` 파일 하단에 붙여넣습니다
zh_cn: _复制下面的单元测试，并将其粘贴到 `systems/initiate.cairo`文件的底部_

source: 1. Write an `execute` function in the system that accepts the world context, white address, and black address as input. 2. Implement the game entity, comprised of the `Game` component and `GameTurn` component we created in the previous step. 3. Implement square entities by `Square` component, from a1 to h8 containing the correct `PieceType`. 4. Run `sozo test` and pass all the tests.
ko: 1. 시스템에서 월드 컨텍스트, 흰색 계정, 검은색 계정를 입력으로 받아들이는 `execute` 함수를 작성합니다. 2. 이전 단계에서 만든 `Game` 컴포넌트와 `GameTurn` 컴포넌트로 구성된 게임 엔티티를 구현합니다. 3. 정사각형(Square) 엔티티를 올바른 `PieceType`을 포함하는 a1부터 h8까지 `Square` 컴포넌트로 구현합니다. 4. `sozo test`를 실행하고 모든 테스트를 통과합니다.
zh_cn: 1. 在系统中编写一个 `execute`函数接受world context， white address， 以及 black address 作为输入。 2. 实现由我们上一步骤里创建的 `Game` 和 `GameTurn` 组件组成的游戏实体。 3. 在`Square`组件中实现方格实体，从a1到a8并包含正确的`PieceType`。 4. 运行 `sozo test` 并通过所有测试。

source: ## Test Flow
ko: ## 테스트 흐름
zh_cn: ## 测试流程

source: - Spawn the test world that imports the components and systems used in testing. - Execute `initiate_system` by providing white and black player's wallet addresses as inputs. - Retrieve the game entity and piece entity created during `initiate_system`. - Ensure the game has been correctly created. - Verify that each `Piece` is located in the correct `Square`.
ko: - 테스트에 사용되는 컴포넌트와 시스템을 가져오는 테스트 월드를 생성합니다. - 화이트 플레이어와 블랙 플레이어의 지갑 주소를 입력으로 제공하여 `initiate_system`을 실행합니다. - `Initiate_system` 중에 생성된 게임 엔티티와 조각 엔티티를 가져옵니다. - 게임이 올바르게 생성되었는지 확인합니다. - 각 `Piece`가 올바른 `Square`에 있는지 확인합니다.
zh_cn: - 生成测试世界并导入测试中使用的组件和系统。 - 提供黑白玩家的钱包地址作为输入来执行`initiate_system`。 - 获取`initiate_system`过程中创建的游戏实体以及棋子实体。 - 确保游戏已正确创建。 - 确认每个`Piece` 都放在正确的`Square`上。

source: You can find the [answer](https://github.com/rkdud007/chess-dojo/blob/tutorialv2/src/systems/initiate.cairo) for chapter 1 here.
ko: 1장에 대한 [정답](https://github.com/rkdud007/chess-dojo/blob/tutorialv2/src/systems/initiate.cairo)은 여기에서 확인할 수 있습니다.
zh_cn: 您可以在这里找到第 1 章的 [答案](https://github.com/rkdud007/chess-dojo/blob/tutorialv2/src/systems/initiate.cairo)。

source: # 2. Move System
ko: # 2. 이동 시스템
zh_cn: # Move系统

source: This chapter will address the implementation of `move_system`, which relocates a piece on the board.
ko: 이 장에서는 보드에서 말을 이동시키는 `move_system`의 구현에 대해 설명합니다.
zh_cn: 本章将讨论`move_system`的实现，它用于在棋盘上重新定位棋子。

source: ## What is `move_system`?
ko: ## `move_system`이란 무엇인가요?
zh_cn: ## `move_system` 是什么？

source: To play chess, one must move the pieces on the board. Since we represent piece locations with a Square entity, the `move_system` retrieves the current position as (x,y). It also fetches the next position as (x,y), treating the piece in the current position square as the target to be moved to the next position.
ko: 체스를 두려면 체스판의 말들을 움직여야 합니다. 말의 위치를 정사각형 엔티티로 표현하기 때문에 `move_system`은 현재 위치를 (x,y)로 검색합니다. 또한 다음 위치를 (x,y)로 가져와 현재 위치 정사각형에 있는 말을 다음 위치로 이동해야 할 대상으로 취급합니다.
zh_cn: 下棋时，玩家必须移动棋盘上的棋子。由于我们用Square实体来表示棋子的位置，因此 `move_system` 会以 (x,y) 的形式获取当前位置。它还会以 (x,y) 的形式获取下一个位置，并将当前位置方格中的棋子视为要移动到下一个位置的目标。

source: _Copy the unit tests below and paste them at the bottom of your `systems/move.cairo` file._
ko: _아래의 단위 테스트를 복사하여 `systems/move.cairo` 파일 하단에 붙여넣습니다_
zh_cn: _复制下面的单元测试，并将其粘贴到`systems/move.cairo`文件的底部。_

source: 1. Write an `execute` function in the system with the following inputs:
ko: 1. 시스템에서 `execute` 함수를 작성하고 다음을 인풋값으로 부여합니다:
zh_cn: 1. 在系统中编写一个`execute`函数，输入如下内容：

source: 2. Update the Square with the `next_position` to contain the new piece and ensure the Square with the `curr_position` no longer holds a piece. 3. Run `sozo test` and ensure all tests pass.
ko: 2. `next_position`이 있는 정사각형을 새 조각을 포함하도록 업데이트하고 `curr_position`이 있는 정사각형에 더 이상 조각이 들어 있지 않은지 확인합니다. 3. `sozo test`를 실행하고 모든 테스트가 통과되었는지 확인합니다.
zh_cn: 2. 更新带有 `next_position` 的方格，使其包含新棋子，并确保带有 `curr_position` 的方格不再包含棋子。 3. 运行 `sozo test` 并确保所有测试通过。

source: - Follow the same logic as `test_initiate` from the previous chapter. - Move the White Knight from (1,0) to (2,2) using the `move_system`. - Retrieve the updated position and verify that the piece has successfully moved to its new location.
ko: - 이전 장의 `test_initiate`와 동일한 논리를 따릅니다. - `move_system`을 사용하여 흰색 나이트를 (1,0)에서 (2,2)로 이동합니다. - 업데이트된 위치를 검색하고 밀이 새 위치로 성공적으로 이동했는지 확인합니다.
zh_cn: - 跟随上一章中`test_initiate`的逻辑。 - 通过`move_system`把White Knight从(1,0) 移动到 (2,2) - 获取更新之后的位置并且验证棋子成功移动到了新位置。

source: # 3. Check Legal Move
ko: # 3. 가능한 움직임인지 확인
zh_cn: # 3.检查合法移动

source: We need to add some check functions in `move_system`. These will help make sure the next move is allowed.
ko: `move_system`에 몇 가지 체크 함수를 추가해야 합니다. 이는 다음 수가 허용되는지 확인하는 데 도움이 됩니다.
zh_cn: 我们需要在 `move_system` 中添加一些检查函数。这些函数将有助于确保下一步移动是被允许的。

source: 1. See if the next spot is allowed for the type of piece moving.
ko: 1. 이동하는 기물의 유형이 다음 위치를 허용하는지 확인합니다.
zh_cn: 1. 查看下一个位置该类型的棋子是否可以移动。

source: 4. You can also add other check functions to be extra sure the move is allowed.
ko: 4. 다른 체크 기능을 추가하여 이동이 허용되는지 추가로 확인할 수도 있습니다.
zh_cn: 4. 您还可以添加其他检查功能，以额外确保移动是允许的。

source: Once you've made these check functions, you can use them in the main `move_system` function. You can decide how to set them up and which ones to use. We'll give an example to help:
ko: 이러한 검사 함수를 만들었으면 기본 `move_system` 함수에서 사용할 수 있습니다. 함수를 설정하는 방법과 사용할 함수를 결정할 수 있습니다. 도움이 되도록 예제를 제공하겠습니다:
zh_cn: 编写了这些校验函数之后，就可以在主 `move_system` 函数中使用它们。您可以决定如何设置它们以及使用哪些。我们将举例说明：

source: First, make a helper function called `init_world_test`. This will give back an `IWorldDispatcher` that we can use many times in the move system tests.
ko: 먼저 `init_world_test`라는 헬퍼 함수를 만듭니다. 이렇게 하면 이동 시스템 테스트에서 여러 번 사용할 수 있는 `IWorldDispatcher`가 반환됩니다.
zh_cn: 首先，创建一个名为 `init_world_test` 的辅助函数。这会返回一个 `IWorldDispatcher`，我们可以在移动系统测试中多次使用它。

source: # 4. Test Contract
ko: # 4. 테스트 컨트랙트
zh_cn: # 4.测试合约

source: To place the pieces, use our `initiate_system`. For moving them, use the `move_system`. Remember to check if a piece can be captured when using `move_system`.
ko: 기물을 배치하려면 `initiate_system`을 사용합니다. 조각을 이동하려면 `move_system`을 사용합니다.`move_system`을 사용할 때 다른 기물을 잡을 수 있는지 확인하는 것을 잊지 마세요.
zh_cn: 要放置棋子，请使用我们的`initiate_system`。要移动棋子，请使用`move_system`。使用 `move_system` 时，请记住检查棋子是否能被吃掉。

source: ## Full Code
ko: ## 전체 코드
zh_cn: ## 完整代码

source: We should list both Components and Systems in arrays, with each having CLASS_HASH as elements.
ko: 컴포넌트와 시스템 모두를 배열에 나열하고, 각각 CLASS_HASH를 구성 요소로 사용해야 합니다.
zh_cn: 我们应以数组形式列出 `Components and Systems` ，每个数组都以 CLASS_HASH 作为元素。

source: Next, we'll create our game world.
ko: 다음으로 게임 월드를 만들겠습니다.
zh_cn: 接下来，我们将创建游戏世界。

source: We use `initiate_system` to put our Square pieces on the board. Each Square holds a piece. The system's execute function needs some input, which we give it as calldata.
ko: `initiate_system`을 사용하여 정사각형 보드 조각들을 보드에 놓습니다. 각 정사각형은 보드의 한 조각씩 가지고 있습니다. 시스템의 실행 함수에는 몇 가지 입력이 필요하며, 이를 호출 데이터로 전달합니다.
zh_cn: 我们使用 `initiate_system` 将方块棋子放到棋盘上。每个方格放置一个棋子。系统的执行函数需要一些输入，我们将其作为 calldata 提供给它。

source: Let's check if a White pawn is at (0,1). Remember, to get a piece that exists on the square, you need to use the keys of the `Square` component, which are `game_id`, `x`, and `y`. Do the same check for the Black Pawn.
ko: 흰색 폰이 (0,1)에 있는지 확인해 봅시다. 사각형에 존재하는 말을 얻으려면 `Square` 구성 요소의 키인 `game_id`, `x`, `y`를 사용해야 한다는 점을 기억하세요. 검은 폰도 똑같이 확인합니다.
zh_cn: 让我们检查白方棋子是否位于 (0,1)。请记住，要获取存在于该方格上的棋子，需要使用 `Square` 组件的键，即 `game_id`、`x` 和 `y`。对黑方进行同样的检查。

source: After setting up the board, use `move_system` to make moves. Provide the current position, the next position, the player's address, and the game id.
ko: 보드를 설정한 후 `move_system`을 사용하여 이동합니다. 현재 위치, 다음 위치, 플레이어의 주소, 게임 ID를 입력합니다.
zh_cn: 设置好棋盘后，使用 `move_system` 下棋。提供当前位置、下一个位置、玩家地址和游戏 ID。

source: - Make an `initiate_system` that uses lazy init. If you're unsure about lazy init, [read up on it](https://en.wikipedia.org/wiki/Lazy_initialization). This can help make your game actions more efficient. - Add a checkmate feature. Our game doesn't end now, so decide when it should! - Include special moves like castling, En Passant Capture, or Pawn Promotion. - Make your own chess rules! You could even create your own version of the [immortal game](https://immortal.game/)
ko: - 지연 초기화를 사용하는 `initiate_system`을 만듭니다. 지연 초기화에 대해 잘 모르겠다면 [관련 내용을 읽어보세요](https://en.wikipedia.org/wiki/Lazy_initialization). 이렇게 하면 게임 동작을 더 효율적으로 만들 수 있습니다. - 체크메이트 기능을 추가합니다. 게임은 지금 끝나지 않으니 언제 끝날지 결정하세요! - Castling, En Passant Capture 또는 폰 승격과 같은 특수한 규칙들을 추가하세요. - 나만의 체스 규칙을 만들어 보세요! 나만의 [immortal game](https://immortal.game/) 버전을 만들 수도 있습니다
zh_cn: - 创建一个使用 lazy init 的`initiate_system`。如果你对 lazy init 不确定，[阅读一下](https://en.wikipedia.org/wiki/Lazy_initialization)。这有助于提高游戏操作的效率。 - 添加将死功能。我们的游戏现在还没有结束，因此请决定何时应该结束！ - 加入特殊的棋步，如投子、吃子或提卒。 - 制定自己的国际象棋规则！您甚至可以创建自己版本的 [不朽游戏](https://immortal.game/)

source: #### Issues
ko: #### 이슈

source: #### Pull requests
ko: #### 풀 리퀘스트

source: init
zh_cn: 初始化

source: auth
zh_cn: 授权

source: - [Wired - Autonomous Worlds Primer](https://www.wired.com/story/autonomous-worlds-aim-to-free-online-games-from-corporate-control/) - [0xParc - Autonomous Worlds (Part 1)](https://0xparc.org/blog/autonomous-worlds) - [Gubsheep - The Strongest Crypto Gaming Thesis](https://gubsheep.substack.com/p/the-strongest-crypto-gaming-thesis) - [Lattice - MUD: An engine for Autonomous Worlds](https://lattice.xyz/blog/mud-an-engine-for-autonomous-worlds) - [Guiltygyoza - Game 2.0](https://www.guiltygyoza.xyz/2022/07/game2) - [Guiltygyoza - Composable Engineering](https://www.guiltygyoza.xyz/2023/05/composable-engineering) - [Jay Springett - Wind-up Worlds](https://www.thejaymo.net/2022/05/06/wind-up-worlds/) - [Are.na collection on Autonomous Worlds](https://www.are.na/sylve-chevet/on-chain-realities-and-autonomous-worlds)
zh_cn: - [Wired - 自主世界入门](https://www.wired.com/story/autonomous-worlds-aim-to-free-online-games-from-corporate-control/) - [0xParc - 自主世界（第一部分）](https://0xparc.org/blog/autonomous-worlds) - [Gubsheep - 最强大的加密游戏论文](https://gubsheep.substack.com/p/the-strongest-crypto-gaming-thesis) - [Lattice - MUD：自主世界的引擎](https://lattice.xyz/blog/mud-an-engine-for-autonomous-worlds) - [Guiltygyoza - 游戏 2.0](https://www.guiltygyoza.xyz/2022/07/game2) - [Guiltygyoza - 可组合工程](https://www.guiltygyoza.xyz/2023/05/composable-engineering) - [Jay Springett - 发条世界](https://www.thejaymo.net/2022/05/06/wind-up-worlds/) - [Are.na 自主世界文集](https://www.are.na/sylve-chevet/on-chain-realities-and-autonomous-worlds)

source: [Documentation](./npm/core.md)
zh_cn: [文档](./npm/core.md)

source: [Documentation](./npm/react.md)
zh_cn: [文档](./npm/react.md)

source: - World explorers - World deployers - Games - Anaylitics
zh_cn: - 世界探索者 - 世界部署者 - 游戏 - 分析

source: You can switch from the default mining behaviour to interval mining, where a new block is created at a fixed time interval selected by the user. To enable this mode of mining, use the `--block-time <SECONDS>` flag, as demonstrated in the following example.
zh_cn: 您可以将默认的挖矿行为切换为间隔挖矿，即按照用户选择的固定时间间隔创建新区块。要启用这种挖矿模式，请使用`--block-time <SECONDS>` 标识符，如下例所示。

source: `-b, --block-time <SECONDS>` &nbsp;&nbsp;&nbsp;&nbsp; Block time in seconds for interval mining.
zh_cn: `-b, --block-time <SECONDS>` &nbsp;&nbsp;&nbsp;&nbsp; 以秒为单位的区间挖掘时间。

source: You can find the [answer](https://github.com/rkdud007/chess-dojo/blob/tutoralv2/src/systems/move.cairo) for chapter 3 here.
zh_cn: 您可以在这里找到第 3 章的 [答案](https://github.com/rkdud007/chess-dojo/blob/tutoralv2/src/systems/move.cairo)。

source: 1. Spawn `white_pawn_1` to (0,1) 2. Move `white_pawn_1` to (0,3) 3. Move `black_pawn_2` to (1,6) 4. Move `white_pawn_1` to (0,4) 5. Move `black_pawn_2` to (1,5) 6. Move `white_pawn_1` to (1,5) 7. Capture `black_pawn_2`
zh_cn: 1. 让 `white_pawn_1` 出生在 (0,1) 2. 移动 `white_pawn_1` 到 (0,3) 3. 移动 `black_pawn_2` 到 (1,6) 4. 移动 `white_pawn_1` 到 (0,4) 5. 移动 `black_pawn_2` 到 (1,5) 6. 移动 `white_pawn_1` 到 (1,5) 7. 吃掉 `black_pawn_2`
